{
    "intents": [
    {
        "tag": "goodbye",
        "patterns": [
            "Goodbye",
            "Bye",
            "See you later",
            "Take care",
            "Until next time",
            "So long",
            "Farewell",
            "Adios",
            "Catch you later",
            "Have a great day",
            "Bye for now",
            "See you soon",
            "Until we meet again",
            "Goodnight",
            "Take it easy",
            "Peace out",
            "Later gator",
            "Keep in touch",
            "Have a good one",
            "Signing off"
        ],
        "responses": [
            "See you later, thanks for visiting",
            "Goodbye! If you have any more questions, feel free to ask."
        ]
    },
    {
        "tag": "developers",
        "patterns": [
            "what is the name of your developers",
            "what is the name of your creators",
            "what is the name of the developers",
            "what is the name of the creators",
            "who created you",
            "your developers",
            "your creators",
            "who are your developers",
            "developers",
            "you are made by",
            "you are made by whom",
            "who created you",
            "who create you",
            "creators",
            "who made you",
            "Who created you?",
            "Who developed you?",
            "Who is your creator?",
            "Who made you?",
            "Who are you?",
            "Who are your developers?",
            "Who built you?",
            "Who programmed you?",
            "Who is responsible for your creation?",
            "Who designed you?",
            "Who are the minds behind you?"
        ],
        "responses": [
            "I am happy to introduce the creators of this project 'The implementation of a Virtual Assistant for the Academic Management of Students of TUP-Manila with the use of Naive Bayes Algorithm':\n\t+Mary Jane Calulang\thttps://github.com/meri-hane\n\t+Jeanne May Carolino\thttps://github.com/jeannmaycarolino\n\t+Maria Evita Juan\thttps://github.com/evyjuan\n\t+John Paul Monter\thttps://github.com/D3struf\n\t+Vincent Johanne Tenorio\thttps://github.com/Yuhan-BSCS"
        ]
    },
    {
        "tag": "name",
        "patterns": [
            "name",
            "your name",
            "do you have a name",
            "what are you called",
            "what is your name",
            "what should I call you",
            "whats your name?",
            "what are you",
            "who are you",
            "who is this",
            "what am i chatting to",
            "who am i taking to",
            "what are you",
            "what is your purpose",
            "what do you do",
            "what is your function",
            "what is your role",
            "introduce yourself",
            "tell me about yourself",
            "what can you do",
            "what are you for",
            "who am i chatting to",
            "What is the chatbots name",
            "May I know your name?",
            "What do people call you?",
            "What's the name of this chatbot?",
            "Can you tell me your name?",
            "Tell me your name."
        ],
        "responses": [
            "My name's TekBot, and I'm here to answer your curiosity about Technological University of the Philippines (TUP)!"
        ]
    },
    {
        "tag": "salutation",
        "patterns": [
            "okk",
            "okie",
            "nice work",
            "well done",
            "good job",
            "thanks for the help",
            "Thank You",
            "its ok",
            "Thanks",
            "Good work",
            "k",
            "ok",
            "okay"
        ],
        "responses": [
            "I am glad I could help!",
            "You're welcome! Is there anything else I can assist you with?"
        ]
    },
    {
        "tag": "greeting",
        "patterns": [
            "Hi",
            "Hi Hi Hi Hi Hi Hi Hi Hi Hi Hi ",
            "How are you? ",
            "How are you? How are you? How are you? How are you? How are you? How are you? How are you? How are you? How are you? How are you? How are you? How are you?",
            "Is anyone there?",
            "Is anyone there? Is anyone there? Is anyone there? Is anyone there?",
            "Hello Hello Hello Hello Hello Hello Hello Hello ",
            "Good day",
            "Good day Good day Good day Good day Good day Good day Good day ",
            "What's up",
            "What's up What's up What's up What's up What's up What's up What's up",
            "how are ya how are ya how are ya how are ya how are ya ",
            "heyy heyy heyy heyy heyy heyy heyy heyy ",
            "whatsup whatsup whatsup whatsup whatsup whatsup whatsup "
        ],
        "responses": [
            "Hello! How can I assist you?",
            "Hi there! How can I help you today?",
            "Good to see you! How can I assist you?",
            "Hello! How can I assist you today? If you have any questions or need help with something, feel free to ask!"
        ]
    },
    {
        "tag": "task",
        "patterns": [
            "What tasks can you help with?",
            "What can you do?",
            "How can you assist me?",
            "What are your capabilities?",
            "Can you perform tasks?",
            "List of tasks",
            "What are your abilities?",
            "What tasks are you capable of?",
            "Do you have any functions?",
            "What tasks do you offer?"
        ],
        "responses": [
            "I can assist you with various tasks including providing information, answering questions, and helping you with specific inquiries about TUP. Feel free to ask me anything you need help with!",
            "I'm here to help you with a wide range of tasks about TUP such as answering questions, providing information, and offering assistance. Just let me know what you need!",
            "You can ask me questions regarding TUP, and i will try to answer them"
        ]
    },
    {
        "tag": "library",
        "patterns": [
            "is there any library",
            "library facility",
            "library facilities",
            "do you have library",
            "does the college have library facility",
            "college library",
            "where can i get books",
            "book facility",
            "Where is library",
            "Library",
            "Library information",
            "Library books information",
            "Tell me about library",
            "how many libraries",
            "library",
            "books",
            "library resources",
            "borrow a book",
            "library hours",
            "library services",
            "study spaces",
            "reserve a book",
            "library catalog",
            "library location"
        ],
        "responses": [
            "There is a huge and spacious library available at TUP. The library operates from 8:00 AM to 6:00 PM. For more information, you can visit the TUP Library Facebook page: https://www.facebook.com/tuplibrary"
        ]
    },
    {
        "tag": "canteen",
        "patterns": [
            "food facilities",
            "canteen facilities",
            "canteen facility",
            "is there any canteen",
            "Is there a cafetaria in college",
            "Does college have canteen",
            "Where is canteen",
            "where is cafetaria",
            "Where is the canteen located?",
            "What are the opening hours of the canteen?",
            "Does the canteen serve vegetarian options?",
            "Can I find halal food in the canteen?",
            "What type of food does the canteen offer?",
            "Is the canteen open during weekends?",
            "Are there any special discounts available at the canteen?",
            "How can I pay at the canteen?",
            "Can I bring outside food into the canteen?",
            "Is there a seating area in the canteen?"
        ],
        "responses": [
            "The canteen is located in CAFA Building near the Chapel. The stalls accepts GCASH and Cash as payment. It is open from 8:00 AM to 6:00 PM."
        ]
    },
    {
        "tag": "principal",
        "patterns": [
            "what is the name of principal",
            "what is the principal name",
            "principal name",
            "Who is college principal",
            "Where is principal's office",
            "principal",
            "name of principal",
            "principal's name",
            "who is the principal?",
            "principal information"
        ],
        "responses": [
            "The current principal of TUP is Engr. Reynaldo P. Ramos, PhD., EnP."
        ]
    },
    {
        "tag": "location",
        "patterns": [
            "where is the college located",
            "college is located at",
            "where is college",
            "where is college located",
            "address of college",
            "how to reach college",
            "TUP location",
            "TUP address",
            "wheres the college",
            "how can I reach college",
            "whats is the college address",
            "what is the address of college",
            "address",
            "location",
            "Where is TUP located?",
            "What is the address of TUP?",
            "Where can I find TUP?",
            "Location of TUP?",
            "Address of TUP?"
        ],
        "responses": [
            "TUP Main Campus is located at Ayala Boulevard, Ermita, Manila, Philippines.",
            "The address of TUP Main Campus is Ayala Boulevard, Ermita, Manila, Philippines."
        ]
    },
    {
        "tag": "hours",
        "patterns": [
            "What are the operating hours of TUP?",
            "When is TUP open?",
            "What are the working hours of TUP?",
            "Hours of operation of TUP?",
            "When does TUP close?",
            "working days",
            "when are you guys open",
            "what are your hours",
            "hours of operation",
            "when is the college open",
            "college timing",
            "what about college timing",
            "is college open on saturday",
            "tell something about college timing",
            "what is the college hours",
            "when should i come to college",
            "when should i attend college",
            "what is my college time",
            "college timing",
            "timing college",
            "TUP hours"
        ],
        "responses": [
            "The operating hours of Technological University of the Philippines are from 8:00 AM to 5:00 PM, Monday to Friday"
        ]
    },
    {
        "tag": "facilities",
        "patterns": [
            "What facilities college provide",
            "What are the facilities in tup",
            "College facility",
            "tup facility",
            "What are college facilities",
            "facilities provided",
            "What facilities does TUP offer?",
            "Can you tell me about the amenities at TUP?",
            "What are the facilities available at TUP?",
            "Could you list the facilities provided by TUP?",
            "Tell me about the infrastructure at TUP.",
            "I want to know more about the facilities.",
            "What services does TUP provide?",
            "Can you describe the resources available at TUP?",
            "What are the amenities like at TUP?",
            "Give me information about TUP's facilities."
        ],
        "responses": [
            "TUP provides various amenities such as auditoriums, a library and information center, an indoor court, a gymnasium, accommodation facilities, a dining area, labs, a medical clinic, a chapel, diverse clubs, a performance stage, and an open field."
        ]
    },
    {
        "tag": "tup_history",
        "patterns": [
            "What is the history of TUP?",
            "Give me a brief overview of TUP's history.",
            "When was TUP established?",
            "Tell me about the origins of TUP.",
            "What led to the founding of TUP?",
            "How did TUP evolve over the years?",
            "Explain the historical background of TUP.",
            "Can you provide a timeline of TUP's development?",
            "What significant events shaped TUP's history?",
            "I want to know more about TUP's past.",
            "Describe the journey of TUP from its inception.",
            "What were the early years of TUP like?",
            "When did TUP transition from MTS to PCAT?",
            "Share some key milestones in TUP's history.",
            "How has TUP's history influenced its present status?"
        ],
        "responses": [
            "The history of the Technological University of the Philippines (TUP) is a fascinating journey that began in 1901 with the establishment of the Manila Trade School (MTS). Initially focused on imparting practical skills to Filipino adults in trades like carpentry, telegraphy, and machine shop work, MTS later evolved into the Philippine School of Arts and Trades (PSAT) in 1910, offering intermediate grade courses. By 1959, PSAT was renamed the Philippine College of Arts and Trades (PCAT), pioneering graduate degree programs in industrial education. Finally, in 1978, PCAT was elevated to TUP status by virtue of President Decree No. 1518. Since then, TUP has continued to lead in providing higher vocational and technical education, contributing significantly to the country's industrial and technological landscape.\n 2. The rich history of the Technological University of the Philippines (TUP) spans over a century, tracing its roots back to the Manila Trade School (MTS) established in 1901. From its humble beginnings, MTS evolved into the Philippine School of Arts and Trades (PSAT) in 1910, offering a wider array of courses and pioneering industrial education in the Philippines. This transformation continued with the renaming of PSAT to the Philippine College of Arts and Trades (PCAT) in 1959, which subsequently became TUP in 1978. Throughout its history, TUP has been at the forefront of providing advanced vocational, technical, and professional education, shaping generations of skilled professionals and contributing significantly to the nation's development.\n For more detailed information, you can visit <a target=\"_blank\" href=\"https://tup.edu.ph/page/about\"> here</a>\n"
        ]
    },
    {
        "tag": "tup_mandate",
        "patterns": [
            "What is the mandate of the Technological University of the Philippines?",
            "Can you summarize the objectives of TUP as stated in the mandate?",
            "What are the key areas outlined in the TUP mandate?",
            "Describe the sector outcome mentioned in the TUP mandate.",
            "What are the organizational outcomes specified in the TUP mandate?",
            "Who issued Presidential Decree No. 1518, and what does it entail?",
            "What led to the conversion of the Philippine College of Arts and Trades into TUP?",
            "What significant policies and recommendations influenced the establishment of TUP?",
            "How does TUP aim to contribute to national development, according to the mandate?",
            "Can you explain the role of TUP in providing vocational, technical, and professional education?",
            "What measures are mentioned in the TUP mandate to promote economic productivity and innovation?",
            "How does the TUP mandate address poverty reduction and empowerment?",
            "Who constitutes the governing body of TUP, according to Presidential Decree No. 1518?",
            "What powers and duties are granted to the Board of Regents of TUP?",
            "What is the significance of Section 20 of Presidential Decree No. 1518?"
        ],
        "responses": [
            "The Technological University of the Philippines is mandated to provide higher and advanced vocational, technical, industrial, technological and professional education and training in the industries and technology, and practical arts leading to certificates, diplomas, and degrees; to provide progressive leadership in applied research, developmental studies in technical, industrial and technological fields and production using indigenous materials, effect technology transfer in the countryside; and to provide expertise in the development of small and medium scale industries in identified growth-centers.\n For more detailed information, you can visit <a target=\"_blank\" href=\"https://tup.edu.ph/pages/about/tup-mandate\"> here</a>"
        ]
    },
    {
        "tag": "tup_vision",
        "patterns": [
            "What is the vision statement of the Technological University of the Philippines?",
            "Can you provide me with TUP's vision?",
            "What is TUP's vision for its future?",
            "Could you summarize TUP's vision as a premier state university?",
            "What does TUP aim to achieve with its vision statement?"
        ],
        "responses": [
            "TUP: A premier state university with recognized excellence in engineering and technology education at par with leading universities in the ASEAN region.\n For more detailed information, you can visit <a target=\"_blank\" href=\"https://tup.edu.ph/pages/about/vision-mission-core-values-strategic-goals\"> here</a>"
        ]
    },
    {
        "tag": "tup_mission",
        "patterns": [
            "What is the mission of the Technological University of the Philippines?",
            "Can you tell me about TUP's mission?",
            "What does TUP aim to achieve according to its mission statement?",
            "Could you summarize TUP's mission in providing education and training?",
            "What are the key objectives outlined in TUP's mission statement?"
        ],
        "responses": [
            "The University shall provide higher and advanced vocational, technical, industrial, technological and professional education and training in industries and technology, and in practical arts leading to certificates, diplomas and degrees. It shall provide progressive leadership in applied research, developmental studies in technical, industrial, and technological fields and production using indigenous materials; effect technology transfer in the countryside; and assist in the development of small-and- medium scale industries in identified growth centers.\n For more detailed information, you can visit <a target=\"_blank\" href=\"https://tup.edu.ph/pages/about/vision-mission-core-values-strategic-goals\"> here</a>"
        ]
    },
    {
        "tag": "tup_core_values",
        "patterns": [
            "Tell me about the principles embraced by Technological University of the Philippines.",
            "What principles guide the governance of TUP?",
            "How does TUP demonstrate accountability as part of its core values?",
            "In what ways does TUP promote unity among its stakeholders?",
            "Can you elaborate on how TUP incorporates transparency into its core values?"
        ],
        "responses": [
            "Core Values\nT - Transparent and participatory governance\nU - Unity in the pursuit of TUP mission, goals, and objectives\nP - Professionalism in the discharge of quality service\nI - Integrity and commitment to maintain the good name of the University\nA - Accountability for individual and organizational quality performance\nN - Nationalism through tangible contribution to the rapid economic growth of the country\nS - Shared responsibility, hard work, and resourcefulness in compliance with the mandates of the university\n\nFor more detailed information, you can visit <a target=\"_blank\" href=\"https://tup.edu.ph/pages/about/vision-mission-core-values-strategic-goals\">here</a>."
        ]
    },
    {
        "tag": "tup_strategic_goals",
        "patterns": [
            "What are the strategic goals of TUP?",
            "Can you list the main objectives of TUP's strategic plan?",
            "I'd like to know about the strategic priorities set by TUP.",
            "How does TUP aim to enhance its curricular offerings?",
            "What efforts does TUP undertake to excel in engineering and technology research?",
            "Could you elaborate on TUP's approach to community services as part of its strategic goals?",
            "How does TUP plan to strengthen its capability and competence?",
            "What initiatives are in place to modernize TUP's university system and manage resources efficiently?",
            "In what ways does TUP seek to achieve increased financial viability?",
            "Can you provide details about TUP's network enhancement and collaboration initiatives?"
        ],
        "responses": [
            "Strategic Goals\nGoal 1 - Quality & Responsive Curricular Offerings\nGoal 2 - Excellence in Engineering & Technology Research\nGoal 3 - Leadership in Community Services\nGoal 4 - Strengthening Capability & Competence\nGoal 5 - Modernized University System & Efficient Management of Resources\nGoal 6 - Increased Financial Viability\nGoal 7 - Enhanced Network & Sustained Collaboration Initiatives\n\nFor more detailed information, you can visit <a target=\"_blank\" href=\"https://tup.edu.ph/pages/about/vision-mission-core-values-strategic-goals\">here</a>."
        ]
    },
    {
        "tag": "tup_quality_policy",
        "patterns": [
            "What is TUP's quality policy?",
            "Could you summarize TUP's commitment to quality education?",
            "What does TUP emphasize in its approach to research and extension projects?",
            "How does TUP aim to continually improve its value to customers?",
            "What steps does TUP take to enhance personnel competence?",
            "Can you explain how TUP's quality management system works?",
            "Is TUP's quality management system compliant with statutory and regulatory requirements?",
            "What are the key components of TUP's quality policy?",
            "Does TUP have specific goals related to quality improvement?",
            "Can you provide more details about TUP's commitment to quality higher and advanced education?"
        ],
        "responses": [
            "TUP shall commit to provide quality higher and advanced education; conduct relevant research and extension projects; continually improve its value to customers through enhancement of personnel competence and effective quality management system compliant to statutory and regulatory requirements.\n\nFor more detailed information, you can visit <a target=\"_blank\" href=\"https://tup.edu.ph/pages/about/vision-mission-core-values-strategic-goals\">here</a>."
        ]
    },
    {
        "tag": "tup_hymn",
        "patterns": [
            "Who composed the music for the TUP Hymn?",
            "Who wrote the Filipino version of the TUP Hymn?",
            "What does the TUP Hymn symbolize?",
            "What values are reflected in the English rendition of the TUP Hymn?",
            "How does the TUP Hymn celebrate the unity of TUPians?"
        ],
        "responses": [
            "TUP HYMN\n\nMusic by Prof. Romeo P. Verayo, Sr.\nFilipino Version by Prof. Emerita R. Verayo\n\nKami sa 'yo'y nagpupugay TUP\nAng 'yong tanglaw, liwanag sa aming landas\nDiwa mo'y ginto, pusong wagas\nAlay naming sa iyo'y lahat ng hirap\nBuong pag-ibig at paglilingkod na ganap\n\nKay dami ng anak na 'yong pinagyaman\nDahil sa 'yo ngayo'y haligi ng bayan\nMoog ka ng laya at dangal\nTeknolohikal na Unibersidad ng Pilipinas\nBantayog ka ng lahi naming minamahal.\n\nEnglish Version by Dr. Milagros F. Lomotan\n\nHail to you, Alma Mater, hail TUP\nYour sons unite, and labor dignity uphold,\nStrong minds, mighty hearts priceless that gold\nThese we offer you and all mankind\nHail oh hail -\nAcross the seas we'll toil for you,\nAlma Mater dear\nThey're nation builders all, alumni ever true\nWorkers of note, trail blazers, artists\nSelfless souls, men and women free\nWe honor thee\nTechnological University of the Philippines\nBeloved school we honor you forever more!\n\nFor more detailed information, you can visit <a target=\"_blank\" href=\"https://tup.edu.ph/pages/about/tup-hymn\">here</a>."
        ]
    },
    {
        "tag": "tup_code",
        "patterns": [
            "What is the main purpose of the TUP Code of 2022?",
            "Could you outline the key provisions of the TUP Code of 2022?",
            "What are the rights and responsibilities of students according to the TUP Code of 2022?",
            "How does the TUP Code of 2022 address the conduct expected from faculty and staff?",
            "Are there any specific guidelines for administrative conduct outlined in the TUP Code of 2022?",
            "How does TUP ensure compliance with the TUP Code of 2022?",
            "What measures are taken to enforce the TUP Code of 2022?",
            "Has there been any recent updates or revisions to the TUP Code of 2022?",
            "Where can I find the full text of the TUP Code of 2022 for reference?",
            "Can you provide examples of consequences for violating the TUP Code of 2022?"
        ],
        "responses": [
            "The TUP Code of 2022 embodies the principles, values, and standards that guide the Technological University of the Philippines (TUP) community towards its mission of providing quality education and fostering excellence in various fields. This comprehensive document outlines the rights, responsibilities, and conduct expected from students, faculty, staff, and administrators within the university. It serves as a cornerstone of TUP's commitment to academic integrity, ethical behavior, and a conducive learning environment.\n\nFor more detailed information, you can visit <a target=\"_blank\" href=\"https://tup.edu.ph/pages/about/tupcode-of-2022\">here</a>."
        ]
    },
    {
        "tag": "officials_top_management",
        "patterns": [              
            "Who is the University President of TUP?",
            "What is the email address of the VP for Academic Affairs at TUP?",
            "Who holds the position of VP for Research & Extension at TUP?",
            "How can I contact the VP for Administration & Finance at TUP?",
            "Who is responsible for Planning, Development & Special Concerns at TUP?",
            "Can you provide the contact information for the Office of the President at TUP?",
            "Who is the VP for Academic Affairs, and what are their responsibilities?",
            "What is the email address of the VP for Planning, Development & Special Concerns at TUP?",
            "How can I reach the top management of TUP for administrative matters?",
            "Who is the VP for Research & Extension, and how can I contact them?"
        ],
        "responses": [[
            {
                "Office/Unit": "Office of the President",
                "Designation": "University President",
                "Name": "Engr. Reynaldo P. Ramos, PhD., EnP",
                "Email": "reynaldo_ramos@tup.edu.ph"
            },
            {
                "Office/Unit": "Office of the Vice President for Academic Affairs",
                "Designation": "VP for Academic Affairs",
                "Name": "Dr. Ryan C. Reyes",
                "Email": "ryan_reyes@tup.edu.ph, vpaa@tup.edu.ph"
            },
            {
                "Office/Unit": "Office of the Vice President for Research & Extension",
                "Designation": "VP for Research & Extension",
                "Name": "Dr. Hasmin T. Ignacio",
                "Email": "hasmin_ignacio@tup.edu.ph, vpaa@tup.edu.ph"
            },
            {
                "Office/Unit": "Office of the Vice President for Administration & Finance",
                "Designation": "VP for Administration & Finance",
                "Name": "Ms. Purabella R. Agron, CPA",
                "Email": "purabella_agron@tup.edu.ph, vpaf@tup.edu.ph"
            },
            {
                "Office/Unit": "Office of the Vice President for Planning, Development & Special Concerns",
                "Designation": "VP for Planning, Development & Special Concerns",
                "Name": "Dr. Connie C. Aunario",
                "Email": "connie_aunario@tup.edu.ph"
            }
        ]]
    },
    {
        "tag": "officials_office_president",
        "patterns": [              
            "Who is the Acting Executive Assistant in the Office of the President?",
            "What is the email address of the University/Board Secretary?",
            "Who heads the Internal Control Office/Internal Audit Services?",
            "What is the email address of the Chairperson of the Bids & Awards Committee for Infrastructure Equipment?",
            "Who is the Chairperson of the Bids & Awards Committee for Goods and Services?",
            "Who is the Director of the Institutional/International Linkages & External Affairs Office?"
        ],
        "responses": [[
            {
                "Office/Unit": "Office of the President",
                "Designation": "Acting Executive Assistant",
                "Name": "Mr. Manuel P. Inanuran",
                "Email": "manuel_inanuran@tup.edu.ph"
            },
            {
                "Office/Unit": "Office of Board Secretary",
                "Designation": "University/Board Secretary",
                "Name": "Ms. Mona J. Purganan",
                "Email": "mona_purganan@tup.edu.ph / boardsec@tup.edu.ph"
            },
            {
                "Office/Unit": "Internal Control Office / Internal Audit Services",
                "Designation": "Head",
                "Name": "Mrs. Purabella Agron",
                "Email": "purabella_agron@tup.edu.ph / ico@tup.edu.ph"
            },
            {
                "Office/Unit": "Bids & Awards Committee (Infrastructure Equipment - Public Bidding)",
                "Designation": "Chairperson",
                "Name": "Dr. Connie C. Aunario",
                "Email": "connie_aunario@tup.edu.ph / bac@tup.edu.ph"
            },
            {
                "Office/Unit": "Bids & Awards Committee (Goods and Services - Public Bidding and Alternative Modes of Procurement for Infrastructure, Equipment, Goods and Services - Below 1M)",
                "Designation": "Chairperson",
                "Name": "Dr. Ryan C. Reyes",
                "Email": "ryan_reyes@tup.edu.ph / bac@tup.edu.ph"
            },
            {
                "Office/Unit": "Institutional/International Linkages & External Affairs Office",
                "Designation": "Director",
                "Name": "Assoc. Prof. Dr. Gina L. Basa",
                "Email": "gina_basa@tup.edu.ph / linkages@tup.edu.ph"
            }
        ]]
    },
    {
        "tag": "officials_academic_affairs",
        "patterns": [              
            "Who is the Dean of the College of Industrial Technology?",
            "What is the email address of the College Secretary of the College of Industrial Technology?",
            "Who is the Head of the Basic Industrial Technology department?",
            "What is the email address of the Head of the Food and Apparel Technology department?",
            "Who is the Head of the Graphic and Arts Department?",
            "What is the email address of the Head of the Mechanical Engineering Technology department?",
            "Who is the OIC-Head of the Power Plant Engineering Technology department?",
            "What is the email address of the Head of the Electrical Engineering Technology department?",
            "Who is the OIC-Head of the Electronic Engineering Technology department?",
            "What is the email address of the Head of the Civil Engineering Technology department?",
            "Who is the Dean of the College of Industrial Education?",
            "What is the email address of the College Secretary of the College of Industrial Education?",
            "Who is the Head of the Professional Industrial Education department?",
            "What is the email address of the Head of the Student Teaching department?",
            "Who is the Head of the Technical Arts department?",
            "What is the email address of the Head of the Home Economics department?",
            "Who is the Dean of the College of Engineering?",
            "What is the email address of the College Secretary of the College of Engineering?",
            "Who is the OIC-Head of the Electronics Communication Engineering department?",
            "What is the email address of the OIC-Head of the Electrical Engineering department?",
            "Who is the Head of the Mechanical Engineering department?",
            "What is the email address of the Head of the Civil Engineering department?",
            "Who is the Acting Dean of the College of Science?",
            "What is the email address of the College Secretary of the College of Science?",
            "Who is the Head of the Chemistry department?",
            "What is the email address of the Head of the Computer Studies department?",
            "Who is the Head of the Mathematics department?",
            "Who is the Head of the Physics department, and what is their email address?",
            "Who serves as the Dean of the College of Architecture and Fine Arts, and what email can they be reached at?",
            "Who is the College Secretary of the College of Architecture and Fine Arts, and how can they be contacted?",
            "Who is the Head of the Graphics department?",
            "Who is the Head of the Architecture department, and what is their email?",
            "Who heads the Fine Arts department, and what is their email?",
            "What is the name and email address of the Dean of the College of Liberal Arts?",
            "Who is the College Secretary of the College of Liberal Arts?",
            "Who is the OIC-Head of the Languages department?",
            "Who serves as the OIC-Head of the Social Science department?",
            "Who is the Head of the Entrepreneurship and Management department, and how can they be reached?",
            "Who is the Head of the Hospitality Management department?",
            "Who serves as the Head of the Physical Education department, and what is their email?",
            "Who is the Director of the Graduate Programs, and what email address can they be reached at?",
            "Who is the Director of the Office of Alumni Relations, and how can they be contacted?",
            "Who holds the position of University Registrar, and what is their email?",
            "Who is the Director of Academic Programs?",
            "Who is the Dean of the Office of Student Affairs, and what is their email?",
            "Who is the Director of the Expanded Tertiary Education and Equivalent Accreditation Program?",
            "Who is in charge of University Sports, and what is their email?",
            "Who is the Head of the Sports and Cultural Affairs department?",
            "Who is the Head of the Cultural Affairs department, and how can they be reached?",
            "Who serves as the Director of Industrial Relations and Job Placement?",
            "Who is the Director of the University Library & Learning Resources, and what email address can they be reached at?",
            "Who holds the position of Assistant Director in the University Library & Learning Resources department?",
            "Who is the Head of the Admissions Office, and what email can they be reached at?",
            "Who is the Head of the Guidance Office, and what is their email address?",
            "Who serves as the Director of the Educational Resource Development Services, and how can they be reached?",
            "Who is the Director of the National Service Training Program (NSTP), and what email can they be reached at?",
            "Who is the Administrator of TUP Cuenca Extension in Cuenca, Batangas?",
            "Who is the Administrator of TUP Lopez Quezon?",
            "Who is the Coordinator for TUP Lopez, Quezon?",
            "Who is the Curator of the TUP Museum?",
            "Who is the Faculty-in-Charge at the TUP Museum?"
        ],
        "responses": [[
            {
                "Office/Unit": "College of Industrial Technology",
                "Designation": "Dean",
                "Name": "Asst. Prof. Elpidio S. Virrey",
                "Email": "elpidio_virrey@tup.edu.ph, cit@tup.edu.ph"
            },
            {
                "Office/Unit": "College of Industrial Technology",
                "Designation": "College Secretary",
                "Name": "Assoc. Prof. Dr. May Ann R. Codera",
                "Email": "mayann_codera@tup.edu.ph, cit@tup.edu.ph"
            },
            {
                "Office/Unit": "Basic Industrial Technology",
                "Designation": "Head",
                "Name": "Assoc. Prof. Jose C. Delos Santos Jr.",
                "Email": "jose_delossantos@tup.ed.ph, bit@tup.edu.ph"
            },
            {
                "Office/Unit": "Food and Apparel Technology",
                "Designation": "Head",
                "Name": "Assoc. Prof. Bernadeth Gilbor",
                "Email": "bernadeth_gilbor@tup.edu.ph"
            },
            {
                "Office/Unit": "Graphic and Arts Department",
                "Designation": "Head",
                "Name": "Asst. Prof. Ms. Lotis Palma-Buco",
                "Email": "lotis_buco@tup.edu.ph"
            },
            {
                "Office/Unit": "Mechanical Engineering Technology",
                "Designation": "Head",
                "Name": "Assoc. Prof. Andrew John A. Mabaquiao",
                "Email": "andrewjohn_mabaquiao@tup.edu.ph"
            },
            {
                "Office/Unit": "Power Plant Engineering Technology",
                "Designation": "OIC-Head",
                "Name": "Assoc. Prof. Andrew John A. Mabaquiao",
                "Email": "andrewjohn_mabaquiao@tup.edu.ph"
            },
            {
                "Office/Unit": "Electrical Engineering Technology",
                "Designation": "Head",
                "Name": "Assoc. Prof. Venerando Sison",
                "Email": "venerando_sison@tup.edu.ph, eet@tup.edu.ph"
            },
            {
                "Office/Unit": "Electronic Engineering Technology",
                "Designation": "OIC-Head",
                "Name": "Asst. Prof. Aimee G. Acoba",
                "Email": "aimee_acoba@tup.edu.ph"
            },
            {
                "Office/Unit": "Civil Engineering Technology",
                "Designation": "Head",
                "Name": "Asst. Prof. Samuel M. Pacba",
                "Email": "samuel_pacba@tup.edu.ph"
            },
            {
                "Office/Unit": "College of Industrial Education",
                "Designation": "Dean",
                "Name": "Dr. Apollo P. Portez",
                "Email": "apollo_portez@tup.edu.ph, cie@tup.edu.ph"
            },
            {
                "Office/Unit": "College of Industrial Education",
                "Designation": "College Secretary",
                "Name": "Assoc. Prof. Dr. Werson De Asis",
                "Email": "werson_deasis@tup.edu.ph, cie@tup.edu.ph"
            },
            {
                "Office/Unit": "Professional Industrial Education",
                "Designation": "Head",
                "Name": "Assoc. Prof. Dr. Neil Andrew Calayag",
                "Email": "neilandrew_calayag@tup.edu.ph, pie@tup.edu.ph"
            },
            {
                "Office/Unit": "Student Teaching",
                "Designation": "Head",
                "Name": "Assoc. Prof. Dr. Sylvia B. Guevarra",
                "Email": "sylvia_guevarra@tup.edu.ph, st@tup.edu.ph"
            },
            {
                "Office/Unit": "Technical Arts",
                "Designation": "Head",
                "Name": "Assoc Prof. Allan Villariza",
                "Email": "allan_villariza@tup.edu.ph, tad@tup.edu.ph"
            },
            {
                "Office/Unit": "Home Economics",
                "Designation": "Head",
                "Name": "Assoc. Prof. Dr. Dorothy Manalansan",
                "Email": "dorothy_manalansan@tup.edu.ph, he@tup.edu.ph"
            },
            {
                "Office/Unit": "College of Engineering",
                "Designation": "Dean",
                "Name": "Dr. Lean S. Tolentino",
                "Email": "lean_tolentino@tup.edu.ph, coe@tup.edu.ph"
            },
            {
                "Office/Unit": "College of Engineering",
                "Designation": "College Secretary",
                "Name": "Asst. Prof. Lucia V. Ortega",
                "Email": "lucia_ortega@tup.edu.ph"
            },
            {
                "Office/Unit": "Electronics Communication Engineering",
                "Designation": "OIC-Head",
                "Name": "Engr. Cherry G. Pascion",
                "Email": "cherry_pascion@tup.edu.ph"
            },
            {
                "Office/Unit": "Electrical Engineering",
                "Designation": "OIC-Head",
                "Name": "Engr. Roel M. Mendoza",
                "Email": "roel_mendoza@ tup.edu.ph"
            },
            {
                "Office/Unit": "Mechanical Engineering",
                "Designation": "Head",
                "Name": "Asst. Prof. Antiro M. Ca-ay",
                "Email": "antiro_caay@tup.edu.ph, mechanical@tup.edu.ph"
            },
            {
                "Office/Unit": "Civil Engineering",
                "Designation": "Head",
                "Name": "Assoc. Prof. Teodinis P. Garcia",
                "Email": "teodinis_garcia@tup.edu.ph, civil@tup.edu.ph"
            },
            {
                "Office/Unit": "College of Science",
                "Designation": "Acting Dean",
                "Name": "Dr. Joshua T. Soriano",
                "Email": "joshua_soriano@tup.edu.ph, cos@tup.edu.ph"
            },
            {
                "Office/Unit": "College of Science",
                "Designation": "College Secretary",
                "Name": "Assoc. Prof. Jervie M. Oliveros",
                "Email": "jervie_oliveros@tup.edu.ph, cossec@tup.edu.ph"
            },
            {
                "Office/Unit": "Chemistry",
                "Designation": "Head",
                "Name": "Asst. Prof. Maria Carmelita Sapina",
                "Email": "mariacarmelita_sapina@tup.edu.ph, chemistry@tup.edu.ph"
            },
            {
                "Office/Unit": "Computer Studies",
                "Designation": "Head",
                "Name": "Asst. Prof. Dr. Dolores Montesines",
                "Email": "dolores_montesines@tup.edu.ph, computer@tup.edu.ph"
            },
            {
                "Office/Unit": "Mathematics",
                "Designation": "Head",
                "Name": "Assoc. Prof. Maria Teresa Mandi",
                "Email": "materesa_mandi@tup.edu.ph, math@tup.edu.ph"
            },
            {
                "Office/Unit": "Physics",
                "Designation": "Head",
                "Name": "Asst. Prof. Dr. Aldrin G. Chang",
                "Email": "aldrin_chang@tup.edu.ph, physics@tup.edu.ph"
            },
            {
                "Office/Unit": "College of Architecture and Fine Arts",
                "Designation": "Dean",
                "Name": "Assoc. Prof. Elpidio T. Balais, Jr.",
                "Email": "elpidio_balais@tup.edu.ph, cafa@tup.edu.ph"
            },
            {
                "Office/Unit": "College of Architecture and Fine Arts",
                "Designation": "College Secretary",
                "Name": "Ar. Kenneth V. Tributo",
                "Email": "kenneth_tributo@tup.edu.ph, cafa@tup.edu.ph"
            },
            {
                "Office/Unit": "Graphics",
                "Designation": "Head",
                "Name": "Prof. Lowell Quey S. Fabrigar",
                "Email": "lowellquey_fabrigar@tup.edu.ph"
            },
            {
            "Office/Unit": "Architecture",
            "Designation": "Head",
            "Name": "Asst. Prof. Rosellia Rowena A. Manzano",
            "Email": "roselliarowena_manzano@tup.edu.ph, architecture@tup.edu.ph"
            },
            {
            "Office/Unit": "Fine Arts",
            "Designation": "Head",
            "Name": "Mr. Ramon T. Dela Cruz",
            "Email": "ramon_delacruz@tup.edu.ph, finearts@tup.edu.ph"
            },
            {
            "Office/Unit": "College of Liberal Arts",
            "Designation": "Dean",
            "Name": "Dr. Michael Bhobet Baluyot",
            "Email": "michaelbhobet_baluyot@tup.edu.ph, cla@tup.edu.ph"
            },
            {
            "Office/Unit": "College of Liberal Arts",
            "Designation": "College Secretary",
            "Name": "Ms. Rose Ann Panti",
            "Email": "roseann_panti@tup.edu.ph, cla@tup.edu.ph"
            },
            {
            "Office/Unit": "Languages",
            "Designation": "OIC-Head",
            "Name": "Dr. Michael Bhobet Baluyot",
            "Email": "michaelbhobet_baluyot@tup.edu.ph"
            },
            {
            "Office/Unit": "Social Science",
            "Designation": "OIC-Head",
            "Name": "Prof. Noemie Bunye",
            "Email": "noemie_bunye@tup.edu.ph"
            },
            {
            "Office/Unit": "Entrepreneurship and Management",
            "Designation": "Head",
            "Name": "Asst. Prof. Jerson A. Monsad",
            "Email": "jerson_monsad@tup.edu.ph, dem@tup.edu.ph"
            },
            {
            "Office/Unit": "Hospitality Management",
            "Designation": "Head",
            "Name": "Dr. Ma. Dina D. Jimenez",
            "Email": "madina_jimenez@tup.edu.ph"
            },
            {
            "Office/Unit": "Physical Education",
            "Designation": "Head",
            "Name": "Asst. Prof. Bernadette L. Alavazo",
            "Email": "bernadette_alavazo@tup.edu.ph, pe@tup.edu.ph"
            },
            {
            "Office/Unit": "Graduate Programs",
            "Designation": "Director",
            "Name": "Prof. Dr. Melbern Rose C. Maltezo",
            "Email": "melbernrose_maltezo@tup.edu.ph, graduate@tup.edu.ph"
            },
            {
            "Office/Unit": "Office of Alumni Relations",
            "Designation": "Director",
            "Name": "Prof. Dr. Arjun G. Ansay",
            "Email": "arjun_ansay@tup.edu.ph, alumni@tup.edu.ph"
            },
            {
            "Office/Unit": "Registrar",
            "Designation": "University Registrar",
            "Name": "Prof. Dr. Rosemarie Theresa M. Cruz",
            "Email": "rosemarietheresa_cruz@tup.edu.ph, registrar@tup.edu.ph"
            },
            {
            "Office/Unit": "Academic Programs",
            "Designation": "Director",
            "Name": "Assoc. Prof. Ghazali Illuminada R. Sison",
            "Email": "ghazaliiluminada_sison@tup.edu.ph"
            },
            {
            "Office/Unit": "Office of Student Affairs",
            "Designation": "Dean",
            "Name": "Assoc. Prof. Dr. Margaret S. Aquino",
            "Email": "margaret_aquino@tup.edu.ph, osa@tup.edu.ph"
            },
            {
            "Office/Unit": "Expanded Tertiary Education and Equivalent Accreditation Program",
            "Designation": "Director",
            "Name": "Assoc. Prof. Dr. Kevien C. Dela Cruz",
            "Email": "kevien_delacruz@tup.edu.ph, eteeap@tup.edu.ph"
            },
            {
            "Office/Unit": "University Sports",
            "Designation": "Head",
            "Name": "Mr. Allan D. Soria",
            "Email": "allan_soria@tup.edu.ph"
            },
            {
            "Office/Unit": "Sports and Cultural Affairs",
            "Designation": "Director",
            "Name": "Asst. Prof. Bernadette S. Alavazo",
            "Email": "bernadette_alavazo@tup.edu.ph"
            },
            {
            "Office/Unit": "Cultural Affairs",
            "Designation": "Head",
            "Name": "Prof. Beverly C. Yabut",
            "Email": "beverly_yabut@tup.edu.ph"
            },
            {
            "Office/Unit": "Industrial Relations and job Placement",
            "Designation": "Director",
            "Name": "Assoc. Prof. Ruel Aggabao",
            "Email": "ruel_aggabao@tup.edu.ph"
            },
            {
            "Office/Unit": "University Library & Learning Resources",
            "Designation": "Director",
            "Name": "Dr. Olga M. Ong",
            "Email": "olga_ong@tup.edu.ph, library@tup.edu.ph"
            },
            {
            "Office/Unit": "University Library & Learning Resources",
            "Designation": "Asst. Director",
            "Name": "Ms. Maryfel Lumen",
            "Email": "maryfel_lumen@tup.edu.ph"
            },
            {
            "Office/Unit": "Admissions Office",
            "Designation": "Head",
            "Name": "Prof. Dr. Rosemarie Theresa M. Cruz",
            "Email": "rosemarietheresa_cruz@tup.edu.ph, admissions@tup.edu.ph"
            },
            {
            "Office/Unit": "Guidance Office",
            "Designation": "Head",
            "Name": "Dr. Enrico S. Lucena",
            "Email": "enrico_lucena@tup.edu.ph, guidance@tup.edu.ph"
            },
            {
            "Office/Unit": "Educational Resource Development Services",
            "Designation": "Director",
            "Name": "Dr. Apollo P. Portez",
            "Email": "apollo_portez@tup.edu.ph, erds@tup.edu.ph"
            },
            {
            "Office/Unit": "National Service Training Program (NSTP)",
            "Designation": "Director",
            "Name": "Mr. Reggie Campomanes",
            "Email": "reggie_campomanes@tup.edu.ph, nstp@tup.edu.ph"
            },
            {
            "Office/Unit": "TUP Cuenca Extension, Cuenca, Batangas",
            "Designation": "Administrator",
            "Name": "Dr. Romeo S. Ebonite",
            "Email": "romeo_ebonite@tup.edu.ph"
            },
            {
            "Office/Unit": "TUP Lopez Quezon",
            "Designation": "Administrator",
            "Name": "Assoc. Prof. Elpidio S. Virrey",
            "Email": "elpidio_virrey@tup.edu.ph"
            },
            {
            "Office/Unit": "TUP Lopez, Quezon",
            "Designation": "Coordinator",
            "Name": "Mr. Carlos S. Perion",
            "Email": "carlos_perion@tup.edu.ph"
            },
            {
            "Office/Unit": "TUP Museum",
            "Designation": "Curator",
            "Name": "Prof. Dr. Dionisio A. Espression Jr.",
            "Email": "dionisio_espression@tup.edu.ph"
            },
            {
            "Office/Unit": "TUP Museum",
            "Designation": "Faculty-in-Charge",
            "Name": "Ms. Marcelina P. Puga",
            "Email": "marcelina_puga@tup.edu.ph"
            }]                     
    ]
    },
    {
        "tag": "officials_admin_finance",
        "patterns": [              
            "Who is the Chief Administrative Officer (CAO) of the Administrative Services, and what is their email address?",
            "Who serves as the Director of the Auxiliary Services, and how can they be reached?",
            "Who is the Head of the Civil Security Office, and what email can they be contacted at?",
            "Who is the Head of the Human Resource Management Office, and what is their email?",
            "Who holds the position of Chief Finance Officer in the Financial Services department?",
            "Who is the Head and Chief Accountant of the Accounting Office, and what email can they be reached at?",
            "Who serves as the Head of the Budget Office, and how can they be contacted?",
            "Who is the Head of the Cashiers Office, and what email address can they be reached at?",
            "Who heads the Supply & Property Office, and what is their email?",
            "Who is the Head of the Records Management Office, and how can they be contacted?",
            "Who serves as the Head of the Procurement Office, and what email can they be reached at?",
            "Who is the Head of the Dental Services department?",
            "Who is in charge of the Medical Services department, and what email can they be reached at?"
        ],
        "responses": [[
            {
            "Office/Unit": "Administrative Services",
            "Designation": "CAO",
            "Name": "Dr. Vicky R. Galiza",
            "Email": "vicky_galiza@tup.edu.ph"
            },
            {
            "Office/Unit": "Auxiliary Services",
            "Designation": "Director",
            "Name": "Assoc. Prof. Rovenson Sevilla",
            "Email": "rovenson_sevilla@tup.edu.ph, auxiliary@tup.edu.ph"
            },
            {
            "Office/Unit": "Civil Security Office",
            "Designation": "Head",
            "Name": "Mr. Reggie C. Campomanes",
            "Email": "reggie_campomanes@tup.edu.ph, security@tup.edu.ph"
            },
            {
            "Office/Unit": "Human Resource Management Office",
            "Designation": "Head",
            "Name": "Ms. Catalina A. Baquiran",
            "Email": "catalina_baquiran@tup.edu.ph, hrmo@tup.edu.ph"
            },
            {
            "Office/Unit": "Financial Services",
            "Designation": "Chief Finance Officer",
            "Name": "Mrs. Marites S. Bolanos",
            "Email": "marites_bolanos@tup.edu.ph"
            },
            {
            "Office/Unit": "Accounting Office",
            "Designation": "Head & Chief Accountant",
            "Name": "Mr. Catalino A. Fortes, Jr.",
            "Email": "catalino_fortes@tup.edu.ph, accounting@tup.edu.ph"
            },
            {
            "Office/Unit": "Budget Office",
            "Designation": "Head",
            "Name": "Ms. Vivian C. Santos",
            "Email": "vivian_santos@tup.edu.ph, budget@tup.edu.ph"
            },
            {
            "Office/Unit": "Cashiers Office",
            "Designation": "Head",
            "Name": "Ms. Vienna Castillon",
            "Email": "vienna_castillon@tup.edu.ph, cashier@tup.edu.ph"
            },
            {
            "Office/Unit": "Supply & Property Office",
            "Designation": "Head",
            "Name": "Ms. Susana DG. Uy",
            "Email": "susana_uy@tup.edu.ph, supply@tup.edu.ph"
            },
            {
            "Office/Unit": "Records Management Office",
            "Designation": "Head",
            "Name": "Mr. Jonathan M. Monsad, J.D.",
            "Email": "jonathan_monsad@tup.edu.ph, rmo@tup.edu.ph"
            },
            {
            "Office/Unit": "Procurement Office",
            "Designation": "Head",
            "Name": "Asst. Prof. Peragrino B. Amador Jr.",
            "Email": "peragrinojr_amador@tup.edu.ph, procurement@tup.edu.ph"
            },
            {
            "Office/Unit": "Dental Services",
            "Designation": "Head",
            "Name": "Dr. Marissa Laureles",
            "Email": "marissa_laureles@tup.edu.ph"
            },
            {
            "Office/Unit": "Medical Services",
            "Designation": "Head",
            "Name": "Dr. Emmanuel G. Ruiz II",
            "Email": "emmanuel_ruiz@tup.edu.ph, medical@tup.edu.ph"
            }
        ]]
    },
    {
        "tag": "officials_research_extensions",
        "patterns": [              
            "Who is the Director of the Integrated Research and Training Center, and what is their email?",
            "Who serves as the Director of University Research and Development Services, and how can they be reached?",
            "Who is the Director of University Extension Services, and what is their contact email?",
            "Who heads the Technology Licensing Office/Innovation and Technology, and what email address can they be reached at?",
            "Who is the Special Assistant for Internal Affairs, and what is their email?",
            "Who holds the position of Special Assistant for External Affairs, and how can they be contacted?"
        ],
        "responses": [[
            {
            "Office/Unit": "Integrated Research and Training Center",
            "Designation": "Director",
            "Name": "Engr. Nilo Arago",
            "Email": "nilo_arago@tup.edu.ph, irtc@tup.edu.ph"
            },
            {
            "Office/Unit": "University Research and Development Services",
            "Designation": "Director",
            "Name": "Assoc. Prof. Dr. Francisco D. Esponilla II",
            "Email": "francisco_esponilla@tup.edu.ph, urds@tup.edu.ph"
            },
            {
            "Office/Unit": "University Extension Services",
            "Designation": "Director",
            "Name": "Prof. Dr. Benedicto Fortaleza",
            "Email": "benedicto_fortaleza@tup.edu.ph, ues@tup.edu.ph"
            },
            {
            "Office/Unit": "Technology Licensing Office/Innovation and Technology",
            "Designation": "Director",
            "Name": "Asst. Prof. Jonel R. Macalisang",
            "Email": "jonel_macalisang@tup.edu.ph, itso@tup.edu.ph"
            },
            {
            "Office/Unit": "Internal Affairs",
            "Designation": "Special Assistant",
            "Name": "Mr. Raymund T. Masangya",
            "Email": "raymund_masangya@tup.edu.ph"
            },
            {
            "Office/Unit": "External Affairs",
            "Designation": "Special Assistant",
            "Name": "Ms. Olivia A. Oliva",
            "Email": "olivia_oliva@tup.edu.ph"
            }
        ]]
    },
    {
        "tag": "officials_planningDev_specialConcerns",
        "patterns": [              
            "Who is the Director of the University Information Technology Center, and what email can they be reached at?",
            "Who serves as the Head of the Network Management Unit, and how can they be contacted?",
            "Who heads the System Development Unit, and what is their contact email?",
            "Who is in charge of the ICT Repair and Maintenance Unit, and what is their email?",
            "Who is the Director of the Planning Development Office, and how can they be reached?",
            "Who holds the position of Director in the Quality Assurance and Accreditation Coordinating Services Office, and what is their email?",
            "Who is the Focal Person for Gender and Development, and how can they be contacted?",
            "Who serves as the Head of the Senior Citizens & PWD unit?"
        ],
        "responses": [[
            {
            "Office/Unit": "University Information Technology Center",
            "Designation": "Director",
            "Name": "Assoc. Prof. Julius A. Sareno",
            "Email": "julius_sareno@tup.edu.ph, uitc@tup.edu.ph"
            },
            {
            "Office/Unit": "Network Management Unit",
            "Designation": "Head",
            "Name": "Asst. Prof. Michael Narisma",
            "Email": "michael_narisma@tup.edu.ph, uitc@tup.edu.ph"
            },
            {
            "Office/Unit": "System Development Unit",
            "Designation": "Head",
            "Name": "Asst. Prof. Vicente E. Estember",
            "Email": "vicente_estember@tup.edu.ph, uitc@tup.edu.ph"
            },
            {
            "Office/Unit": "ICT Repair and Maintenance Unit",
            "Designation": "Head",
            "Name": "Mr. Michael Corpuz",
            "Email": "michael_corpuz@tup.edu.ph, uitc@tup.edu.ph"
            },
            {
            "Office/Unit": "Planning Development Office",
            "Designation": "Director",
            "Name": "Asst. Prof. Arthur J. Lagbas",
            "Email": "arthur_lagbas@tup.edu.ph, pdo@tup.edu.ph"
            },
            {
            "Office/Unit": "Quality Assurance and Accreditation Coordinating Services Office",
            "Designation": "Director",
            "Name": "Assoc. Prof. Lyndon A. Bague",
            "Email": "lyndon_bague@tup.edu.ph, qaacso@tup.edu.ph"
            },
            {
            "Office/Unit": "Gender and Development",
            "Designation": "Focal Person",
            "Name": "Asst. Prof. Jennifer P. Alinsunod",
            "Email": "jennifer_alinsunod@tup.edu.ph, gad@tup.edu.ph"
            },
            {
            "Office/Unit": "Senior Citizens & PWD",
            "Designation": "Head",
            "Name": "Assoc. Prof. Lyndon A. Bague",
            "Email": "lyndon_bague@tup.edu.ph"
            }
        ]]
    },
    {
        "tag": "admission_graduateprograms_admissionprocedure",
        "patterns": [
            "What are the necessary requirements for admission to the TUP Graduate Program?",
            "What are the necessary requirements for Graduate program?",
            "Give me the admission procedure for Graduate program?",
            "Guide for admission procedure for Graduate program?",
            "What are the steps for undergraduate program admission procedure",
            "Graduate Program admission procedure",
            "Requirements for Graduate program addmission procedure",
            "Where can one obtain the Application for Admission Form for the TUP Graduate Program?",
            "How long should the essay be for the Application for Admission Form?",
            "How many sealed recommendation letters are required for the application?",
            "What should the recommendation letters focus on?",
            "How many passport size pictures are required, and what background should they have?",
            "Is the Certificate of English proficiency required for all applicants?",
            "Where should the application requirements be submitted?",
            "Who is the contact person for inquiries about the TUP Graduate Program?",
            "What are the contact details for the Office of the Graduate Programs?",
            "What are the office hours for the Office of the Graduate Programs?",
            "What is the procedure for securing and accomplishing the TUP Graduate Program Admission Test (TUPGPAT) Application Form?",
            "Where can one pay for the TUPGPAT application fee?",
            "How much is the application fee for the Master's Program?",
            "How much is the application fee for the Doctoral Program?",
            "Where should one go after paying the application fee for scheduling the TUPGPAT?",
            "Who is the director of the Office of the Graduate Programs?",
            "What are the email and telephone contact details for inquiries about the TUP Graduate Program?",
            "What are the office hours for the Office of the Graduate Programs?",
            "Is there a specific day for the TUPGPAT examination, or is it scheduled individually?",
			"How to apply for graduate programs?",
			"what is the steps in applying for graduate programs",
			"what are the requirements for graduate programs"
        ],
        "responses": [
            "Sure! Here's how to apply for the TUP Graduate Programs:\n\nADMISSION PROCEDURE\n1. Submit the following requirements in a long brown envelope. Only complete and accomplished requirements will be processed.\n Accomplished Application for Admission Form (TUP Graduate Program)\nThe form can be downloaded at the TUP website\nAn essay of not less than 100 words stating the applicant's reason for applying in the program. (To be written/typewritten at the back of the Application for Admission Form)\nCertified True Copy of the Transcript of Records\n Two (2) sealed recommendation letters The recommendation letter should describe the applicant's qualifications and potential for successfully completing graduate studies at TUP. It may also include comments and relevant insights such as on the applicant's character and outstanding skills/talents in line with the program applied for.\n Three (3) passport size pictures with name tag on white background\n Certificate of English proficiency as second language (for foreign student applicants only)\n Application requirements should be submitted to the:\n\nDirector, Graduate Program \nTechnology University of the Philippines \nAyala Blvd., Ermita, Manila, 1000 Philippines \nTelephone No. (02)301-3001 loc. 704\n\n2. After passing the initial evaluation of application requirements, secure and accomplish the TUP Graduate Program Admission Test (TUPGPAT) Application Form at the Office of Graduate Program, 2/F CAP Building.\n3. Present the TUPGPAT Application Form to the cashier's office for payment.\nMaster's Program - P900.00\nDoctoral Program - P1,050.00\n4. Proceed to the Guidance Office, G/F CLA Building, and present the Official Receipt (O.R.) with the TUPGPAT Application Form for scheduling.\n5. On the scheduled date and time of examination indicated in the form, present the Official Receipt (O.R.) with the TUPGPAT Application Form to the administering officer/proctor at the Guidance Office, G/F CLA Building."
        ]
    },
    {
        "tag": "admission_undergraduate_procedure",
        "patterns": [
            "What are the necessary requirements for admission to the TUP Undergraduate Program?",
            "What are the necessary requirements for Undergraduate Program?",
            "Give me the academic procedure for Undergraduate program?",
            "Guide for enrollment procedure for Undergraduate program?",
            "What are the steps for undergraduate programs enrollment?",
            "Undergraduate enrollment procedure",
            "Requirements for Undergraduate programs enrollemnt",
            "Give me the enrollment procedure for undergraduate programs",
            "What is the first step in the admission procedure outlined in the document?",
            "What documents should applicants present at the Office of Admissions?",
            "How should applicants prepare their Pre-Registration Form for submission?",
            "What specific form is required from applicants?",
            "What type of birth certificate should applicants bring in admission?",
            "What are the specific medical documents required of the admission process?",
            "Where should applicants report after completing their medical/dental requirements?",
            "What documents are applicants expected to collect from the Office of Admissions?",
            "Who confirms the enrollment of applicants according to the admission procedure?",
            "What is the final step for applicants to secure their enrollment?",
            "What are the key responsibilities of applicants in the confirmation of enrollment process?",
            "Is the Pre-Registration Form required to be filled out digitally or by hand?",
            "Which document is required to prove completion of Grade 12 Senior High School (SHS)?",
            "Are female students required to provide additional documentation? If so, what is it?",
            "What is the admission procedure in TUP?",
            "Can you explain how to apply for admission to TUP?",
            "Tell me about the admission process at TUP.",
            "How do I get admission to TUP?",
            "What are the steps for admission in TUP?",
            "Explain the admission procedure of TUP.",
            "I want to know how to apply for admission to TUP.",
            "What is involved in the admission process of TUP?",
            "Give me information about applying for admission to TUP.",
            "How can I get admitted to TUP?",
			"How to apply for admission?",
			"where to apply for admission?",
			"how to enroll?",
			"what is the procedure for enrollment?"
        ],
        "responses": [
            "Sure! Here are the Admission Procedure of Technological University of the Philippines-Manila:\n\nATTENTION:Before going into the admissions process, you must first set up an ERS (Electronic Registration System) account. By registering on the ERS platform, applicants can shorten their application process, resulting in better communication and document processing. This phase not only streamlines the application process, but also allows the institution to provide targeted support and guidance to potential students. Visit https://ers.tup.edu.ph/aims/applicants/ to set up your ERS account and begin the admissions process.\n\nPdf: https://drive.google.com/file/d/1lYm4BfKaB711UKwi7a41xuw9DYVXoPtR/view \n\nADMISSION PROCEDURE\nQUALIFIED APPLICANTS\nACADEMIC YEAR 2023-2024\nSTEP 1: REPORT TO OFFICE OF ADMISSIONS\nPRESENT THE FOLLOWING DOCUMENTS\na. Pre-Registration Form (Printed and Filled Out)\nb. Applicant Patient Record Form (Printed and Filled Out)\nc. Original & Photocopy of Grade 12 SHS Card\nd. Certificate of Good Moral Character\ne. PSA/NSO Birth Certificate (Original Photocopy) & PSA/NSO Marriage Certificate (Original & Photocopy for married only) female students only)\nSTEP 2: REPORT TO COLLEGE FOR INTERVIEW\nSTEP 3: REPORT TO MEDICAL/DENTAL CLINIC MEDICAL REQUIREMENTS (BRING ORIGINAL & PHOTOCOPY) TEC\nPRESENT THE FOLLOWING DOCUMENTS\na. Chest X-Ray (PA View)\n   b. Drug Test\nSTEP 4: REPORT TO OFFICE OF ADMISSIONS\nREPORT BACK TO OFFICE OF ADMISSIONS FOR NOTICE OF ADMISSION, UNDERTAKING AND STUDENT PLEDGE\nSTEP 5: REPORT TO COLLEGE FOR ENLISTMENT\nSTEP 6: CONFIRMATION OF ENROLLMENT BY THE REGISTRAR"
        ]
    },
    {
        "tag": "admission_admission/enrollmentprocedure_foreign",
        "patterns": [
            "What are the necessary requirements for Foreign student applicant?",
            "Give me the academic procedure for Foreign student applicant?",
            "Guide for enrollment procedure for Foreign student applicant?",
            "What are the steps for foreign student applicant enrollment?",
            "Foreign enrollment procedure",
            "Requirements for Foreign Enrollement",
            "Give me the enrollment procedure for foreign student applicant",
            "What documents are required for evaluation by the respective college for undergraduate courses?",
            "Which documents should be submitted for evaluation for graduate-level courses?",
            "What is the next step after a successful evaluation of the submitted documents?",
            "What does a passing entrance test result in for the applicant?",
            "What is the applicant required to do after receiving notice of acceptance?",
            "What is the purpose of preparing necessary documents for a 9F Student Visa?",
            "Where should the applicant report after the issuance of a student visa?",
            "Which offices assist in the processing of the applicant's papers with the Department of Foreign Affairs and Bureau of Immigration and Deportation?",
            "Is there an option for arranging a tutorial for English courses for foreign students if needed?",
            "Who should foreign students report to regarding problems that may arise during their studies?",
            "What are the general admission requirements for foreign student applicants?",
            "Where should the Transcript of Records/Scholastic Records be authenticated for foreign student applicants?",
            "What financial documents are required for the Student Visa/Visa Conversion process?",
            "Who should provide the Notarized Affidavit of Support for foreign student applicants?",
            "What information should be included in the bank statements provided by the student applicant?",
            "Which page of the student's passport needs to be photocopied for the visa application process?",
            "What additional document should accompany the birth certificate for authentication?",
            "Are there any specific procedures mentioned for institutional scholars regarding financial documentation?",
            "Is there a specific contact point mentioned for any inquiries or assistance regarding the admission process for foreign students?"
        ],
        "responses": [
            "Sure! Here are the Admission Procedure of Technological University of the Philippines-Manila for Foreign students:\n\nFOREIGN STUDENTS\n 1. Foreign students wishing to study must submit the following documents for evaluation in the respective college:\n     For undergraduate courses - high school records and diploma\n     For graduate level - transcript of records and diploma in college\n2. After a successful evaluation, the applicant may take the entrance examination and pay the required application fee. A passing entrance test will earn the applicant a notice of acceptance.\n3. The applicant is then required to prepare the necessary documents for the issuance of a 9F Student Visa from the applicant's country of origin.\n4. Upon the issuance of a student visa, the applicant must report to the Office of Student Affairs (OSA) for assistance in the processing of the applicant's papers with the Department of Foreign Affairs and Bureau of Immigration and Deportation.\n5. If necessary, a tutorial for English course may be arranged for the applicant.\n6. Problems that may arise regarding the student's studies must be reported to the Foreign Student Adviser of the OSA.\n\nAdmission Requirements for Foreign Student Applicants\n1. Admission requirements for the program applied for\n2. To submit necessary documents for Student Visa/Visa Conversion:\n     Transcript of Records/Scholastic Records duly authenticated by the Philippine Foreign Service Post located in the student applicant's country of origin or legal residence;\n     A Notarized Affidavit of Support including bank statements, notarized notice of grant for institutional scholars to cover expenses for the student's accommodation and subsistence, as well as other school dues and other incidental expenses;\n     Photocopy of data page of the student's passport showing date and place of birth, and birth certificate or its equivalent duly authenticated by the Philippine Foreign Service Post;\n     Duly authenticated police clearance"
        ]        
    },
    {
        "tag": "admission_admission/enrollmentprocedure_freshmen",
        "patterns": [
            "What is the first step in the enrollment procedure for freshmen students?",
            "What documents are required to secure the Notice of Admission from the Office of Admissions?",
            "Are original transcripts necessary for transfer students during enrollment?",
            "Where should freshmen applicant go to obtain a Medical Certificate?",
            "What is the next step after obtaining the Notice of Admission and Medical Certificate?",
            "Who should freshmen applicant meet for course enlistment?",
            "What should freshmen applicant do if they are availing a scholarship during enrollment?",
            "Where can freshmen applicant get their scholarship notation?",
            "After assessment, where should students proceed to pay their fees?",
            "What documents should freshmen applicants present to the Registrar's Office for confirmation?",
            "Who handles the processing of Identification (ID) Cards for freshmen students?",
            "Is there a specific order in which these steps must be followed during freshmen enrollment?",
            "Are there any additional requirements for scholarship recipients during freshmen enrollment?",
            "What are the necessary requirements for Freshmen Enrollment?",
            "What are the enrollment procedure for Freshmen?",
            "What are the steps for freshmen enrollnment?",
            "Is there a guide for freshmen enrollment?",
            "Freshmen enrollment procedure",
            "Requirements for Freshmen Enrollemnt",
            "Give me the enrollment procedure for freshmen"
        ],
        "responses": [
            "Sure! Here are the Enrollment Procedure of Technological University of the Philippines-Manila for Freshmen students:\n\nENROLLMENT PROCEDURE FOR FRESHMEN STUDENTS\n1. Secure Notice of Admission from the Office of the Admissions upon presentation of the following documents:\n     High School Card (Form 138) and Transcript of Records for transferees (Original)\n     Certificate of Good Moral Character (Original)\n     Test Permit\n2. Report to the University Clinic and secure Medical Certificate.\n3. With your Notice of Admission and Medical Certificate, proceed to the Office of Admissions for profiling.\n4. Proceed to your course adviser for enlistment.\n5. Students availing scholarship, report to the Office of Student Affairs for scholarship notation.\n6. Proceed to the Accounting Office for assessment and secure registration form.\n7. Pay the assessed fees at the Cashier's Office.\n8. With your Registration Form, present original requirements stated in Step #1 to the Registrar's Office for confirmation.\n9. Proceed to the Office of Student Affairs for Identification (ID) Card processing."
        ]
    },
    {
        "tag": "admission_admission/enrollmentprocedure_enrollment_oldstudents",
        "patterns": [
            "What is the first step for old students (second year to fifth year and graduate students) during enrollment?",
            "Is it necessary for old students to report to their course adviser for enlistment?",
            "What should old students do if they are availing a scholarship during enrollment?",
            "What should second year students do if they are availing a scholarship during enrollment?",
            "What should third year students do if they are availing a scholarship during enrollment?",
            "What should fourth year students do if they are availing a scholarship during enrollment?",
            "What should fifth year students do if they are availing a scholarship during enrollment?",
            "Where can old students get their scholarship notation?",
            "After assessment, where should old students proceed to pay their fees?",
            "What documents should oldstudents present for confirmation at the Registrar's Office?",
            "Who handles the processing of Identification (ID) Cards for old students?",
            "Is there a specific order in which these steps must be followed during enrollment for old students?",
            "Can old students proceed to pay fees before assessment at the accounting office?",
            "Are there any additional requirements for scholarship recipients during enrollment for old students?",
            "Is there a deadline for completing the enrollment procedure for old students?",
            "Are there any specific guidelines for the presentation of the Registration Form for old students?",
            "What services are offered by the Office of Student Affairs during the enrollment process for old students?",
            "Are there any changes in the enrollment procedure for old students compared to new students?",
            "What measures are in place to ensure the smooth processing of enrollment for old students?",
            "Is there any assistance provided to old students for navigating the enrollment process?",
            "What are the necessary requirements for old student Enrollment?",
            "What are the enrollment procedure for old student?",
            "What are the steps for old student?",
            "Is there a guide for old student",
            "Ols students enrollment procedure",
            "Requirements for old students enrollment",
            "Give me the enrollment procedure for old students"
        ],
        "responses": [
            "Sure! Here are the Enrollment Procedure of Technological University of the Philippines-Manila for old students(2nd year to 5th year):\n\nSECOND YEAR TO FIFTH YEAR AND GRADUATE STUDENTS (OLD STUDENTS)\n1. Proceed to your course adviser for enlistment.\n2. Students availing scholarship, report to the Office of Student Affairs for scholarship notation.\n3. Proceed to the accounting office for assessment and secure registration form.\n4. Pay the assessed fees at the Cashier's Office.\n5. Present your Registration Form to the Registrar's Office for confirmation.\n6. Proceed to the Office of Student Affairs for Identification (ID) Card processing"
        ]
    },
    {
        "tag": "admission_admission/enrollmentprocedure_enrollment_graduate",
        "patterns": [
            "What is the first step for graduate students in the enrollment process?",
            "What document should be presented to the Office of the Director for Graduate Programs to secure Admissions Evaluation?",
            "Where should students go for the entrance examination?",
            "After receiving the entrance exam results, where should students proceed for enlistment/enrollment?",
            "What should students do if they are availing a scholarship during enrollment?",
            "Where can students get their scholarship notation?",
            "After assessment, where should students proceed to pay their fees?",
            "Which office should students visit for confirmation of their Registration Form?",
            "Who handles the processing of Identification (ID) Cards for graduate students?",
            "Is there a specific order in which these steps must be followed during enrollment?",
            "Can students proceed to pay fees before assessment at the accounting office?",
            "Are there any additional requirements for scholarship recipients during enrollment?",
            "Are there any specific guidelines for the presentation of original requirements during confirmation?",
            "What services are offered by the Office of Student Affairs during the enrollment process",
            "What are the necessary requirements for graduate student Enrollment?",
            "What are the enrollment procedure for graduate student?",
            "What are the steps for graduate student?",
            "Is there a guide for graduate student",
            "Graduate program enrollment procedure",
            "Requirements for Graduate program enrollment",
            "Give me the enrollment procedure for graduate programs"
        ],
        "responses": [
            "Sure! Here are the Enrollment Procedure of Technological University of the Philippines-Manila for graduate programs/students:\n\nGRADUATE STUDENTS (NEW)\n1. Secure Admissions Evaluation from the Office of the Director for Graduate Programs upon presentation of your transcript of records.\n2. Proceed to the Guidance Office for entrance examination.\n3. With the entrance exam results, proceed to your respective course adviser for enlistment/enrollment.\n4. Students availing scholarship, report to the Office of Student Affairs for scholarship notation.\n5. Proceed to the accounting office for assessment and secure registration form.\n6. Pay the assessed fees at the Cashier's Office.\n7. With your Registration Form, present original requirements stated in Step #1 to the Registrar's Office for confirmation.\n8. Proceed to the Office of Student Affairs for Identification (ID) Card processing."
        ]
    },
    {
        "tag": "admission_admission/enrollmentprocedure_enrollment_scholars",
        "patterns": [
            "What is the first step for scholars in the enrollment process?",
            "What action should scholars take regarding their ERS grades?",
            "Where should scholars go to enlist their subjects based on their department/college?",
            "What is the procedure for handling billing and discounts for scholars?",
            "Where should scholars submit a photocopy of their Previous Rating Slip?",
            "Which office is responsible for assessing fees for scholars?",
            "After assessment, where should scholars go to confirm their registration?",
            "What documents should scholars present for confirmation at the Registrar's Office?",
            "Is there any specific action required after confirmation at the Registrar's Office?",
            "Are there any additional steps or requirements for specific scholarship programs such as 4P's Scholars or Iskolar ng Bayan?",
            "How does the enrollment process differ for scholars compared to non-scholar students?",
            "Can scholars proceed to pay fees before confirmation at the Registrar's Office?",
            "What assistance is provided to scholars during the enrollment process?",
            "Are there any changes in the enrollment procedure for scholars compared to previous years?",
            "Is there a designated point of contact for inquiries or assistance regarding the enrollment process for scholars?",
            "What are the necessary requirements for Scholar student Enrollment?",
            "What are the enrollment procedure for Scholar student?",
            "What are the enrollment procedure for 4P'S scholar student?",
            "What are the enrollment procedure for iskolar ng bayan scholar student?",
            "What are the enrollment procedure for CHED scholar student?",
            "What are the enrollment procedure for academic scholars student?",
            "What are the enrollment procedure for barangay grants scholar student?",
            "What are the enrollment procedure for kalinangan dance troupe scholar student?",
            "What are the enrollment procedure for charity first $ tsu chi scholar student?",
            "What are the enrollment procedure for TUP dependents cooperating teacher scholar student?",
            "What are the steps for scholar student enrollnment?",
            "Is there a guide for scholar student enrollment?",
            "Scholar students enrollment procedure",
            "Requirements for scholar student Enrollemnt",
            "Give me the enrollment procedure for scholar students"
        ],
        "responses": [
            "Sure! Here are the Enrollment Procedure of Technological University of the Philippines-Manila for Scholar students:\n\nALL 4P'S SCHOLARS, ISKOLAR NG BAYAN, CHED SCHOLARS, ACADEMIC SCHOLARS, BARANGAY GRANTS, KALINANGAN DANCE TROUPE, CHARITY FIRST $ TSU CHI, TUP DEPENDENTS COOPERATING TEACHER\n\n1. Print your ERS grades.\n2. Enlist subjects (Department/College)\n3. Billing/Discount - OSA (Submit photocopy of Previous Rating Slip)\n4. Accounting - for Assessment\n5. Present your Registration Form to the Registrar's Office for confirmation.\n6. Go back to OSA for the submission of Registration Form (photocopy)"
        ]
    },
    {
        "tag": "admission_graduateprograms_contacts",
        "patterns": [
            "What is the email address for contacting the Graduate Program at TUP?",
            "How can I reach the Graduate Program office at TUP via telephone?",
            "What are the office hours for the Graduate Program at TUP?",
            "When is the Graduate Program office closed during the week?",
            "Can you provide the email address for inquiries regarding graduate studies at TUP?",
            "What is the telephone number for contacting the Graduate Program office at TUP?",
            "What are the operating hours of the Graduate Program office at TUP?",
            "How can I contact the Graduate Program office outside of its regular office hours?",
            "Do you have the contact details for the Graduate Program office at TUP?",
            "Could you please provide the email and telephone contacts for the Graduate Program office at TUP?",
            "Could you please provide contacts details for the Graduate Program office at TUP?",
            "Give the contacts details for the Graduate Program office at TUP?",
            "What is the contacts details for the Graduate Program office at TUP?",
            "What is the contacts details for the Graduate Program office at TUP for College of Industrial Education",
            "What is the contacts details for the Graduate Program office at TUP for College of Industrial Technology",
            "What is the contacts details for the Graduate Program office at TUP for College of Science",
            "What is the contacts details for the Graduate Program office at TUP for College of Liberal Arts",
            "What is the contacts details for the Graduate Program office at TUP for College of Architecture and Fine Arts",
            "What is the contacts details for the Graduate Program office at TUP for College of Engineering"
        ],
        "responses": [
            "Sure! Here's the Contact details of Graduate program office of Technological University of the Philippines-Manila:\n\nCONTACTS\n\nE-mail\ngraduate@tup.edu.ph\n\nTelephone No.\n5301.3040/5301.3041\n\nOffice Hours\n8:00am - 5:00pm | Monday- Friday"
        ]
    },
    {
        "tag": "admission_graduateprograms_officeofgraduateprograms",
        "patterns": [
            "Who is the Director of the Office of the Graduate Programs?",
            "What is the name of the individual serving as the Director of the Graduate Programs Office?",
            "Who holds the position of Director in the Office of the Graduate Programs?",
            "Who is the current Director of the Graduate Programs at TUP?",
            "What is the name of the Director of the Graduate Programs department?",
            "Who is responsible for overseeing the Graduate Programs at TUP?",
            "Can you tell me the name of the person serving as the Director of the Office of Graduate Programs?",
            "What is the title and name of the individual leading the Graduate Programs Office?",
            "Who is the Director of the Graduate Programs department at TUP?",
            "Who is the Director of the Graduate Programs for College of Industrial Education",
            "Who is the Director of the Graduate Programs for College of Industrial Technology",
            "Who is the Director of the Graduate Programs for College of Science",
            "Who is the Director of the Graduate Programs for College of Liberal Arts",
            "Who is the Director of the Graduate Programs for College of Architecture and Fine Arts",
            "Who is the Director of the Graduate Programs for College of Engineering"
        ],
        "responses": [
            "Sure! Here's the Director of Graduate program of Technological University of the Philippines-Manila:\n\nOFFICE OF THE GRADUATE PROGRAMS\nDr. Melbern Rose Maltezo, Director, Office of the Graduate Program"
        ]
    },
    {
        "tag": "admission_graduateprograms_programsoffering_collegeofindustrialeducation",
        "patterns": [
            "What doctoral programs does the College of Industrial Education offer?",
            "Can you list the doctoral degrees available in the College of Industrial Education?",
            "What are the options for Doctor of Education majors in the College of Industrial Education?",
            "Could you provide the list of doctoral programs with a focus on technology in the College of Industrial Education?",
            "What is the Doctor of Technology program offered by the College of Industrial Education?",
            "Which program focuses on Technology Management at the doctoral level in the College of Industrial Education?",
            "Can you name the master's programs available in the College of Industrial Education?",
            "What are the Master of Arts programs offered by the College of Industrial Education?",
            "Could you list the Master of Arts programs focusing on Industrial Education in the College of Industrial Education?",
            "What are the majors available under the Master of Arts in Industrial Education program?",
            "Which master's program in the College of Industrial Education emphasizes Curriculum and Instruction?",
            "What options are there for Master of Arts programs focusing on Educational Technology?",
            "Can you provide the list of Master of Arts programs focusing on Administration and Supervision?",
            "What master's program focuses on Guidance and Counseling in the College of Industrial Education?",
            "What program is offered under the Master of Arts in Teaching major in Technology and Home Economics?",
            "Could you list the master's programs that focus on Technology Education?",
            "What are the available options for master's programs in the College of Industrial Education?",
            "Which programs in the College of Industrial Education are designed for masteral?",
            "Can you provide details about the graduate programs available for masteral in the College of Industrial Education?",
            "What specialization areas are covered in the graduate programs offered by the College of Industrial Education?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers under of College of Industrial Education:\n\nGRADUATE PROGRAMS OFFERED BY COLLEGE OF INDUSTRIAL EDUCATION\n+ Doctor of Education major in Industrial Education Management\n+ Doctor of Education major in Career Guidance\n+ Doctor of Technology\n+ Doctor of Philosophy major in Technology Management\n+ Master of Arts in Industrial Education major in Curriculum and Instruction\n+ Master of Arts in Industrial Education major in Educational Technology\n+ Master of Arts in Industrial Education major in Administration and Supervision\n+ Master of Arts in Industrial Education major in Guidance and Counseling\n+ Master of Arts in Teaching major in Technology and Home Economics\n+ Master of Technology Education"
        ]
    },
    {
        "tag": "admission_graduateprograms_programsoffering_collegeofindustrialtechnology",
        "patterns": [
            "What masteral programs does the College of Industrial Technology offer?",
            "Can you list the Master degrees available in the College of Industrial Technology?",
            "What are the options for Masteral in the College of Industrial Technology?",
            "Could you provide the list of masteral programs in the College of Industrial Technology?",
            "What is the Masteral program offered by the College of Industrial Technology?",
            "Can you name the master's programs available in the College of Industrial Technology?",
            "What are the Masteral programs offered by the College of Industrial Technology?",
            "Could you list the Masteral programs in the College of Industrial Technology?",
            "What are the available options for master's programs in the College of Industrial Technology?",
            "Which programs in the College of Industrial Technology are designed for masteral?",
            "Can you provide the graduate programs available for masteral in the College of Industrial Technology?",
            "What specialization areas are covered in the graduate programs offered by the College of Industrial Technology?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers under of College of Industrial Technology:\n\nGRADUATE PROGRAMS OFFERED BY COLLEGE OF INDUSTRIAL TECHNOLOGY\n\n+ Master of Technology"
        ]
    },
    {
        "tag": "admission_graduateprograms_programsoffering_collegeofscience",
        "patterns": [
            "What graduate programs does the College of Science offer?",
            "Can you list the master's programs available in the College of Science?",
            "What are the options for Master of Arts in Teaching majors in the College of Science? ",
            "Could you provide the list of Master of Arts programs focusing on specific subjects in the College of Science?",
            "What is the Master of Information Technology program offered by the College of Science?",
            "Which program focuses on Physics education at the master's level in the College of Science?",
            "Can you name the master's programs available for Mathematics educators in the College of Science?",
            "What are the majors available under the Master of Arts in Teaching program in the College of Science?",
            "Which master's program in the College of Science emphasizes General Science education?",
            "What options are there for Master of Arts programs focusing on Chemistry in the College of Science?",
            "Could you list the Master of Arts in Teaching programs focusing on specific science subjects?",
            "What are the available options for master's programs in the College of Science?",
            "Could you list the Masteral programs in the College of Science?",
            "Which programs in the College of Science are designed for masteral?",
            "What are the Masteral programs offered by the College of Science?",
            "Can you name the master's programs available in the College of Industrial Technology?",
            "What masteral programs does the College of Science offer?",
            "Could you provide the list of masteral programs in the College of Science?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers under of College of Science:\n\nGRADUATE PROGRAMS OFFERED BY COLLEGE OF SCIENCE\n\n+ Master of Arts in Teaching major in Physics\n+ Master of Arts in Teaching major in Mathematics\n+ Master of Arts in Teaching major in General Science\n+ Master of Arts in Teaching major in Chemistry\n+ Master of Information Technology"
        ]
    },
    {
        "tag": "admission_graduateprograms_programsoffering_collegeofliberalarts",
        "patterns": [
            "What masteral programs does the College of Liberal Arts offer?",
            "Can you list the Master degrees available in the College of Liberal Arts?",
            "What are the options for Masteral in the College of Liberal Arts?",
            "Could you provide the list of masteral programs in the College of Liberal Arts?",
            "What is the Masteral program offered by the College of Liberal Arts?",
            "Can you name the master's programs available in the College of Liberal Arts?",
            "What are the Masteral programs offered by the College of Liberal Arts?",
            "Could you list the Masteral programs in the College of Liberal Arts?",
            "What are the available options for master's programs in the College of Liberal Arts?",
            "Which programs in the College of Liberal Arts are designed for masteral?",
            "Can you provide the graduate programs available for masteral in the College of Liberal Arts?",
            "What specialization areas are covered in the graduate programs offered by the College of Liberal Arts?",
            "What doctoral programs does the College of Liberal Arts offer?",
            "Can you list the doctoral degrees available in the College of Liberal Arts?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers under of College of Liberal Arts:\n\nGRADUATE PROGRAMS OFFERED BY COLLEGE OF LIBERAL ARTS\n\n+ Doctor of Management Science\n+ Master in Management"
        ]
    },
    {
        "tag": "admission_graduateprograms_programsoffering_collegeofarchitectureandfinearts",
        "patterns": [
            "What masteral programs does the College of Architecture and Fine Arts offer?",
            "Can you list the Master degrees available in the College of Architecture and Fine Arts?",
            "What are the options for Masteral in the College of Architecture and Fine Arts?",
            "Could you provide the list of masteral programs in the College of Architecture and Fine Arts?",
            "What is the Masteral program offered by the College of Architecture and Fine Arts?",
            "Can you name the master's programs available in the College of Architecture and Fine Arts?",
            "What are the Masteral programs offered by the College of Architecture and Fine Arts?",
            "Could you list the Masteral programs in the College of Architecture and Fine Arts?",
            "What are the available options for master's programs in the College of Architecture and Fine Arts?",
            "Which programs in the College of Architecture and Fine Arts are designed for masteral?",
            "Can you provide the graduate programs available for masteral in the College of Architecture and Fine Arts?",
            "What specialization areas are covered in the graduate programs offered by the College of Architecture and Fine Arts?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers under of College of Architecture and Fine Arts:\n\nGRADUATE PROGRAMS OFFERED BY COLLEGE OF ARCHITECTURE AND FINE ARTS\n\n+ Master in Architecture major in Construction Technology Management\n+ Master in Graphics Technology"
        ]
    },
    {
        "tag": "admission_graduateprograms_programsoffering_collegeofengineering",
        "patterns": [
            "What masteral programs does the College of Engineering offer?",
            "Can you list the Master degrees available in the College of Engineering?",
            "What are the options for Masteral in the College of Engineering?",
            "Could you provide the list of masteral programs in the College of Engineering?",
            "What is the Masteral program offered by the College of Engineering?",
            "Can you name the master's programs available in the College of Engineering?",
            "What are the Masteral programs offered by the College of Engineering?",
            "Could you list the Masteral programs in the College of Engineering?",
            "What are the available options for master's programs in the College of Engineering?",
            "Which programs in the College of Engineering are designed for masteral?",
            "Can you provide the graduate programs available for masteral in the College of Engineering?",
            "What are the majors available under the Master of Science in Electrical Engineering program?",
            "What specialization areas are covered in the graduate programs offered by the College of Engineering?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers under of College of Engineering:\n\nGRADUATE PROGRAMS OFFERED BY COLLEGE OF ENGINEERING\n\n+ Master of Engineering Program\n+ Master of Science in Civil Engineering major in General Civil Engineering\n+ Master of Science in Civil Engineering major in Geotechnical Engineering\n+ Master of Science in Civil Engineering major in Structural Engineering\n+ Master of Science in Electrical Engineering major in Power System Engineering\n+ Master of Science in Electrical Engineering major in Instrumentation and Control Engineering\n+ Master of Science in Electrical Engineering major in Electronics Engineering\n+ Master of Science in Electrical Engineering major in Communications Engineering\n+ Master of Science in Electrical Engineering\n+ Master of Science in Electrical Engineering major in Computer Engineering\n+ Master of Science in Mechanical Engineering major in Energy Engineering\n+ Master of Science in Mechanical Engineering major in Production Technology\n+ Masters of Engineering Program in Civil Engineering major in Structural Engineering Option\n+ Masters of Engineering Program in Civil Engineering major in Geotechnical Engineering Option\n+ Masters of Engineering Program in Civil Engineering major in General Civil Engineering Option\n+ Masters of Engineering Program in Electrical Engineering major in Power Engineering Option\n+ Masters of Engineering Program in Electrical Engineering major in Instrumentation and Computer Engineering Option\n+ Masters of Engineering Program in Electrical Engineering major in Electronics and Communications Engineering Option\n+ Masters of Engineering Program in Mechanical Engineering major in Refrigeration and Airconditioning Option\n+ Masters of Engineering Program in Mechanical Engineering major in Heat Power Option\n+ Masters of Engineering Program in Mechanical Engineering major in Manufacturing and Production Opti"
        ]
    },
    {
        "tag": "admission_graduateprograms_programsoffering",
        "patterns": [
            "What masteral programs does the TUP offer?",
            "Can you list the Master degrees available in  TUP?",
            "What are the options for Masteral in TUP?",
            "Could you provide the list of masteral programs in TUP?",
            "What is the Masteral program offered by TUP?",
            "Can you name the master's programs available in TUP?",
            "What are the Masteral programs offered by TUP?",
            "Could you list the Masteral programs in TUP?",
            "What are the available options for master's programs in TUP?",
            "Which programs in TUP are designed for masteral?",
            "Can you provide the graduate programs available for masteral in TUP?",
            "What specialization areas are covered in the graduate programs offered by TUP?",
            "What doctoral programs does the TUP offer?",
            "Can you list the doctoral degrees available in TUP?",
            "What graduate programs does the TUP offer?",
            "Can you list the graduate programs available in  TUP?",
            "Could you provide the list of graduate programs in TUP?",
            "What is the graduate programs offered by TUP?",
            "Can you name the graduate programs available in TUP?",
            "What are the graduate programs offered by TUP?",
            "What are the available options for graduate programs in TUP?"
        ],
        "responses": [
            "Sure! Here's the List of Graduate programs that Technological University of the Philippines-Manila offers:\n\nGRADUATE PROGRAMS OFFERED BY TUP\n\nCOLLEGE OF INDUSTRIAL EDUCATION\n+ Doctor of Education major in Industrial Education Management\n+ Doctor of Education major in Career Guidance\n+ Doctor of Technology\n+ Doctor of Philosophy major in Technology Management\n+ Master of Arts in Industrial Education major in Curriculum and Instruction\n+ Master of Arts in Industrial Education major in Educational Technology\n+ Master of Arts in Industrial Education major in Administration and Supervision\n+ Master of Arts in Industrial Education major in Guidance and Counseling\n+ Master of Arts in Teaching major in Technology and Home Economics\n+ Master of Technology Education\n\nCOLLEGE OF INDUSTIAL TECHNOLOGY\n+ Master of Technology\n\nCOLLEGE OF SCIENCE\n+ Master of Arts in Teaching major in Physics\n+ Master of Arts in Teaching major in Mathematics\n+ Master of Arts in Teaching major in General Science\n+ Master of Arts in Teaching major in Chemistry\n+ Master of Information Technology\n\nCOLLEGE OF LIBERAL ARTS\n+ Doctor of Management Science\n+ Master in Management\n\nCOLLEGE OF ARCHITECTURE AND FINE ARTS\n+ Master in Architecture major in Construction Technology Management\n+ Master in Graphics Technology\n\nCOLLEGE OF ENGINEERING\n+ Master of Engineering Program\n+ Master of Science in Civil Engineering major in General Civil Engineering\n+ Master of Science in Civil Engineering major in Geotechnical Engineering\n+ Master of Science in Civil Engineering major in Structural Engineering\n+ Master of Science in Electrical Engineering major in Power System Engineering\n+ Master of Science in Electrical Engineering major in Instrumentation and Control Engineering\n+ Master of Science in Electrical Engineering major in Electronics Engineering\n+ Master of Science in Electrical Engineering major in Communications Engineering\n+ Master of Science in Electrical Engineering\n+ Master of Science in Electrical Engineering major in Computer Engineering\n+ Master of Science in Mechanical Engineering major in Energy Engineering\n+ Master of Science in Mechanical Engineering major in Production Technology\n+ Masters of Engineering Program in Civil Engineering major in Structural Engineering Option\n+ Masters of Engineering Program in Civil Engineering major in Geotechnical Engineering Option\n+ Masters of Engineering Program in Civil Engineering major in General Civil Engineering Option\n+ Masters of Engineering Program in Electrical Engineering major in Power Engineering Option\n+ Masters of Engineering Program in Electrical Engineering major in Instrumentation and Computer Engineering Option\n+ Masters of Engineering Program in Electrical Engineering major in Electronics and Communications Engineering Option\n+ Masters of Engineering Program in Mechanical Engineering major in Refrigeration and Airconditioning Option\n+ Masters of Engineering Program in Mechanical Engineering major in Heat Power Option\n+ Masters of Engineering Program in Mechanical Engineering major in Manufacturing and Production Option"
        ]
    },
    {
        "tag": "admission_undergraduate_tuition_fee",
        "patterns": [
			"How much does it cost to attend this program?",
			"What are the fees for students at TUP?",
			"Do students need to pay to study at TUP?",
			"What's the tuition fee for TUP?",
			"Are there any costs for attending TUP?",
			"Can you tell me about the expenses for students?",
			"What financial obligations do students have at TUP?",
			"Is there a fee structure for attending TUP?",
			"How expensive is it to study at TUP?",
			"Are there any charges for enrollment at TUP?",
            "What are the estimated tuition fees for undergraduate programs?",
            "How much does it cost to study undergraduate courses?",
            "What is the tuition fee structure for undergraduate studies?",
            "Can you provide information on the undergraduate tuition fees?",
            "What are the expected costs for undergraduate tuition?",
            "How are undergraduate tuition fees calculated?",
            "Are there different tuition fees for specific undergraduate programs?",
            "Do tuition fees vary based on the number of credit hours taken?",
            "Are there any additional fees apart from tuition for undergraduate studies?",
            "Where can I find details about the undergraduate tuition fees?"
        ],
        "responses": [
            "Sure thing!  **The undergraduate tuition fees vary** depending on the program and number of credit hours. Refer to our website for specific details: [Tuition Fee](https://tup.edu.ph/pages/admission/estimated-tuition-fees)",
            "Sure!  **Undergraduate tuition fees are listed** on our website. You can find the details here: [Tuition Fee](https://tup.edu.ph/pages/admission/estimated-tuition-fees)",
            "Absolutely!  **Our undergraduate tuition fees are transparent** and available on our website for your reference: [Tuition Fee](https://tup.edu.ph/pages/admission/estimated-tuition-fees)"
        ]
    },
    {
        "tag": "admission_contact_information_manila",
        "patterns": [
            "How can I contact the admission office in Manila?",
            "What is the contact information for admissions in Manila?",
            "Who should I contact for admission inquiries in Manila?",
            "Can you provide the contact details for admission queries in Manila?",
            "Where can I find the contact information for admissions in Manila?",
            "How do I reach out to the admissions office in Manila?",
            "Who is the head of the Office of Admissions in Manila?",
            "What are the contact numbers for admission-related queries in Manila?",
            "Do you have a phone number for admission inquiries in Manila?",
            "How can I get in touch with the Office of Admissions in Manila?"
        ],
        "responses": [
            "Sure thing!  **For more details in Manila**, you can reach out to:\n\n **Dr. Rosemarie Theresa M. Cruz**\n- Head, Office of Admissions\n- Ground Floor, Arts and Sciences Bldg., Ayala Blvd., Ermita, Manila 1000, Philippines\n- **Contact Numbers:** +63 (2) 5301.3042/5301.3001 local 603\n\n **Main Campus (Manila)**\n- **PABX Trunk Line:** +63 (2) 5301.3001\n\nFor further information, you can also visit our [contact page](https://tup.edu.ph/pages/admission/contact-admission)."
        ]
    },
    {
        "tag": "admission_contact_information_taguig",
        "patterns": [
            "How can I contact the admission office in Taguig?",
            "What is the contact information for admissions in Taguig?",
            "Who should I contact for admission inquiries in Taguig?",
            "Can you provide the contact details for admission queries in Taguig?",
            "Where can I find the contact information for admissions in Taguig?",
            "How do I reach out to the admissions office in Taguig?",
            "Who is the head of the Office of Admissions in Taguig?",
            "What are the contact numbers for admission-related queries in Taguig?",
            "Do you have a phone number for admission inquiries in Taguig?",
            "How can I get in touch with the Office of Admissions in Taguig?"
        ],
        "responses": [
            "Sure thing!  **For more details in Taguig**, please contact:\n\n **Dr. Rosemarie Theresa M. Cruz**\n- Head, Office of Admissions\n- Ground Floor, Arts and Sciences Bldg., Ayala Blvd., Ermita, Manila 1000, Philippines\n\n**Contact Numbers:**\nTUP Taguig Campus - +63 (2) 823.1774\n\nFor further information, you can also visit our [contact page](https://tup.edu.ph/pages/admission/contact-admission)."
        ]
    },
    {
        "tag": "admission_contact_information_cavite",
        "patterns": [
            "How can I contact the admission office in Cavite?",
            "What is the contact information for admissions in Cavite?",
            "Who should I contact for admission inquiries in Cavite?",
            "Can you provide the contact details for admission queries in Cavite?",
            "Where can I find the contact information for admissions in Cavite?",
            "How do I reach out to the admissions office in Cavite?",
            "Who is the head of the Office of Admissions in Cavite?",
            "What are the contact numbers for admission-related queries in Cavite?",
            "Do you have a phone number for admission inquiries in Cavite?",
            "How can I get in touch with the Office of Admissions in Cavite?"
        ],
        "responses": [
            "Sure thing!  **For more details in Cavite**, please contact:\n\n **Dr. Rosemarie Theresa M. Cruz**\n- Head, Office of Admissions\n- Ground Floor, Arts and Sciences Bldg., Ayala Blvd., Ermita, Manila 1000, Philippines\n\n**Contact Numbers:**\nTUP Cavite Campus - +63 (046) 416.4920\n\nFor further information, you can also visit our [contact page](https://tup.edu.ph/pages/admission/contact-admission)."
        ]
    },
    {
        "tag": "admission_contact_information_visayas",
        "patterns": [
            "How can I contact the admission office in Visayas?",
            "What is the contact information for admissions in Visayas?",
            "Who should I contact for admission inquiries in Visayas?",
            "Can you provide the contact details for admission queries in Visayas?",
            "Where can I find the contact information for admissions in Visayas?",
            "How do I reach out to the admissions office in Visayas?",
            "Who is the head of the Office of Admissions in Visayas?",
            "What are the contact numbers for admission-related queries in Visayas?",
            "Do you have a phone number for admission inquiries in Visayas?",
            "How can I get in touch with the Office of Admissions in Visayas?"
        ],
        "responses": [
            "Sure thing!  **For more details in Visayas**, please contact:\n\n **Dr. Rosemarie Theresa M. Cruz**\n- Head, Office of Admissions\n- Ground Floor, Arts and Sciences Bldg., Ayala Blvd., Ermita, Manila 1000, Philippines\n\n**Contact Numbers:**\nTUP Visayas Campus +63 (034) 495.3480\n\nFor further information, you can also visit our [contact page](https://tup.edu.ph/pages/admission/contact-admission)."
        ]      
    },
    {
        "tag": "admission_contact_information_coe",
        "patterns": [
            "How can I contact the admission office for the College of Engineering?",
            "What is the contact information for admissions in the College of Engineering?",
            "Who should I contact for admission inquiries for the College of Engineering?",
            "Can you provide the contact details for admission queries for the College of Engineering?",
            "Where can I find the contact information for admissions for the College of Engineering?",
            "How do I reach out to the admissions office for the College of Engineering?",
            "Who is the head of the Office of Admissions for the College of Engineering?",
            "What are the contact numbers for admission-related queries for the College of Engineering?",
            "Do you have a phone number for admission inquiries for the College of Engineering?",
            "How can I get in touch with the Office of Admissions for the College of Engineering?"
        ],
        "responses": [
            "Sure thing!  **For more details for the College of Engineering**, please contact:\n\n **Dr. Rosemarie Theresa M. Cruz**\n- Head, Office of Admissions\n- Ground Floor, Arts and Sciences Bldg., Ayala Blvd., Ermita, Manila 1000, Philippines\n\n**Contact Numbers:**\nCollege of Engineering - Local 501\n\nFor further information, you can also visit our [contact page](https://tup.edu.ph/pages/admission/contact-admission)."
        ]           
    },
    {
        "tag": "admission_contact_information_cit",
        "patterns": [
            "How can I contact the admission office for the College of Industrial Technology?",
            "What is the contact information for admissions in the College of Industrial Technology?",
            "Who should I contact for admission inquiries for the College of Industrial Technology?",
            "Can you provide the contact details for admission queries for the College of Industrial Technology?",
            "Where can I find the contact information for admissions for the College of Industrial Technology?",
            "How do I reach out to the admissions office for the College of Industrial Technology?",
            "Who is the head of the Office of Admissions for the College of Industrial Technology?",
            "What are the contact numbers for admission-related queries for the College of Industrial Technology?",
            "Do you have a phone number for admission inquiries for the College of Industrial Technology?",
            "How can I get in touch with the Office of Admissions for the College of Industrial Technology?"
        ],
        "responses": [
            "Sure thing!  **For more details for the College of Industrial Technology**, please contact:\n\n **Dr. Rosemarie Theresa M. Cruz**\n- Head, Office of Admissions\n- Ground Floor, Arts and Sciences Bldg., Ayala Blvd., Ermita, Manila 1000, Philippines\n\n**Contact Numbers:**\nCollege of Industrial Technology - Local 201\n\nFor further information, you can also visit our [contact page](https://tup.edu.ph/pages/admission/contact-admission)."
        ]            
    },
    {
        "tag": "admission_contact_information_cos",
        "patterns": [
            "How can I contact the admission office for the College of Science?",
            "What is the contact information for admissions in the College of Science?",
            "Who should I contact for admission inquiries for the College of Science?",
            "Can you provide the contact details for admission queries for the College of Science?",
            "Where can I find the contact information for admissions for the College of Science?",
            "How do I reach out to the admissions office for the College of Science?",
            "Who is the head of the Office of Admissions for the College of Science?",
            "What are the contact numbers for admission-related queries for the College of Science?",
            "Do you have a phone number for admission inquiries for the College of Science?",
            "How can I get in touch with the Office of Admissions for the College of Science?"
        ],
        "responses": [
            "Sure thing!  **For more details for the College of Science**, please contact:\n\n **Dr. Rosemarie Theresa M. Cruz**\n- Head, Office of Admissions\n- Ground Floor, Arts and Sciences Bldg., Ayala Blvd., Ermita, Manila 1000, Philippines\n\n**Contact Numbers:**\nCollege of Science - Local 608\n\nFor further information, you can also visit our [contact page](https://tup.edu.ph/pages/admission/contact-admission)."
        ]           
    },
    {
        "tag": "admission_contact_information_cafa",
        "patterns": [
            "How can I contact the admission office for the College of Architecture and Fine Arts?",
            "What is the contact information for admissions in the College of Architecture and Fine Arts?",
            "Who should I contact for admission inquiries for the College of Architecture and Fine Arts?",
            "Can you provide the contact details for admission queries for the College of Architecture and Fine Arts?",
            "Where can I find the contact information for admissions for the College of Architecture and Fine Arts?",
            "How do I reach out to the admissions office for the College of Architecture and Fine Arts?",
            "Who is the head of the Office of Admissions for the College of Architecture and Fine Arts?",
            "What are the contact numbers for admission-related queries for the College of Architecture and Fine Arts?",
            "Do you have a phone number for admission inquiries for the College of Architecture and Fine Arts?",
            "How can I get in touch with the Office of Admissions for the College of Architecture and Fine Arts?"
        ],
        "responses": [
            "Sure thing!  **For more details for the College of Architecture and Fine Arts**, please contact:\n\n **Dr. Rosemarie Theresa M. Cruz**\n- Head, Office of Admissions\n- Ground Floor, Arts and Sciences Bldg., Ayala Blvd., Ermita, Manila 1000, Philippines\n\n**Contact Numbers:**\nCollege of Architecture and Fine Arts - Local 301\n\nFor further information, you can also visit our [contact page](https://tup.edu.ph/pages/admission/contact-admission)."
        ]            
    },
    {
        "tag": "admission_contact_information_cie",
        "patterns": [
            "How can I contact the admission office for the College of Industrial Education?",
            "What is the contact information for admissions in the College of Industrial Education?",
            "Who should I contact for admission inquiries for the College of Industrial Education?",
            "Can you provide the contact details for admission queries for the College of Industrial Education?",
            "Where can I find the contact information for admissions for the College of Industrial Education?",
            "How do I reach out to the admissions office for the College of Industrial Education?",
            "Who is the head of the Office of Admissions for the College of Industrial Education?",
            "What are the contact numbers for admission-related queries for the College of Industrial Education?",
            "Do you have a phone number for admission inquiries for the College of Industrial Education?",
            "How can I get in touch with the Office of Admissions for the College of Industrial Education?"
        ],
        "responses": [
            "Sure thing!  **For more details for the College of Industrial Education**, please contact:\n\n **Dr. Rosemarie Theresa M. Cruz**\n- Head, Office of Admissions\n- Ground Floor, Arts and Sciences Bldg., Ayala Blvd., Ermita, Manila 1000, Philippines\n\n**Contact Numbers:**\nCollege of Industrial Education - Local 306\n\nFor further information, you can also visit our [contact page](https://tup.edu.ph/pages/admission/contact-admission)."
        ]           
    },
    {
        "tag": "admission_contact_information_cla",
        "patterns": [
            "How can I contact the admission office for the College of Liberal Arts?",
            "What is the contact information for admissions in the College of Liberal Arts?",
            "Who should I contact for admission inquiries for the College of Liberal Arts?",
            "Can you provide the contact details for admission queries for the College of Liberal Arts?",
            "Where can I find the contact information for admissions for the College of Liberal Arts?",
            "How do I reach out to the admissions office for the College of Liberal Arts?",
            "Who is the head of the Office of Admissions for the College of Liberal Arts?",
            "What are the contact numbers for admission-related queries for the College of Liberal Arts?",
            "Do you have a phone number for admission inquiries for the College of Liberal Arts?",
            "How can I get in touch with the Office of Admissions for the College of Liberal Arts?"
        ],
        "responses": [
            "Sure thing!  **For more details for the College of Liberal Arts**, please contact:\n\n **Dr. Rosemarie Theresa M. Cruz**\n- Head, Office of Admissions\n- Ground Floor, Arts and Sciences Bldg., Ayala Blvd., Ermita, Manila 1000, Philippines\n\n**Contact Numbers:**\nCollege of Liberal Arts - Local 609\n\nFor further information, you can also visit our [contact page](https://tup.edu.ph/pages/admission/contact-admission)."
        ]
    },
    {
        "tag": "admission_contact_information_eteeap",
        "patterns": [
            "How can I contact the admission office for ETEEAP?",
            "What is the contact information for admissions in ETEEAP?",
            "Who should I contact for admission inquiries for ETEEAP?",
            "Can you provide the contact details for admission queries for ETEEAP?",
            "Where can I find the contact information for admissions for ETEEAP?",
            "How do I reach out to the admissions office for ETEEAP?",
            "Who is the head of the Office of Admissions for ETEEAP?",
            "What are the contact numbers for admission-related queries for ETEEAP?",
            "Do you have a phone number for admission inquiries for ETEEAP?",
            "How can I get in touch with the Office of Admissions for ETEEAP?"
        ],
        "responses": [
            "Sure thing!  **For more details for ETEEAP**, please contact:\n\n **Dr. Rosemarie Theresa M. Cruz**\n- Head, Office of Admissions\n- Ground Floor, Arts and Sciences Bldg., Ayala Blvd., Ermita, Manila 1000, Philippines\n\n**Contact Numbers:**\nETEEAP-5301.3043/5301.3001 local 616\n\nFor further information, you can also visit our [contact page](https://tup.edu.ph/pages/admission/contact-admission)."
        ]
    },
    {
        "tag": "admission_undergraduate_programs_requirements_cit",
        "patterns": [
            "What are the requirements for each undergraduate program offered by the College of Industrial Technology?",
            "Can you provide the admission requirements for the programs in the College of Industrial Technology?",
            "What are the prerequisites for the undergraduate programs in the College of Industrial Technology?",
            "What GPA do I need to meet for admission to the programs in the College of Industrial Technology?",
            "Are there specific grade requirements for each undergraduate program at the College of Industrial Technology?",
            "I'm curious about the eligibility criteria for the undergraduate programs in the College of Industrial Technology. Can you help?",
            "What qualifications are needed to apply for the undergraduate programs at the College of Industrial Technology?",
            "Could you give me an overview of the admission criteria for the programs offered by the College of Industrial Technology?",
            "What grades should I have to apply for the undergraduate programs in the College of Industrial Technology?",
            "Tell me about the academic prerequisites for admission to the programs in the College of Industrial Technology."
        ],
        "responses": [
            "Certainly!  The admission requirements for undergraduate programs offered by the College of Industrial Technology (CIT) vary depending on the specific program. Here are the general grade requirements for each program:\n\n- Bachelor of Science in Food Technology: 80 above GPA on Math, Science, and English (STEM); 85 above GPA on Math, Science, and English (Non-STEM)\n- Bachelor of Engineering Technology majors:\n  - Computer Engineering Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n  - Civil Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n  - Electrical Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n  - Electronics Communications Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n  - Electronics Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n  - Instrumentation and Control Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n  - Mechanical Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n  - Mechatronics Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n  - Railway Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n  - Mechanical Engineering Technology options:\n    - Automotive Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n    - Foundry Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n    - Heating Ventilating & Air-Conditioning/Refrigeration Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n    - Power Plant Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n    - Welding Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n    - Dies and Moulds Technology: 75 above GPA on Math, Science, and English (STEM and Non-STEM)\n- Bachelor of Technology in Apparel and Fashion: 75 above GPA on Math, Science, and English\n- Bachelor of Technology in Nutrition and Food Technology: 75 above GPA on Math, Science, and English\n- Bachelor of Technology in Print Media Technology: 75 above GPA on Math, Science, and English\n\nFor more detailed information about specific program requirements, please refer to the [official website of TUP](https://tup.edu.ph/undergraduate/admission/undergraduate-programs)"
        ]           
    },
    {
        "tag": "admission_undergraduate_programs_requirements_cie",
        "patterns": [
            "What are the requirements for undergraduate programs in the College of Industrial Education (CIE)?",
            "Can you provide the prerequisites for CIE undergraduate programs?",
            "What are the grade requirements for CIE undergraduate programs?",
            "What qualifications do I need for CIE undergraduate programs?",
            "Can you list the requirements for Bachelor of Science Industrial Education in CIE?",
            "What are the admission criteria for CIE undergraduate programs?",
            "What GPA do I need for CIE undergraduate programs?",
            "Could you outline the prerequisites for Bachelor of Technical Vocational Teachers Education in CIE?",
            "What are the entrance requirements for CIE undergraduate programs?",
            "Could you detail the criteria for admission to CIE undergraduate programs?"
        ],
        "responses": [
            "Certainly!  The admission requirements for undergraduate programs offered by the College of Industrial Education (CIE) vary depending on the specific program. Here are the general grade requirements for each program:\n- Bachelor of Science Industrial Education major in Information and Communication Technology\n  Requirements:\n  - Grade Requirement: 85 above GPA\n\n- Bachelor of Science Industrial Education major in Home Economics\n  Requirements:\n  - Grade Requirement: 85 above GPA\n\n- Bachelor of Science Industrial Education major in Industrial Arts\n  Requirements:\n  - Grade Requirement: 85 above GPA\n\n- Bachelor of Technical Vocational Teachers Education major in Animation\n  Requirements:\n  - Grade Requirement: 85 above GPA\n\n- Bachelor of Technical Vocational Teachers Education major in Beauty Care and Wellness\n  Requirements:\n  - Grade Requirement: 85 above GPA\n\n- Bachelor of Technical Vocational Teachers Education major in Computer Programming\n  Requirements:\n  - Grade Requirement: 85 above GPA\n\n- Bachelor of Technical Vocational Teachers Education major in Electrical\n  Requirements:\n  - Grade Requirement: 85 above GPA\n\n- Bachelor of Technical Vocational Teachers Education major in Electronics\n  Requirements:\n  - Grade Requirement: 85 above GPA\n\n- Bachelor of Technical Vocational Teachers Education major in Food Service Management\n  Requirements:\n  - Grade Requirement: 85 above GPA\n\n- Bachelor of Technical Vocational Teachers Education major in Fashion and Garment\n  Requirements:\n  - Grade Requirement: 85 above GPA\n\n- Bachelor of Technical Vocational Teachers Education major in Heat Ventilation & Air Conditioning\n  Requirements:\n  - Grade Requirement: 85 above GPA\n\n- Bachelor of Technical Teacher Education\n  Requirements:\n  - Grade Requirement: 85 above GPA\n\nThe grade requirement for admission to these programs is an 85 above GPA.\nEach program has specific course descriptions and program educational outcomes. For more detailed information, please refer to the official website of TUP.\nFor specific admission requirements and prerequisites, please visit the official TUP website or contact the Office of Admissions directly.\nThe grade requirement applies to all programs within the College of Industrial Education (CIE).\nFor more detailed information about specific program requirements, please refer to the [official website of TUP](https://tup.edu.ph/undergraduate/admission/undergraduate-programs)"
        ]
    },
    {
        "tag": "admission_undergraduate_programs_requirements_coe",
        "patterns": [
            "What are the admission requirements for College of Engineering undergraduate programs?",
            "Can you tell me about the requirements for COE undergraduate programs?",
            "What GPA do I need for admission to COE undergraduate programs?",
            "What are the prerequisites for College of Engineering undergraduate degrees?",
            "I'm interested in COE undergraduate programs. What are the entry requirements?",
            "Could you provide information about the admission criteria for COE undergraduate degrees?",
            "What are the minimum grade requirements for COE undergraduate programs?",
            "Tell me about the qualifications needed for COE undergraduate degrees.",
            "What are the prerequisites for applying to COE undergraduate programs?",
            "Can you outline the requirements for COE undergraduate admissions?"
        ],
        "responses": [
            "Certainly!  The admission requirements for undergraduate programs offered by the College of Engineering (COE) vary depending on the specific program. Here are the general grade requirements for each program:\n- Bachelor of Science in Civil Engineering:\n  - Grade Requirement: 85 and above GPA on Math, Science, and English (STEM Only)\n- Bachelor of Science in Electrical Engineering:\n  - Grade Requirement: 85 and above GPA on Math, Science, and English (STEM Only)\n- Bachelor of Science in Electronics Engineering:\n  - Grade Requirement: 85 and above GPA on Math, Science, and English (STEM Only)\n- Bachelor of Science in Mechanical Engineering:\n  - Grade Requirement: 85 and above GPA on Math, Science, and English (STEM Only)\nFor more detailed information about specific program requirements, please refer to the [official website of TUP](https://tup.edu.ph/undergraduate/admission/undergraduate-programs)"
        ]           
    },
    {
        "tag": "admission_undergraduate_programs_requirements_cla",
        "patterns": [
            "What are the admission requirements for undergraduate programs in the College of Liberal Arts (CLA)?",
            "Can you tell me the requirements for CLA undergraduate programs?",
            "What are the prerequisites for CLA undergraduate programs?",
            "What GPA do I need for CLA undergraduate programs?",
            "What are the qualifications needed for CLA undergraduate programs?",
            "I'm interested in CLA undergraduate programs. What do I need to apply?",
            "Could you provide information about the requirements for CLA undergraduate programs?",
            "What are the eligibility criteria for CLA undergraduate programs?",
            "Can you list the requirements for admission to CLA undergraduate programs?",
            "What are the grade requirements for CLA undergraduate programs?"
        ],
        "responses": [
            "Certainly!  The admission requirements for undergraduate programs offered by the College of Liberal Arts (CLA) vary depending on the specific program. Here are the general grade requirements for each program:\n- Bachelor of Arts in Management major in Industrial Management:\n  - Grade Requirement: 80 above GPA in English, 80 above GWA (General Weighted Average), ABM, GAS, HUMMS preferably\n- Bachelor of Science in Entrepreneurship Management:\n  - Grade Requirement: 80 above GPA in English, 80 above GWA, ABM, GAS, HUMMS preferably\n- Bachelor of Science in Hospitality Management:\n  - Grade Requirement: 80 above GPA in English\n  - Additional Requirements:\n    - Height: 5'4\" for Female, 5'6\" for Male\n    - A 2-minute introduction video in corporate attire is required. False information on height will lead to disqualification from the program.\nFor more detailed information about specific program requirements, please refer to the [official website of TUP](https://tup.edu.ph/undergraduate/admission/undergraduate-programs)"
        ]
    },
    {
        "tag": "admission_undergraduate_programs_requirements_cos",
        "patterns": [
            "What are the admission requirements for undergraduate programs in the College of Science?",
            "Can you tell me about the requirements for the College of Science undergraduate programs?",
            "What are the requirements for admission to the College of Science undergraduate programs?",
            "I'm interested in the undergraduate programs offered by the College of Science. What are the requirements?",
            "What are the grade requirements for the College of Science undergraduate programs?",
            "Could you provide information on the admission criteria for the College of Science undergraduate programs?",
            "What GPA do I need for the College of Science undergraduate programs?",
            "Can you outline the prerequisites for the College of Science undergraduate programs?",
            "I want to know the admission requirements specifically for the College of Science. Can you help?",
            "What are the prerequisites for applying to the College of Science undergraduate programs?"
        ],
        "responses": [
            "Certainly!  The admission requirements for undergraduate programs offered by the College of Science (COS) vary depending on the specific program. Here are the general grade requirements for each program:\n- Bachelor of Applied Science in Laboratory Technology:\n  - Grade Requirement: 80 above GPA on Math, Science, and English (STEM Only)\n- Bachelor of Science in Computer Science:\n  - Grade Requirement: 80 above GPA on Math, Science, and English (STEM Only)\n- Bachelor of Science in Environmental Science:\n  - Grade Requirement: 80 above GPA on Math, Science, and English (STEM Only)\n- Bachelor of Science in Information System:\n  - Grade Requirement: 80 above GPA on Math, Science, and English (STEM Only)\n- Bachelor of Science in Information Technology:\n  - Grade Requirement: 80 above GPA on Math, Science, and English (STEM Only)\nFor more detailed information about specific program requirements, please refer to the [official website of TUP](https://tup.edu.ph/undergraduate/admission/undergraduate-programs)"
        ]
    },
    {
        "tag": "admission_undergraduate_programs_requirements_cafa",
        "patterns": [
            "What are the admission requirements for undergraduate programs in the College of Architecture and Fine Arts?",
            "What are the requirements for admission to the programs offered by the College of Architecture and Fine Arts?",
            "Can you tell me the admission criteria for the College of Architecture and Fine Arts?",
            "What GPA do I need to get admitted to the College of Architecture and Fine Arts?",
            "What are the grade requirements for undergraduate programs in the College of Architecture and Fine Arts?",
            "What are the prerequisites for applying to the College of Architecture and Fine Arts?",
            "What are the qualifications needed to apply to the College of Architecture and Fine Arts?",
            "What grades are required for admission to the College of Architecture and Fine Arts?",
            "What are the entry requirements for programs in the College of Architecture and Fine Arts?",
            "Can you provide information about the admission standards for the College of Architecture and Fine Arts?"
        ],
        "responses": [
            "Certainly!  The admission requirements for undergraduate programs offered by the College of Architecture and Fine Arts (CAFA) vary depending on the specific program. Here are the general grade requirements for each program:\n- Bachelor of Science in Architecture:\n  - Grade Requirement: 85 above GPA on Math, Science, and English (STEM only)\n- Bachelor of Fine Arts:\n  - Grade Requirement: 85 above GPA\n- Bachelor in Graphics Technology major in Architecture Technology:\n  - Grade Requirement: 85 above GPA\n- Bachelor in Graphics Technology major in Industrial Design:\n  - Grade Requirement: 85 above GPA\n- Bachelor in Graphics Technology major in Mechanical Drafting Technology:\n  - Grade Requirement: 85 above GPA\nFor more detailed information about specific program requirements, please refer to the [official website of TUP](https://tup.edu.ph/undergraduate/admission/undergraduate-programs)"
        ]
    },
    {
        "tag": "admission_office",
        "patterns": [
            "Who is the head of the admissions office?",
            "Can you provide information about the admissions office?",
            "Who oversees admissions at TUP?",
            "Who is in charge of admissions?",
            "Who manages the admissions process?",
            "Who is the head of the admission office?",
            "Who is responsible for admissions?",
            "What is the name of the person in charge of admissions?",
            "Who leads the admissions team?",
            "Who is the head of the Admissions Office?"
        ],
        "responses": [
            "Ah, you're looking to connect with the heart of our admissions team!  That would be Dr. Rosemarie Theresa M. Cruz, the head of our Admissions Office here at TUP."
        ]
    },
    {
        "tag": "admission_contact_information_office",
        "patterns": [
            "What are the contact details for the admissions office?",
            "How can I reach the admissions office?",
            "What is the email address for admissions?",
            "What is the telephone number for admissions?",
            "When is the admissions office open?",
            "How do I contact the admissions team?",
            "Can you provide the contact information for admissions?",
            "I need to get in touch with admissions, how?",
            "Who can I contact regarding admissions?",
            "What are the office hours for admissions?"
        ],
        "responses": [
            "Here is how you can reach the admissions office:\nEmail: admission@tup.edu.ph\nTelephone: 5301.3042/loc. 603\nOffice Hours: 8:00am - 5:00pm, Monday to Friday"
        ]
    },
    {
		"tag": "cie_history", 
		"patterns": [
			"Tell me about the history of the College of Industrial Education",
			"What is the origin of the College of Industrial Education?",
			"Can you provide a brief history of CIE?",
			"How did the College of Industrial Education come into existence?",
			"When was the College of Industrial Education established?",
			"Give me an overview of the historical background of CIE",
			"I'm interested in learning about the past of the College of Industrial Education",
			"What events led to the formation of the College of Industrial Education?",
			"What were the early years like for the College of Industrial Education?",
			"Describe the founding of the College of Industrial Education",
			"What were the milestones in the history of CIE?",
			"How has the College of Industrial Education evolved over time?",
			"What significant developments have occurred in the history of CIE?",
			"Explain the historical context of the College of Industrial Education",
			"Tell me about the journey of the College of Industrial Education from its inception to the present day"
		],
		"responses": [
			"The roots of the College of Industrial Education (CIE) can be traced in 1929 when the first formal two-year Industrial Teacher Education was offered at the then Philippine School of Arts and Trades. At present, the college serves as the foundation of teacher education in the University. The BS in Industrial Education program at CIE has been offered since 1951 as a four-year teacher education for elementary and secondary levels. Currently, CIE is composed of four departments, namely: Professional Industrial Education, Student Teaching, Technical Arts, and Home Economics."
		]
	},
	{
		"tag": "cie_goals", 
		"patterns": [
			"What are the goals of the College of Industrial Education?",
			"Can you list the objectives of CIE?",
			"What is the purpose of the College of Industrial Education?",
			"What does CIE aim to achieve?",
			"Explain the mission of the College of Industrial Education",
			"What are the aspirations of CIE?",
			"I want to understand the goals of the College of Industrial Education",
			"What is the vision of CIE?",
			"Describe the aims of the College of Industrial Education",
			"What are the targets of CIE?",
			"What are the guiding principles of CIE?",
			"What is the overarching aim of the College of Industrial Education?",
			"Can you outline the strategic objectives of CIE?",
			"What outcomes does CIE seek to accomplish?",
			"How does CIE define success?"
		],
		"responses": [
			"The College of Industrial Education commits itself to develop highly competent teachers/trainors, leaders, managers, and innovators in industrial and technology education and training, as well as industry through responsive and relevant programs and proactive human resources in an environment of change."
		]
	},
	{
		"tag": "cie_objectives", 
		"patterns": [
			"What are the objectives of the College of Industrial Education?",
			"What specific aims does CIE have?",
			"What are the targets set by CIE?",
			"Can you provide details about CIE's objectives?",
			"What does CIE aim to accomplish?",
			"What are the key priorities for CIE?",
			"How does CIE plan to achieve its goals?",
			"What strategies does CIE employ to fulfill its mission?",
			"I want to know about the objectives of the College of Industrial Education",
			"What are the main focuses of CIE?",
			"Can you outline the goals that CIE is working towards?",
			"How does CIE measure its success?",
			"What steps is CIE taking to achieve its objectives?",
			"What initiatives has CIE undertaken to meet its goals?",
			"What benchmarks has CIE set for itself?"
		],
		"responses": [
			"Improve effectiveness of instruction, research, management, administration, information systems and procedures to make the College responsive and relevant to the needs of the society\nEnhance partnership with industry, public, and NGOs to support efforts for life long learning\nAchieve financial viability and sustainability to augment operational resources\nStrengthen the core values of excellence, commitment, cooperation, hard work, scholarship, creativity, resourcefulness and teamwork among teachers and students\nAchieve third level accreditation for both graduate and undergraduate programs"
		]
	},
	{
		"tag": "cos_history", 
		"patterns": [
			"Tell me about the history of the College of Science.",
			"What changes occurred in the College of Science after TUP's conversion to a university?",
			"Can you provide information about the College of Science's establishment?",
			"How did the College of Arts and Sciences evolve into the College of Science?",
			"What was the College of Science like before and after the conversion of PCAT to TUP?",
			"Describe the organizational changes within the College of Science.",
			"What departments were initially part of the College of Arts and Sciences?",
			"What was the initial structure of the College of Arts and Sciences?",
			"How did the College of Arts and Sciences transition into the College of Science?",
			"Can you give a timeline of significant events in the history of the College of Science?",
			"What milestones mark the development of the College of Science?",
			"How has the College of Science evolved over time?",
			"What significant developments have occurred in the history of the College of Science?",
			"Explain the historical context of the College of Science.",
			"Tell me about the journey of the College of Science from its inception to the present day"
		],
		"responses": [
			"By virtue of Presidential Decree No. 1518, the Philippine College of Arts and Trades (PCAT) was converted into the Technological University of the Philippines (TUP) on June 11, 1976. The conversion to a university status brought about comprehensive changes in the organizational set-up. To carry out its tasks, the University had to change its one-college structure to a system composed of six colleges, one of which is the College of Arts and Sciences (CAS). The CAS was created in 1979 with its four departments, namely: the Languages, the Social and Behavioral Sciences, the Mathematics and Physical Sciences, and the Physical Education. In 1991, the College was mandated to perform dual roles: as a service college and as a science college. On July 24, 1995, the TUP Board of Regents through Referendum No. 13, s. 1995 approved the devolution of some Master Programs of the Graduate School to the mother colleges. Since then, the granting of the degrees in the Master of Arts in Teaching with specializations in Mathematics, Physics, Chemistry, and General Science has become the responsibility of the College of Arts and Sciences. On September 15, 1995, the University Board of Regents authorized to split the College of Arts and Sciences into the College of Science and the College of Liberal Arts. The new College of Science was structured to include graduate programs in Mathematics, Chemistry, Physics, and General Science. The college also offers five (5) baccalaureate programs, namely: Bachelor of Science in Computer Science, Bachelor of Science in Information Technology, Bachelor of Science in Information Systems, Bachelor of Science in Environmental Science and Bachelor of Applied Science Major in Laboratory Technology."
		]
	},
	{
		"tag": "cos_goals",
		"patterns": [
			"What goals does the College of Science aim to achieve?",
			"What is the mission of the College of Science?",
			"What objectives does the College of Science have for its students?",
			"How does the College of Science contribute to scientific and technological development?",
			"What initiatives does the College of Science take to promote scientific literacy and competence?",
			"What are the aspirations of the College of Science?",
			"I want to understand the goals of the College of Science",
			"What is the vision of the College of Science?",
			"Describe the aims of the College of Science",
			"What are the targets of the College of Science?",
			"What are the guiding principles of the College of Science?",
			"What is the overarching aim of the College of Science?",
			"Can you outline the strategic objectives of the College of Science?",
			"What outcomes does the College of Science seek to accomplish?",
			"How does the College of Science define success?"
		],
		"responses": [
			"The College of Science prepares students to become fully integrated individuals, scientifically literate and technically competent to assume dynamic and responsible leadership for the country's scientific and technological development in the improvement of man's well-being and the quality of the environment."
		]
	},
	{
		"tag": "cos_objectives",
		"patterns": [
			"What are the objectives of the College of Science?",
			"What specific aims does the College of Science have?",
			"What are the targets set by the College of Science?",
			"Can you provide details about the College of Science's objectives?",
			"What does the College of Science aim to accomplish?",
			"What are the key priorities for the College of Science?",
			"How does the College of Science plan to achieve its goals?",
			"What strategies does the College of Science employ to fulfill its mission?",
			"I want to know about the objectives of the College of Science",
			"What are the main focuses of the College of Science?",
			"Can you outline the goals that the College of Science is working towards?",
			"How does the College of Science measure its success?",
			"What steps is the College of Science taking to achieve its objectives?",
			"What initiatives has the College of Science undertaken to meet its goals?",
			"What benchmarks has the College of Science set for itself?"
		],
		"responses": [
			"Sustain the role of the College as TUP's premiere mover in science and mathematics via keeping pace with the University in moving onwards as a model of excellence in engineering and technology education.\nEngage actively in the University's efforts to acquire, generate and develop sufficient and state-of-the-art physical resources and facilities for instruction and research in science and mathematics.\nDevelop curricular programs in science and mathematics which are relevant and responsive to the needs of the present times.\nEvaluate existing curricular programs based on their cost-effectiveness, relevance, responsiveness, and global competitiveness.\nFocus staff development programs on the pursuit of higher level of knowledge and skills in science and mathematics to enhance outputs in the areas of instruction, research, extension, and production.\nProvide for more active and productive involvement of faculty in the areas of research, extension, and production with focus on strengthening the major role of science and mathematics along multidisciplinary dimensions and areas.\nPromote strong linkages and networking within the various units, sectors, and campuses of the University as well as with related organizations, institutions and agencies both public and private."
		]
	},
	{
		"tag": "cafa_history",
		"patterns": [
			"Tell me about the history of the College of Architecture and Fine Arts (CAFA)",
			"What is the origin of CAFA?",
			"Can you provide information about CAFA's history?",
			"Describe the history of CAFA",
			"When was CAFA established?",
			"What were the early years like for CAFA?",
			"What events led to the formation of CAFA?",
			"What were the milestones in the history of CAFA?",
			"How has CAFA evolved over time?",
			"What significant developments have occurred in the history of CAFA?",
			"Explain the historical context of CAFA",
			"Tell me about the journey of CAFA from its inception to the present day",
			"What achievements has CAFA made?",
			"What are the key contributions of CAFA to the university?",
			"What recognition has CAFA received over the years?"
		],
		"responses": [
			"The roots of the College of Architecture and Fine Arts (CAFA) can be traced from the drawing subjects required in all courses offered by the University since 1907. The college has been a consistent contributor in the Universitys achievements and recognition in various art competitions both local and abroad. The CAFA also produces top passers in the Licensure Examination given by the Professional Regulations Commission. Presently, the college is composed of three departments, namely: Architecture, Fine Arts, and Graphics. Furthermore, the college offers advanced studies in the Graduate Programs: Master in Architecture (Major in Construction Technology Management) and Master in Graphics Technology."
		]
	},
	{
		"tag": "cafa_goals",
		"patterns": [
			"What are the goals of the College of Architecture and Fine Arts?",
			"Can you list the objectives of CAFA?",
			"What is the purpose of CAFA?",
			"What does CAFA aim to achieve?",
			"Explain the mission of CAFA",
			"What are the aspirations of CAFA?",
			"I want to understand the goals of CAFA",
			"What is the vision of CAFA?",
			"Describe the aims of CAFA",
			"What are the targets of CAFA?",
			"What are the guiding principles of CAFA?",
			"What is the overarching aim of CAFA?",
			"Can you outline the strategic objectives of CAFA?",
			"What outcomes does CAFA seek to accomplish?",
			"How does CAFA define success?"
		],
		"responses": [
			"The College of Architecture and Fine Arts (CAFA) develops competitive architects, artists, designers and draftsmen for industry and related sectors toward an improved quality of life."
		]
	},
	{
		"tag": "cafa_objectives",
		"patterns": [
			"What are the objectives of the College of Architecture and Fine Arts?",
			"What specific aims does CAFA have?",
			"What are the targets set by CAFA?",
			"Can you provide details about CAFA's objectives?",
			"What does CAFA aim to accomplish?",
			"What are the key priorities for CAFA?",
			"How does CAFA plan to achieve its goals?",
			"What strategies does CAFA employ to fulfill its mission?",
			"I want to know about the objectives of CAFA",
			"What are the main focuses of CAFA?",
			"Can you outline the goals that CAFA is working towards?",
			"How does CAFA measure its success?",
			"What steps is CAFA taking to achieve its objectives?",
			"What initiatives has CAFA undertaken to meet its goals?",
			"What benchmarks has CAFA set for itself?"
		],
		"responses": [
			"Attain highly level of technical skills in their chosen profession.\nAcquire a lifelong learning actively such as progressive leadership in applied research development studies in the areas of Arts, Design, and Architectural fields and production.\nCommit in professional services to effect/impart technology transfer in assisting the development of small and medium industries to contribute to national development"
		]
	},
	{
		"tag": "coe_history",
		"patterns": [
			"Tell me about the history of the College of Engineering",
			"What is the origin of the College of Engineering?",
			"Can you provide information about COE's history?",
			"Describe the history of COE",
			"When was COE established?",
			"What were the early years like for COE?",
			"What events led to the formation of COE?",
			"What were the milestones in the history of COE?",
			"How has COE evolved over time?",
			"What significant developments have occurred in the history of COE?",
			"Explain the historical context of COE",
			"Tell me about the journey of COE from its inception to the present day",
			"What achievements has COE made?",
			"What are the key contributions of COE to the university?",
			"What recognition has COE received over the years?"
		],
		"responses": [
			"The College of Engineering (COE) is a recipient of Center of Development (COD) status from the Commission on Higher Education (CHED). The College produces total quality engineers, graduate professionals and valuable technology researches for industry and society to maximally contribute to national development."
		]
	},
	{
		"tag": "coe_goals",
		"patterns": [
			"What are the goals of the College of Engineering?",
			"Can you list the objectives of COE?",
			"What is the purpose of COE?",
			"What does COE aim to achieve?",
			"Explain the mission of COE",
			"What are the aspirations of COE?",
			"I want to understand the goals of COE",
			"What is the vision of COE?",
			"Describe the aims of COE",
			"What are the targets of COE?",
			"What are the guiding principles of COE?",
			"What is the overarching aim of COE?",
			"Can you outline the strategic objectives of COE?",
			"What outcomes does COE seek to accomplish?",
			"How does COE define success?"
		],
		"responses": [
				"The College of Engineering is committed to:\n- Offer technology-oriented curricula in engineering and management leading to the Bachelor, Master, and Doctorate degrees.\n- Foster and promote scientific culture through research and development involvement and collaboration,\n- Foster, promote, and maintain close inter-institutional and academe-industry linkages.\n- Effect technology transfer through the Office of Research and Extension Services of the University and the College"
		]
	},
	{
		"tag": "cla_history",
		"patterns": [
			"Tell me about the history of the College of Liberal Arts",
			"What is the origin of the College of Liberal Arts?",
			"Can you provide information about CLA's history?",
			"Describe the history of CLA",
			"When was CLA established?",
			"What were the early years like for CLA?",
			"What events led to the formation of CLA?",
			"What were the milestones in the history of CLA?",
			"How has CLA evolved over time?",
			"What significant developments have occurred in the history of CLA?",
			"Explain the historical context of CLA",
			"Tell me about the journey of CLA from its inception to the present day",
			"What achievements has CLA made?",
			"What are the key contributions of CLA to the university?",
			"What recognition has CLA received over the years?"
		],
		"responses": [
			"The CLA is the other half when the College of Applied Arts and Sciences was split. The CLA used to be a full service college. In 1999, the BOR approved the offering of Bachelor of Arts in Management major in Industrial Management in the college. To date, CLA is composed of four departments, namely: English, Filipino, Social Sciences, and Physical Education. Just recently, the college started offering Bachelor of Science in Entrepreneurial Management (BSEM)."
		]
	},

	{
		"tag": "cla_goals",
		"patterns": [
			"What are the goals of the College of Liberal Arts?",
			"Can you list the objectives of CLA?",
			"What is the purpose of CLA?",
			"What does CLA aim to achieve?",
			"Explain the mission of CLA",
			"What are the aspirations of CLA?",
			"I want to understand the goals of CLA",
			"What is the vision of CLA?",
			"Describe the aims of CLA",
			"What are the targets of CLA?",
			"What are the guiding principles of CLA?",
			"What is the overarching aim of CLA?",
			"Can you outline the strategic objectives of CLA?",
			"What outcomes does CLA seek to accomplish?",
			"How does CLA define success?"
		],
		"responses": [
			"The CLA shall provide basic quality education and turn out highly competent managers and entrepreneurs who will provide leadership and job opportunities in a rapidly changing environment and ensure its continued relevance and responsiveness to the challenges of globalization"
		]
	},
	{
		"tag": "cit_history",
		"patterns": [
			"Tell me about the history of the College of Industrial Technology",
			"What is the origin of the College of Industrial Technology?",
			"Can you provide information about CIT's history?",
			"Describe the history of CIT",
			"When was CIT established?",
			"What were the early years like for CIT?",
			"What events led to the formation of CIT?",
			"What were the milestones in the history of CIT?",
			"How has CIT evolved over time?",
			"What significant developments have occurred in the history of CIT?",
			"Explain the historical context of CIT",
			"Tell me about the journey of CIT from its inception to the present day",
			"What achievements has CIT made?",
			"What are the key contributions of CIT to the university?",
			"What recognition has CIT received over the years?"
		],
		"responses": [
			"The College of Industrial Technology traces its roots from the Technical Department of the then Philippine School of Arts and Trades adapted in 1937 which later became the Philippine College of Arts and Trades. In 1978, the then Philippine College of Arts and Trades was converted into the Technological University of the Philippines (TUP). Simultaneously, the College of Industrial Technology arose from the departments of the former Technical Department. Today, the CIT is the center of the industrial technology education of the University and is composed of eight departments namely, the Basic Industrial Technology, the Civil Engineering Technology, the Electrical Engineering Technology, the Electronics Engineering Technology, the Food and Apparel Technology, the Graphic Arts and Printing Technology, the Mechanical Engineering Technology, and the Power Plant Engineering Technology."
		]
	},
	{
		"tag": "cit_goals",
		"patterns": [
			"What are the goals of the College of Industrial Technology?",
			"Can you list the objectives of CIT?",
			"What is the purpose of CIT?",
			"What does CIT aim to achieve?",
			"Explain the mission of CIT",
			"What are the aspirations of CIT?",
			"I want to understand the goals of CIT",
			"What is the vision of CIT?",
			"Describe the aims of CIT",
			"What are the targets of CIT?",
			"What are the guiding principles of CIT?",
			"What is the overarching aim of CIT?",
			"Can you outline the strategic objectives of CIT?",
			"What outcomes does CIT seek to accomplish?",
			"How does CIT define success?"
		],
		"responses": [
			"The College of Industrial Technology develop highly skilled technicians, technologists, and applied researchers who are needed to sustain industrial growth and develop for the enhancement of quality of life."
		]
	},

	{
		"tag": "cit_objectives",
		"patterns": [
			"What are the objectives of the College of Industrial Technology?",
			"What specific aims does CIT have?",
			"What are the targets set by CIT?",
			"Can you provide details about CIT's objectives?",
			"What does CIT aim to accomplish?",
			"What are the key priorities for CIT?",
			"How does CIT plan to achieve its goals?",
			"What strategies does CIT employ to fulfill its mission?",
			"I want to know about the objectives of CIT",
			"What are the main focuses of CIT?",
			"Can you outline the goals that CIT is working towards?",
			"How does CIT measure its success?",
			"What steps is CIT taking to achieve its objectives?",
			"What initiatives has CIT undertaken to meet its goals?",
			"What benchmarks has CIT set for itself?"
		],
		"responses": [
			"Develop, improve and implement training program to attain effective delivery system of technological education.\nStrengthen faculty qualification and rank.\nProvide opportunities for faculty researches and come up with new concepts, materials and processes.\nMake available the facilities of the College and expertise of the faculty to the community."
		]
	},
	
	{
		"tag": "expanded_tertiary",
		"patterns": [
			"What is expanded tertiary education?",
			"Can you explain expanded tertiary education?",
			"Tell me about expanded tertiary education.",
			"What does expanded tertiary education entail?",
			"What is the purpose of expanded tertiary education?",
			"What are the benefits of expanded tertiary education?",
			"Why is expanded tertiary education important?",
			"How does expanded tertiary education work?",
			"Where can I find information about expanded tertiary education?",
			"I want to learn more about expanded tertiary education.",
			"Explain the concept of expanded tertiary education.",
			"What are the components of expanded tertiary education?",
			"Is there a website for expanded tertiary education?",
			"Can you provide a link to information about expanded tertiary education?",
			"What are the requirements for expanded tertiary education?"
		],
		"responses": [
			"https://tup.edu.ph/pages/academics/expanded-tertiary-education-equivalency-and-accred"
		]
	}, 
	{
		"tag": "cie_undergrad_org",
		"patterns": [
			"What organizations exist for undergraduate students in CIE?",
			"Tell me about the student organizations in the College of Industrial Education.",
			"Are there any clubs for undergraduates at CIE?",
			"Can you list some undergraduate organizations in CIE?",
			"I'm interested in joining a student organization at CIE. What options are available?",
			"What are the extracurricular opportunities for undergraduate students in CIE?",
			"Could you provide information on undergraduate clubs in CIE?",
			"I'm looking for information about student associations at CIE.",
			"What clubs or societies are there for undergraduates at CIE?",
			"Are there any student groups specifically for undergraduates in CIE?",
			"Tell me about the student associations within CIE.",
			"How can I get involved in extracurricular activities as an undergraduate at CIE?",
			"What are some undergraduate organizations I can join at CIE?",
			"I want to participate in student clubs at CIE. What are my options?",
			"What student societies are available for undergraduates at CIE?"
		],
		"responses": [
			"Association of Students in Industrial Arts (ASIA)\nInformation Technology Educators League (INTEL)\nProfessional Education Students Association (PRESA)\nFood Service Management, Fashion Garments Technology, Home Economics, and Beauty Care & Wellness Students Association (FFEHBSA)"
		]
	},
	{
		"tag": "cos_undergrad_org", 
		"patterns": [
			"What undergraduate organizations are there in the College of Science?",
			"Can you list some student clubs in the College of Science?",
			"Tell me about the student societies in the College of Science.",
			"Are there any clubs for undergraduate students in the College of Science?",
			"I'm interested in joining an organization in the College of Science. What options are there?",
			"What student groups exist for undergraduates in the College of Science?",
			"Give me information on undergraduate organizations at TUP's College of Science.",
			"What clubs or societies can I join as an undergraduate in the College of Science?",
			"I'm looking for extracurricular activities in the College of Science. What are my choices?",
			"Tell me about the student associations available for undergraduates at TUP's College of Science.",
			"What student organizations are affiliated with the College of Science?",
			"Can you provide details about undergraduate clubs at TUP's College of Science?",
			"What are some of the student groups I can be part of at the College of Science?",
			"I want to participate in student organizations at the College of Science. What are my options?",
			"What are the names of the undergraduate organizations in the College of Science?"
		],
		"responses": [
			"Technological University of the Philippines - Chemical Society (CHEMSOC)\nTechnological University of the Philippines - Green Society (GREENSOC)\nTUP Computer Students' Association (COMPASS)"
		]
	},

	{
		"tag": "cafa_undergrad_org",
		"patterns": [
			"What are the undergraduate organizations in CAFA?",
			"Can you list some student organizations in CAFA?",
			"Tell me about student organizations in CAFA",
			"What clubs are available for CAFA undergraduates?",
			"Are there any student associations in CAFA?",
			"Which organizations can CAFA undergraduates join?",
			"What are some CAFA student groups?",
			"What student clubs exist within CAFA?",
			"I'm interested in CAFA student organizations. What are my options?",
			"Are there any clubs specifically for CAFA students?",
			"What extracurricular activities are offered for CAFA undergraduates?",
			"Can you provide information about CAFA student associations?",
			"What are some examples of student groups in CAFA?",
			"I want to get involved in CAFA student life. What organizations can I join?",
			"Where can I find information about student clubs in CAFA?"
		],
		"responses": [
			"Architectural Students' Association of the Philippines ARKITEKTOS - Technological University of the Philippines Chapter (ASAPHIL ARKITEKTOS TUP)\nTechnology Hoist Related Excellent Alliance of Drafting Students (THREADS)\nUnited Architects of the Philippines  Student Auxiliary  TUP Chapter (UAPSA)"
		]
	},

	{
		"tag": "coe_undergrad_org",
		"patterns": [
			"What organizations exist for undergraduates in the College of Engineering?",
			"Can you list some student organizations in the College of Engineering?",
			"What clubs are available for undergraduates in COE?",
			"Tell me about the student societies in the College of Engineering.",
			"What are some student groups in COE?",
			"Which organizations are active in the College of Engineering?",
			"What student associations operate within COE?",
			"Are there any clubs specifically for undergraduate students in COE?",
			"What are the names of some undergraduate organizations in the College of Engineering?",
			"Provide information on COE student organizations.",
			"List the undergrad organizations in COE.",
			"What are the names of COE's student societies?",
			"Tell me about the student clubs at COE.",
			"Can you give details about COE's undergraduate organizations?",
			"What student groups are affiliated with the College of Engineering?"
		],
		"responses": [
			"Technological University of the Philippines - Electrical Engineering Society (TUPEES)\nPhilippine Society of Mechanical Engineers - TUP Student Unit (PSME - TUPSU)\nTUP Civil Engineering Society (TUPCES)\nOrganization of Electronics Engineering Students (OECES)"
		]
	},

	{
		"tag": "cla_undergrad_org",
		"patterns": [
			"What organizations exist for undergraduates in the College of Liberal Arts?",
			"Can you list some student organizations in the College of Liberal Arts?",
			"What clubs are available for undergraduates in CLA?",
			"Tell me about the student associations in the College of Liberal Arts.",
			"What are some student groups in CLA?",
			"Which organizations are active in the College of Liberal Arts?",
			"What student societies operate within CLA?",
			"Are there any clubs specifically for undergraduate students in CLA?",
			"What are the names of some undergraduate organizations in the College of Liberal Arts?",
			"Provide information on CLA student organizations.",
			"List the undergrad organizations in CLA.",
			"What are the names of CLA's student clubs?",
			"Tell me about the student groups at CLA.",
			"Can you give details about CLA's undergraduate organizations?",
			"What student organizations are affiliated with the College of Liberal Arts?"
		],
		"responses": [
			"Student Association of Future Young Hotelier and Restaurateur (SAFHYR)\nFuture Managers' Society (FUMAS)\nCLA Performing Arts Group (CPAG)\nSocial Science Organization (SSO)\nPhysical Education Club (PE Club)"
		]
	},

	{
		"tag": "cit_undergrad_org",
		"patterns": [
			"What organizations exist for undergraduates in the College of Industrial Technology?",
			"Can you list some student organizations in the College of Industrial Technology?",
			"What clubs are available for undergraduates in CIT?",
			"Tell me about the student associations in the College of Industrial Technology.",
			"What are some student groups in CIT?",
			"Which organizations are active in the College of Industrial Technology?",
			"What student societies operate within CIT?",
			"Are there any clubs specifically for undergraduate students in CIT?",
			"What are the names of some undergraduate organizations in the College of Industrial Technology?",
			"Provide information on CIT student organizations.",
			"List the undergrad organizations in CIT.",
			"What are the names of CIT's student clubs?",
			"Tell me about the student groups at CIT.",
			"Can you give details about CIT's undergraduate organizations?",
			"What student organizations are affiliated with the College of Industrial Technology?"
		],
		"responses": [
			"Graphic Arts and Printing Technology Students Association (GAPTSA)\nAssociation of Civil Engineering Technology Students (ACETS)\nRailway Engineering Technology Recognized Alliance of Competent and Keen Students (RETRACKS)\nInstitute of Computer Engineering Technologist Student Association (ICpET.SA)\nRadio Amateurs Communication Society (RACS)\nInnovative Society for Electronic Technologist (ISET)\nAssociation of Culinary Technology Students (ACTS) (formerly NAFTA)\nIntern Tech Community (ITC)\nJunior Designers Club (JDC)\nMechanical Technologists and Leaders Society (METALS)\nPhilippine Association of Food Technologist-Omega (PAFT-OMEGA)\nUnified Student Society of Automation Technology (USSAT)"
		]
	},

	{
		"tag": "cie_department_homeeconomics",
		"patterns": [  
			"Who are the instructors in the Home Economics department?",
			"Can you provide information about the faculty in the Home Economics department?",
			"I'm interested in contacting instructors in the Home Economics department. How can I reach them?",
			"Tell me about the faculty members in the Home Economics department.",
			"What are the names of the instructors teaching Home Economics courses?",
			"I want to know more about the faculty in the Home Economics department.",
			"Give me details about the Home Economics department instructors.",
			"Describe the faculty members in the Home Economics department.",
			"Where can I find information on the instructors in the Home Economics department?",
			"What positions do the faculty members hold in the Home Economics department?",
			"What are the names and designations of the instructors in the Home Economics department?",
			"Are there any specific instructors I should contact in the Home Economics department?",
			"Who are the professors teaching Home Economics courses?",
			"I'm looking for information about the Home Economics department faculty. Can you help?",
			"Can you list the faculty members teaching in the Home Economics department?"            
		],
		"responses": [[
				{
				"Name": "MS. ANA MARIE B. OCAMPO",
				"Designation": "Instructor I",
				"Email": "anamarie_ocampo@tup.edu.ph"
				},
				{
				"Name": "MS. ANGELICA S. OFIANA ",
				"Designation": "Instructor I",
				"Email": "angelica_ofiana@tup.edu.ph"
				},
				{
				"Name": "ASSOC. PROF. DOROTHY D. MANALANSAN",
				"Designation": "Associate Professor III",
				"Email": "dorothy_manalansan@tup.edu.ph"
				},
				{
				"Name": "MS. GRACE G. BARBOZA-DE VERA ",
				"Designation": "Instructor I",
				"Email": "grace_devera@tup.edu.ph"
				},
				{
				"Name": "MS. KATRINA C. MACARAEG",
				"Designation": "Instructor I",
				"Email": "katrina_macaraeg@tup.edu.ph"
				},
				{
				"Name": "ASSOC. PROF. MARA DIVAH V. TUPAZ",
				"Designation": "Associate Professor IV",
				"Email": "maradivah_tupaz@tup.edu.ph"
				},
				{
				"Name": "ASST. PROF. RACQUEL B. TAGAZA",
				"Designation": "Associate Professor IV",
				"Email": "racquel_tagaza@tup.edu.ph"
				},
				{
				"Name": "MS. ROSALYN E. MAGLASANG",
				"Designation": "Instructor I",
				"Email": "rosalyn_maglasang@tup.edu.ph"
				},
				{
				"Name": "ASSOC. PROF. SOCORRO A. BULIC",
				"Designation": "Associate Professor I",
				"Email": "socorro_bulic@tup.edu.ph"
				}
		]]
	},
	{
		"tag": "cie_department_professionalindustrialeducation",
		"patterns": [
			"Who are the professors in the Department of Professional Industrial Education?",
			"Can you provide information about the faculty members in Professional Industrial Education?",
			"Tell me about the instructors in the Professional Industrial Education department.",
			"I want to know more about the faculty in the Professional Industrial Education department.",
			"Who teaches courses in Professional Industrial Education?",
			"What are the names of the professors in Professional Industrial Education?",
			"Can you list the faculty members of the Professional Industrial Education department?",
			"Provide details about the professors in the Professional Industrial Education department.",
			"I'm interested in learning about the faculty members in Professional Industrial Education.",
			"What is the faculty composition of the Department of Professional Industrial Education?",
			"Tell me about the academic staff in the Professional Industrial Education department.",
			"Who are the instructors teaching in the Department of Professional Industrial Education?",
			"What are the names of the professors in the Professional Industrial Education department?",
			"Provide information about the teaching staff in the Department of Professional Industrial Education.",
			"I want to learn about the faculty members teaching Professional Industrial Education."              
		],
		"responses": [[
			{
				"Name": "DR. APOLLO P. PORTEZ",
				"Designation": "Professor VI",
				"Email": "apollo_portez@tup.edu.ph"
			},
			{
					"Name": "ASSOC. PROF. CHERRYPYN B. BARBACENA",
					"Designation": "Associate Professor V",
					"Email": "cherrypyn_barbacena@tup.edu.ph"
				},
				{
					"Name": "MS. DIANNE. VILLAR",
					"Designation": "Instructor I",
					"Email": "dianne_villar@tup.edu.ph"
				},
				{
					"Name": "ASST. PROF. ELIZABETH M. VERAYO",
					"Designation": "Assistant Professor IV",
					"Email": "elizabeth_verayo@tup.edu.ph"
				},
				{
					"Name": "MS. JACQUILYN C. VARGAS",
					"Designation": "Instructor I",
					"Email": "jacquilyn_vargas@tup.edu.ph"
				},
				{
					"Name": "ASSOC. PROF. NEIL ANDREW F. CALAYAG",
					"Designation": "Associate Professor II",
					"Email": "neilandrew_calayag@tup.edu.ph"
				},
				{
					"Name": "ASSOC. PROF. SILPA C. BAHIAN",
					"Designation": "Associate Professor III",
					"Email": "silpa_bahian@tup.edu.ph"
				},
				{
					"Name": "MR. REINZE L. VITO",
					"Designation": "Instructor I",
					"Email": "reinze_vito@tup.edu.ph"
				},
				{
					"Name": "ASSOC. PROF. WERSON R. DE ASIS",
					"Designation": "Associate Professor V",
					"Email": "werson_deasis@tup.edu.ph"
				}
		]]
	},
	{
		"tag": "cie_department_studentteaching",
		"patterns": [              
			"Who are the faculty members in the Student Teaching department?",
			"Can you provide information about the faculty in the Student Teaching department?",
			"Tell me about the professors in the Student Teaching department.",
			"What are the names of the faculty members in Student Teaching?",
			"I'm interested in learning about the faculty in the Student Teaching department.",
			"Give me details about the faculty members in Student Teaching.",
			"Who teaches in the Student Teaching department?",
			"What are the names of the professors in the Student Teaching department?",
			"I want to know about the faculty members teaching in Student Teaching.",
			"Could you provide information on the faculty in Student Teaching?",
			"What professors are associated with the Student Teaching department?",
			"Tell me about the instructors in the Student Teaching department.",
			"Who are the academic staff in the Student Teaching department?",
			"Provide details about the teaching staff in the Student Teaching department.",
			"What faculty members are part of the Student Teaching department?"
		],
		"responses": [[
				{
				"Name": "ASSOC. PROF. CRISTINA B. CELARTA",
				"Designation": "Associate Professor V",
				"Email": "cristina_celarta@tup.edu.ph"
				},
				{
				"Name": "ASSOC. PROF. EMELITA R. NUYDA",
				"Designation": "Associate Professor III",
				"Email": "emelita_nuyda@tup.edu.ph"
				},
				{
				"Name": "DR. GINA L. BASA",
				"Designation": "Associate Professor V",
				"Email": "gina_basa@tup.edu.ph"
				},
				{
				"Name": "ASSOC. PROF. MERLYN C. BAHIAN",
				"Designation": "Assistant Professor II",
				"Email": "merlyn_bahian@tup.edu.ph"
				},
				{
				"Name": "DR. ROMEO S. EBONITE",
				"Designation": "Professor V",
				"Email": "romeo_ebonite@tup.edu.ph"
				},
				{
				"Name": "ASSOC. PROF. SYLVIA B. GUEVARRA",
				"Designation": "Associate Professor III",
				"Email": "sylvia_guevarra@tup.edu.ph"
				}
		]]
	},
			
	{
		"tag": "cie_department_technicalarts",
		"patterns": [              
			"Who are the faculty members in the Department of Technical Arts?",
			"Can you provide information about the faculty in Technical Arts?",
			"I'd like to know about the faculty members in the Department of Technical Arts.",
			"Tell me about the instructors in the Department of Technical Arts.",
			"Who teaches in the Technical Arts department?",
			"What are the names of the faculty members in Technical Arts?",
			"Could you list the professors in the Department of Technical Arts?",
			"I'm interested in learning about the academic staff in Technical Arts.",
			"Who are the instructors for Technical Arts courses?",
			"What are the names of the teachers in the Department of Technical Arts?",
			"Can you give me details about the faculty members specializing in Technical Arts?",
			"Tell me about the teaching staff in the Department of Technical Arts.",
			"I want information about the faculty in Technical Arts.",
			"Who are the educators in the Technical Arts department?",
			"Provide details about the faculty members of Technical Arts."
		],
		"responses": [[
			{
				"Name": "ASSOC. PROF. ALLAN C. VILLARIZA",
				"Designation": "Associate Professor III",
				"Email": "allan_villariza@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF. CECILIO B. PINGKIAN",
				"Designation": "Associate Professor IV",
				"Email": "cecilio_pingkian@tup.edu.ph"
			},
			{
				"Name": "MR. DERWIN C. LAGMAY",
				"Designation": "Instructor I",
				"Email": "derwin_lagmay@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF. EDGAR M. GATUS",
				"Designation": "Associate Professor I",
				"Email": "edgar_gatus@tup.edu.ph"
			},
			{
				"Name": "MR. JOHN ZALES U. COMENDADOR",
				"Designation": "Instructor I",
				"Email": "johnzales_comendadorg@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF. JOVYLON B. CANENCIA",
				"Designation": "Associate Professor II",
				"Email": "jovylon_canencia@tup.edu.ph"
			},
			{
				"Name": "MR. JUSTIN KYLO-MARC M. ORPIA",
				"Designation": "Instructor I",
				"Email": "justinkylomarc_orpia@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. MARIANNE A. FESTIN ",
				"Designation": "Assistant Professor III",
				"Email": "marianne_festin@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. MICHAEL B. SERRANO ",
				"Designation": "Assistant Professor III",
				"Email": "michael_serrano@tup.edu.ph"
			},
			{
				"Name": " ASST. PROF. MICHAEL O. VILLADOLID",
				"Designation": "Assistant Professor I",
				"Email": "michael_villadolid@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. NESTOR JR. M. MURCIA",
				"Designation": "Assistant Professor IV",
				"Email": "nestor_murcia@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF. NONILON V. MARICATOL",
				"Designation": "Associate Professor II",
				"Email": "nonilon_maricatol@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. NOREEN Z. REJANO",
				"Designation": "Assistant Professor III",
				"Email": "noreen_rejano@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF. RENATO S. SANDOVAL",
				"Designation": "Associate Professor III",
				"Email": "renato_sandoval@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF. ROLANDO JR. C. SUERTE",
				"Designation": "Associate Professor I",
				"Email": "rolando_surte@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. RONALD B. CAPARAS",
				"Designation": "Assistant Professor II",
				"Email": "roland_caparas@tup.edu.ph"
			},
			{
				"Name": "MR. RONNEL M. ARBUTANTE ",
				"Designation": "Instructor I",
				"Email": "ronnel_arbutante@tup.edu.ph"
			}
		]]
	},
	{
		"tag": "cos_department_chemistry",
		"patterns": [
			"Who are the instructors in the Chemistry Department?",
			"Can you provide information about the faculty in the Chemistry Department?",
			"Tell me about the Chemistry Department instructors.",
			"I want to know about the faculty members in the Chemistry Department.",
			"Who teaches Chemistry courses at TUP?",
			"What are the names of the instructors in the Chemistry Department?",
			"Can you list the Chemistry Department faculty members?",
			"Provide details about the instructors teaching Chemistry.",
			"I'm interested in the faculty of the Chemistry Department. Who are they?",
			"Tell me about the Chemistry Department faculty.",
			"What are the names of the Chemistry Department instructors?",
			"I need information on the faculty members in Chemistry.",
			"Who are the professors teaching Chemistry courses?",
			"Please give me details about the Chemistry Department faculty.",
			"List the instructors who teach Chemistry at TUP."
		],
		"responses": [[
			{
				"Name": "MR. ANLEE A. REFUERZO",
				"Designation": "Instructor I",
				"Email": "anlee_refuerzo@tup.edu.ph"
			},
			{
				"Name": "MR. JOSHUA T. SORIANO",
				"Designation": "Instructor I",
				"Email": "joshua_soriano@tup.edu.ph"
			},
			{
				"Name": "MR. OLIVIA A. OLIVA",
				"Designation": "Instructor I",
				"Email": "olivia_oliva@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF CORAZON D. SACDALAN",
				"Designation": "Associate Professor III",
				"Email": "corazon_sacdalan@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. ELIZABETH A. BAROSA",
				"Designation": "Assistant Professor II",
				"Email": "elizabeth_barosa@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF ERWIN P. ELAZEGUI",
				"Designation": "Associate Professor V",
				"Email": "erwin_elazegui@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. EVALYN S. CAPINDING",
				"Designation": "Assistant Professor II",
				"Email": "evalyn_capinding@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. GLORICEL A. ERGINO",
				"Designation": "Assistant Professor I",
				"Email": "gloricel_ergino@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. MA. CRISTINA T. CABILDO",
				"Designation": "Assistant Professor II",
				"Email": "macristina_cabildo@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. MARIA CARMELITA G. SAPINA",
				"Designation": "Assistant Professor II",
				"Email": "mariacarmelita_sapina@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF MARY SHEENALYN P. RODIL",
				"Designation": "Associate Professor V",
				"Email": "marysheenalyn_rodil@tup.edu.ph"
			}
		]]
	},

	{
		"tag": "cos_department_computerstudies",
		"patterns": [
			"Who are the instructors in the Computer Studies Department?",
			"Can you provide information about the faculty members in the Computer Studies Department?",
			"I want to know about the faculty of the Computer Studies Department.",
			"Who teaches in the Computer Studies Department?",
			"Tell me about the instructors in the Computer Studies Department.",
			"What are the names of the faculty members in the Computer Studies Department?",
			"Give me details about the faculty in the Computer Studies Department.",
			"Which professors are part of the Computer Studies Department?",
			"Who are the teaching staff in the Computer Studies Department?",
			"Provide information on the faculty members of the Computer Studies Department.",
			"Who are the educators in the Computer Studies Department?",
			"What is the faculty composition of the Computer Studies Department?",
			"Tell me about the academic staff in the Computer Studies Department.",
			"I'm interested in learning about the faculty in the Computer Studies Department.",
			"What are the names of the instructors in the Computer Studies Department?"
		],
		"responses": [[
			{
				"Name": "MR. ARIEL L. TOMAGAN",
				"Designation": "Instructor I",
				"Email": "ariel_tomagan@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. DARWIN C. VARGAS",
				"Designation": "Assistant Professor II",
				"Email": "darwin_vargas@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. DOLORES L. MONTESINES",
				"Designation": "Assistant Professor I",
				"Email": "dolores_montesines@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. EDWARD N. CRUZ",
				"Designation": "Assistant Professor I",
				"Email": "edward_cruz@tup.edu.ph"
			},
			{
				"Name": "MS. ELANIE J. VIZCONDE",
				"Designation": "Instructor I",
				"Email": "elanie_vizconde@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF FERNANDO L. RENEGADO",
				"Designation": "Associate Professor III",
				"Email": "fernando_renegado@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. FRANCIS L. DELA CRUZ",
				"Designation": "Assistant Professor III",
				"Email": "francis_delacruz@tup.edu.ph"
			},
			{
				"Name": "MR. JAN EILBERT L. LEE",
				"Designation": "Instructor II",
				"Email": "janeilbert_lee@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF MARIA CARMELA F. FRANCISCO",
				"Designation": "Associate Professor V",
				"Email": "mariacarmela_francisco@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF MAY M. GARCIA",
				"Designation": "Associate Professor II",
				"Email": "may_garcia@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. PERAGRINO JR. B. AMADOR",
				"Designation": "Assistant Professor III",
				"Email": "peragrino_amador@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. PRISCILLA S. BATOR",
				"Designation": "Assistant Professor I",
				"Email": "priscilla_bator@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF WELLANIE M. MOLINO",
				"Designation": "Associate Professor II",
				"Email": "wellanie_molino@tup.edu.ph"
			}
		]]
	},

	{
		"tag": "cos_department_mathematics",
		"patterns": [
			"Who are the instructors in the Mathematics Department?",
			"Can you provide information about the faculty members of the Mathematics Department?",
			"I want to know about the instructors in the Mathematics Department.",
			"Tell me about the faculty members in the Mathematics Department.",
			"What are the names of the instructors teaching in the Mathematics Department?",
			"Who teaches mathematics at the university?",
			"Which professors are part of the Mathematics Department?",
			"Who are the academic staff in the Mathematics Department?",
			"Could you give me details about the instructors in the Mathematics Department?",
			"I need information about the faculty members of the Mathematics Department.",
			"What are the names of the teachers in the Mathematics Department?",
			"Tell me about the academic staff of the Mathematics Department.",
			"Who are the lecturers in the Mathematics Department?",
			"What faculty members are associated with teaching mathematics?",
			"Can you list the instructors who teach mathematics?"
		],
		"responses": [[
			{
				"Name": "MR. ARTHUR GLENN A. GUILLEN",
				"Designation": "Instructor I",
				"Email": "arthur_guillen@tup.edu.ph"
			},
			{
				"Name": "MR. DAVE CARLOS A. CALIXTO",
				"Designation": "Instructor I",
				"Email": "dave_calixto@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF DAVID S. BALANDO",
				"Designation": "Associate Professor II",
				"Email": "david_balando@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF ERNITA R. CALAYAG",
				"Designation": "Associate Professor V",
				"Email": "ernita_calayag@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF GEMAR R. PAHAYAHAY",
				"Designation": "Associate Professor I",
				"Email": "gemar_pahayahay@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. GENER N. DE JESUS",
				"Designation": "Assistant Professor I",
				"Email": "gener_dejesus@tup.edu.ph"
			},
			{
				"Name": "DR. HADJI C. ALEGRE",
				"Designation": "Assistant Professor I",
				"Email": "hadji_alegre@tup.edu.ph"
			},
			{
				"Name": "DR. HASMIN T. IGNACIO",
				"Designation": "Associate Professor IV",
				"Email": "hasmin_ignacio@tup.edu.ph"
			},
			{
				"Name": "MS. HAZELETTE L. DOO",
				"Designation": "Instructor III",
				"Email": "hazelette_dono@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF MA. TERESA F. MANDI",
				"Designation": "Associate Professor III",
				"Email": "materesa_mandi@tup.edu.ph"
			},
			{
				"Name": "ASSOC. PROF MELCHOR G. PACER",
				"Designation": "Associate Professor II",
				"Email": "melchor_pacer@tup.edu.ph"
			},
			{
				"Name": "ASST. PROF. OLIVIA D. REAL",
				"Designation": "Assistant Professor I",
				"Email": "olivia_real@tup.edu.ph"
			},
			{
				"Name": "MR. REGGIE C. CAMPOMANES",
				"Designation": "Instructor I",
				"Email": "reggie_campomanes@tup.edu.ph"
			}
		]]
	},

	{
		"tag": "cos_department_physics",
		"patterns": [
			"Who are the faculty members in the Physics Department?",
			"Can you provide a list of instructors in the Physics Department?",
			"What are the names of the professors teaching in the Physics Department?",
			"I'm looking for information about the faculty in the Physics Department.",
			"Could you give me the names of the teachers in the Physics Department?",
			"Who are the academic staff members in the Physics Department?",
			"Tell me about the instructors in the Physics Department.",
			"What are the names of the lecturers in the Physics Department?",
			"I want to know more about the faculty members in the Physics Department.",
			"Give me details about the professors in the Physics Department.",
			"Describe the faculty composition of the Physics Department.",
			"Where can I find information about the faculty in the Physics Department?",
			"What professors are associated with the Physics Department?",
			"Can you list the faculty members of the Physics Department?",
			"Who are the teaching staff in the Physics Department?"
		],
		"responses": [[
		{
			"Name": "ASST. PROF. ALDRIN G. CHANG",
			"Designation": "Assistant Professor II",
			"Email": "aldrin_chang@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. ANALIZA H. IBAY",
			"Designation": "Assistant Professor III",
			"Email": "analiza_ibay@tup.edu.ph"
		},
		{
			"Name": "MS. ANALYN N. TOLENTINO",
			"Designation": "Instructor I",
			"Email": "analyn_tolentino@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. CARLO ANGELO. PELOTENIA",
			"Designation": "Assistant Professor I",
			"Email": "carloangelo_pelotenia@tup.edu.ph"
		},
		{
			"Name": "MS. COLEEN M. AMADO",
			"Designation": "Instructor I",
			"Email": "coleen_amado@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. DANILO B. OLETE",
			"Designation": "Assistant Professor I",
			"Email": "danilo_olete@tup.edu.ph"
		},
		{
			"Name": "MR. FRANCIS S. DELA CRUZ",
			"Designation": "Instructor I",
			"Email": "francis_delacruz@tup.edu.ph"
		},
		{
			"Name": "MR. FROILAN N. DE GUZMAN",
			"Designation": "Instructor I",
			"Email": "froilan_deguzman@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF JERVIE M. OLIVEROS",
			"Designation": "Associate Professor I",
			"Email": "jervie_oliveros@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. KRISTINA M. SAN JOSE",
			"Designation": "Assistant Professor III",
			"Email": "kristina_sanjose@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. LUCRECIA L. CARBONEL",
			"Designation": "Assistant Professor III",
			"Email": "lucrecia_carbonel@tup.edu.ph"
		},
		{
			"Name": "MR. MA. KRISTINA B. DELA CRUZ",
			"Designation": "Instructor I",
			"Email": "makristina_delacruz@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF MA. ROSANNA C. PAHAYAHAY",
			"Designation": "Associate Professor II",
			"Email": "marosanna_pahayahay@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. MICHAEL ALLAN A. BAHTAJI",
			"Designation": "Assistant Professor II",
			"Email": "michaelallan_bahtaji@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. NOLI V. CORPUZ",
			"Designation": "Assistant Professor I",
			"Email": "noli_corpuz@tup.edu.ph"
		},
		{
			"Name": "MR. RAYMUND T. MASANGYA",
			"Designation": "Instructor I",
			"Email": "raymund_masangya@tup.edu.ph"
		}
		]]
	},
	
	{
		"tag": "cafa_department_architecture",
		"patterns": [
			"Who is the instructor I in the Architecture Department?",
			"Can you provide information about the Architecture Department instructors?",
			"Who are the faculty members in the Architecture Department?",
			"I'm looking for details about the instructors in the Architecture Department.",
			"What are the names of the instructors in the Architecture Department?",
			"Tell me about the faculty members teaching Architecture.",
			"Who teaches architecture courses?",
			"What are the names of the instructors in the Architecture Department?",
			"I need to contact an instructor from the Architecture Department. Who can I reach out to?",
			"Who are the instructors handling Architecture subjects?",
			"Which individuals are part of the faculty in the Architecture Department?",
			"Who are the educators responsible for teaching architecture?",
			"Can you list the names of instructors in the Architecture Department?",
			"What are the names of the faculty members teaching Architecture courses?",
			"I want to know more about the instructors in the Architecture Department."
		],
		"responses": [[
		{
			"Name": "MR. ARJEE LOUIE DC. JIMENEZ",
			"Designation": "Instructor I",
			"Email": "arjeelouie_jimenez@tup.edu.ph"
		},
		{
			"Name": "MR. EDUARDO A. BABON",
			"Designation": "Instructor I",
			"Email": "eduardo_babon@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. ELPIDIO JR. T. BALAIS",
			"Designation": "Associate Professor I",
			"Email": "elpidio_balais@tup.edu.ph"
		},
		{
			"Name": "MR. EMERSON S. BAQUIRAN",
			"Designation": "Instructor II",
			"Email": "emerson_baquiran@tup.edu.ph"
		},
		{
			"Name": "MR. EVA MARIE L. BANDOLA",
			"Designation": "Instructor I",
			"Email": "evamarie_bandola@tup.edu.ph"
		},
		{
			"Name": "MR. GRACE F. FAJILAGUTAN",
			"Designation": "Instructor I",
			"Email": "grace_fajilagutan@tup.edu.ph"
		},
		{
			"Name": "MR. JEMNERY B. CO",
			"Designation": "Instructor I",
			"Email": "jemnery_co@tup.edu.ph"
		},
		{
			"Name": "MR. KENNETH V. TRIBUTO",
			"Designation": "Instructor I",
			"Email": "kenneth_tributo@tup.edu.ph"
		},
		{
			"Name": "MR. RAYMOND N. VILLA",
			"Designation": "Instructor I",
			"Email": "raymond_villa@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. ROSELLIA ROWENA A. MANZANO",
			"Designation": "Assistant Professor IV",
			"Email": "roselliarowena_manzano@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. ROWENA ESTRELLA M. NACION",
			"Designation": "Assistant Professor II",
			"Email": "rowenaestrella_nacion@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "cafa_department_finearts",
		"patterns": [
			"Who are the faculty members in the Department of Fine Arts?",
			"Can you provide information about the faculty in the Fine Arts Department?",
			"I'm interested in contacting the faculty of the Fine Arts Department. How can I reach them?",
			"Tell me about the professors teaching in the Fine Arts Department.",
			"What are the names of the instructors in the Department of Fine Arts?",
			"I want to know more about the academic staff in the Fine Arts Department.",
			"Who are the educators in the Fine Arts Department?",
			"Can you list the faculty members of the Fine Arts Department?",
			"What is the faculty composition of the Fine Arts Department?",
			"I'm looking for details about the teaching staff in the Department of Fine Arts.",
			"Provide information about the Fine Arts Department faculty.",
			"Who are the lecturers in the Fine Arts Department?",
			"Tell me about the instructors in the Department of Fine Arts.",
			"What are the names of the Fine Arts Department professors?",
			"How can I contact the faculty members of the Fine Arts Department?"
		],
		"responses": [[
		{
			"Name": "ASSOC. PROF. ALMINA T. TENGCO-CHAN",
			"Designation": "Associate Professor I",
			"Email": "almina_tengcochan@tup.edu.ph"
		},
		{
			"Name": "MR. ERNEST JOSEPH M. GARCIA",
			"Designation": "Instructor I",
			"Email": "ernestjoseph_garcia@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. FERDINAND R. DOCTOLERO",
			"Designation": "Assistant Professor I",
			"Email": "ferdinand_doctolero@tup.edu.ph"
		},
		{
			"Name": "MS. MAJHALINA I. APUYAN",
			"Designation": "Instructor I",
			"Email": "majhalina_apuyan@tup.edu.ph"
		},
		{
			"Name": "MS. MARIA REGINA DG. FREJAS",
			"Designation": "Instructor I",
			"Email": "mariaregina_frejas@tup.edu.ph"
		},
		{
			"Name": "MR. RAMON T. DELA CRUZ",
			"Designation": "Instructor III",
			"Email": "ramon_dela_cruz@tup.edu.ph"
		}
		]]
	},
	
	{
		"tag": "cafa_department_graphics",
		"patterns": [
			"Who are the faculty members in the Graphics Department?",
			"Can you provide information about the Graphics Department faculty?",
			"I want to know about the faculty members in the Graphics Department.",
			"Who teaches in the Graphics Department?",
			"Tell me about the instructors in the Graphics Department.",
			"What are the names of the faculty members in the Graphics Department?",
			"Which professors are part of the Graphics Department?",
			"Give me details about the faculty in the Graphics Department.",
			"I'm interested in the faculty of the Graphics Department. Can you help?",
			"Could you list the faculty members in the Graphics Department?",
			"Who are the instructors teaching in the Graphics Department?",
			"I need information about the Graphics Department faculty members.",
			"What are the names of the professors in the Graphics Department?",
			"Can you tell me about the Graphics Department faculty?",
			"Provide details about the faculty members in the Graphics Department."
		],
		"responses": [[
		{
			"Name": "ASST. PROF. CIELO Q. PARAFINA",
			"Designation": "Assistant Professor IV",
			"Email": "cielo_parafina@tup.edu.ph"
		},
		{
			"Name": "MS. DANNA ROSE F. MICIANO",
			"Designation": "Instructor I",
			"Email": "dannarose_miciano@tup.edu.ph"
		},
		{
			"Name": "DR. DIONISIO JR. A. ESPRESSION",
			"Designation": "Professor IV",
			"Email": "dionisiojr_espresion@tup.edu.ph"
		},
		{
			"Name": "MS. ELLAINE C. AMARO",
			"Designation": "Instructor I",
			"Email": "ellaine_amaro@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. ELMER M. SANGALANG",
			"Designation": "Associate Professor I",
			"Email": "elmer_sangalang@tup.edu.ph"
		},
		{
			"Name": "MR. IVAN KIM B. ECIJAN",
			"Designation": "Instructor I",
			"Email": "ivankim_ecijan@tup.edu.ph"
		},
		{
			"Name": "MR. KRISTOFFER R. TORRALBA",
			"Designation": "Instructor II",
			"Email": "kristoffer_torralba@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. LOWELL QUEY S. FABRIGAR",
			"Designation": "Assistant Professor III",
			"Email": "lowellquey_fabrigar@tup.edu.ph"
		},
		{
			"Name": "MS. MARCELINA P. PUGA",
			"Designation": "Instructor I",
			"Email": "marcelina_puga@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. MARILYN G. BACTAD",
			"Designation": "Assistant Professor I",
			"Email": "marilyn_bactad@tup.edu.ph"
		},
		{
			"Name": "MR. MELVIN G. MOJICA",
			"Designation": "Instructor I",
			"Email": "melvin_mojica@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. PABLO JR. G. PILAR",
			"Designation": "Associate Professor I",
			"Email": "pablojr_pilar@tup.edu.ph"
		},
		{
			"Name": "MR. PAX JEROME M. PEDROSA",
			"Designation": "Instructor I",
			"Email": "paxjerome_pedrosa@tup.edu.ph"
		},
		{
			"Name": "MR. RAFAEL TITUS S. ANGELES",
			"Designation": "Instructor I",
			"Email": "rafaeltitus_angeles@tup.edu.ph"
		},
		{
			"Name": "MS. REMEGIA C. JACOB",
			"Designation": "Instructor I",
			"Email": "remegia_jacob@tup.edu.ph"
		},
		{
			"Name": "MS. RICHELLE D. MAYLAD",
			"Designation": "Instructor I",
			"Email": "richelle_maylad@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. WILMA D. ENRIQUEZ",
			"Designation": "Assistant Professor IV",
			"Email": "wilma_enriquez@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "coe_department_civil",
		"patterns": [
			"Who are the faculty members in the Civil Engineering Department?",
			"Can you provide information about the Civil Engineering Department faculty?",
			"I want to know about the faculty members in the Civil Engineering Department.",
			"Who teaches in the Civil Engineering Department?",
			"Tell me about the instructors in the Civil Engineering Department.",
			"What are the names of the faculty members in the Civil Engineering Department?",
			"Which professors are part of the Civil Engineering Department?",
			"Give me details about the faculty in the Civil Engineering Department.",
			"I'm interested in the faculty of the Civil Engineering Department. Can you help?",
			"Could you list the faculty members in the Civil Engineering Department?",
			"Who are the instructors teaching in the Civil Engineering Department?",
			"I need information about the Civil Engineering Department faculty members.",
			"What are the names of the professors in the Civil Engineering Department?",
			"Can you tell me about the Civil Engineering Department faculty?",
			"Provide details about the faculty members in the Civil Engineering Department."
		],
		"responses": [[
		{
			"Name": "ASST. PROF. BOBBY C. LUPANGO",
			"Designation": "Assistant Professor I",
			"Email": "bobby_lupango@tup.edu.ph"
		},
		{
			"Name": "MR. CHRISTIAN A. ARBALATE",
			"Designation": "Instructor I",
			"Email": "christian_arbalate@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. EDGARDO S. LEGASPI",
			"Designation": "Associate Professor III",
			"Email": "edgardo_legaspi@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. EDMUNDO C. DELA CRUZ",
			"Designation": "Associate Professor III",
			"Email": "edmundo_delacruz@tup.edu.ph"
		},
		{
			"Name": "MR. ELEZAR M. MONTEMAYOR",
			"Designation": "Instructor I",
			"Email": "elezar_montemayor@tup.edu.ph"
		},
		{
			"Name": "MR. GABRIEL I. GAMANA",
			"Designation": "Instructor I",
			"Email": "gabriel_gamana@tup.edu.ph"
		},
		{
			"Name": "MR. JESON C. REPANA",
			"Designation": "Instructor I",
			"Email": "jeson_repana@tup.edu.ph"
		},
		{
			"Name": "MR. JHON LOUIE F. CUERDO",
			"Designation": "Instructor I",
			"Email": "jhonlouie_cuerrdo@tup.edu.ph"
		},
		{
			"Name": "MS. JOSEA ANDREA R. OBISPO",
			"Designation": "Instructor I",
			"Email": "joseaandrea_obispo@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. JUAN PAULO L. BERSAMINA",
			"Designation": "Assistant Professor II",
			"Email": "juan_bersamina@tup.edu.ph"
		},
		{
			"Name": "MR. KEVIN M. DESALES",
			"Designation": "Instructor I",
			"Email": "kevin_desales@tup.edu.ph"
		},
		{
			"Name": "MR. LEONARD M. AGUSTIN",
			"Designation": "Instructor I",
			"Email": "leonard_agustin@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. LUCIA V. ORTEGA",
			"Designation": "Assistant Professor I",
			"Email": "lucia_ortega@tup.edu.ph"
		},
		{
			"Name": "MR. MARK JOSEPH T. BUGARIN",
			"Designation": "Instructor I",
			"Email": "markjoseph_bugarin@tup.edu.ph"
		},
		{
			"Name": "DR. MELITO A. BACCAY",
			"Designation": "Professor VI",
			"Email": "melito_baccay@tup.edu.ph"
		},
		{
			"Name": "MR. ROMIE M. ZAPANTA",
			"Designation": "Instructor I",
			"Email": "romie_zapanta@tup.edu.ph"
		},
		{
			"Name": "MR. ROMMEL G. ARAPO",
			"Designation": "Instructor I",
			"Email": "rommel_arapo@tup.edu.ph"
		},
		{
			"Name": "MS. SHEINA R. PALLEGA",
			"Designation": "Instructor I",
			"Email": "sheina_pallega@tup.edu.ph"
		},
		{
			"Name": "MR. TEODIMER II M. ESCURO",
			"Designation": "Instructor I",
			"Email": "teodimer_escuro@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. TEODINIS P. GARCIA",
			"Designation": "Associate Professor V",
			"Email": "teodinis_garcia@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "coe_department_electrical",
		"patterns": [
			"Who are the faculty members in the Electrical Department?",
			"Can you provide information about the Electrical Department faculty?",
			"I want to know about the faculty members in the Electrical Department.",
			"Who teaches in the Electrical Department?",
			"Tell me about the instructors in the Electrical Department.",
			"What are the names of the faculty members in the Electrical Department?",
			"Which professors are part of the Electrical Department?",
			"Give me details about the faculty in the Electrical Department.",
			"I'm interested in the faculty of the Electrical Department. Can you help?",
			"Could you list the faculty members in the Electrical Department?",
			"Who are the instructors teaching in the Electrical Department?",
			"I need information about the Electrical Department faculty members.",
			"What are the names of the professors in the Electrical Department?",
			"Can you tell me about the Electrical Department faculty?",
			"Provide details about the faculty members in the Electrical Department."
		],
		"responses": [[
		{
			"Name": "MS. CHEERJOY M. CURITANA",
			"Designation": "Instructor I",
			"Email": "cheerjoy_curitana@tup.edu.ph"
		},
		{
			"Name": "MR. EDWARD L. ACERO",
			"Designation": "Instructor I",
			"Email": "edward_acero@tup.edu.ph"
		},
		{
			"Name": "MR. EDWIN C. ESPINAS",
			"Designation": "Instructor I",
			"Email": "edwin_espinas@tup.edu.ph"
		},
		{
			"Name": "MS. EVA B. BELGAR",
			"Designation": "Instructor I",
			"Email": "eva_belgar@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. GILBERT B. HOLLMAN",
			"Designation": "Associate Professor III",
			"Email": "gilbert_hollman@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. JOVENCIO V. MERIN",
			"Designation": "Associate Professor II",
			"Email": "jovencio_merin@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. JUN A. TERESA",
			"Designation": "Assistant Professor I",
			"Email": "jun_teresa@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. LYNDON R. BAGUE",
			"Designation": "Associate Professor V",
			"Email": "lyndon_bague@tup.edu.ph"
		},
		{
			"Name": "MS. MELANIE T. IRADIEL",
			"Designation": "Instructor I",
			"Email": "melanie_iradiel@tup.edu.ph"
		},
		{
			"Name": "MR. MERVYN ANTHONY N. RAMOS",
			"Designation": "Instructor I",
			"Email": "mervynanthony_ramos@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. REY S. JUGANAS",
			"Designation": "Assistant Professor IV",
			"Email": "rey_juganas@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. ROEL M. MENDOZA",
			"Designation": "Assistant Professor II",
			"Email": "roel_mendoza@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. ROVENSON V. SEVILLA",
			"Designation": "Associate Professor IV",
			"Email": "rovenson_sevilla@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. RYAN C. REYES",
			"Designation": "Assistant Professor I",
			"Email": "ryan_reyes@tup.edu.ph"
		},
		{
			"Name": "MR. SHAWN MICHAEL F. FABRIGAR",
			"Designation": "Instructor I",
			"Email": "shawnmichael_fabrigar@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. VILMA C. PAGTALUNAN",
			"Designation": "Associate Professor III",
			"Email": "vilma_pagtalunan@tup.edu.ph"
		}
		]]
	},
	{
		"tag": "coe_department_electronics",
		"patterns": [
			"Who are the faculty members in the Electronics Department?",
			"Can you provide information about the faculty in the Electronics Department?",
			"I want to know about the faculty members in the Electronics Department.",
			"Who teaches in the Electronics Department?",
			"Tell me about the instructors in the Electronics Department.",
			"What are the names of the faculty members in the Electronics Department?",
			"Which professors are part of the Electronics Department?",
			"Give me details about the faculty in the Electronics Department.",
			"I'm interested in the faculty of the Electronics Department. Can you help?",
			"Could you list the faculty members in the Electronics Department?",
			"Who are the instructors teaching in the Electronics Department?",
			"I need information about the Electronics Department faculty members.",
			"What are the names of the professors in the Electronics Department?",
			"Can you tell me about the Electronics Department faculty?",
			"Provide details about the faculty members in the Electronics Department."
		],
		"responses": [[
		{
			"Name": "ASSOC. PROF. AUGUST C. THIO-AC",
			"Designation": "Associate Professor IV",
			"Email": "august_thioac@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. CHERRY G. PASCION",
			"Designation": "Assistant Professor I",
			"Email": "cherry_pascion@tup.edu.ph"
		},
		{
			"Name": "MR. EDGAR A. GALIDO",
			"Designation": "Instructor II",
			"Email": "edgar_galido@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. EDMON O. FERNANDEZ",
			"Designation": "Associate Professor IV",
			"Email": "edmon_fernandez@tup.edu.ph"
		},
		{
			"Name": "MR. EDMUND G. MONILAR",
			"Designation": "Instructor I",
			"Email": "edmund_monilar@tup.edu.ph"
		},
		{
			"Name": "MR. GILFRED ALLEN M. MADRIGAL",
			"Designation": "Instructor I",
			"Email": "gilfredallen_madrigal@tup.edu.ph"
		},
		{
			"Name": "MR. JAY FEL C. QUIJANO",
			"Designation": "Instructor I",
			"Email": "jayfel_quijano@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. JESSICA S. VELASCO",
			"Designation": "Associate Professor III",
			"Email": "jessica_velasco@tup.edu.ph"
		},
		{
			"Name": "MR. JOHN PETER M. RAMOS",
			"Designation": "Instructor I",
			"Email": "johnpeter_ramos@tup.edu.ph"
		},
		{
			"Name": "MR. JOMER V. CATIPON",
			"Designation": "Instructor I",
			"Email": "jomer_catipon@tup.edu.ph"
		},
		{
			"Name": "MR. LARRY C. GALVEZ",
			"Designation": "Instructor I",
			"Email": "larry_galvez@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. LEAN KARLO S. TOLENTINO",
			"Designation": "Assistant Professor II",
			"Email": "leankarlo_tolentino@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. MARK P. MELEGRITO",
			"Designation": "Assistant Professor I",
			"Email": "mark_melegrito@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. NILO M. ARAGO",
			"Designation": "Associate Professor V",
			"Email": "nilo_arago@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. ROMEO JR. L. JORDA",
			"Designation": "Assistant Professor I",
			"Email": "romeojr_jorda@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. TIMOTHY M. AMADO",
			"Designation": "Associate Professor III",
			"Email": "timothy_amado@tup.edu.ph"
		},
		{
			"Name": "MS. VILLAMOR M. AMON",
			"Designation": "Instructor I",
			"Email": "villamor_amon@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "coe_department_mechanical",
		"patterns": [
			"Who are the faculty members in the Mechanical Engineering Department?",
			"Can you provide information about the faculty of the Mechanical Engineering Department?",
			"I want to know about the faculty members in the Mechanical Engineering Department.",
			"Who teaches in the Mechanical Engineering Department?",
			"Tell me about the instructors in the Mechanical Engineering Department.",
			"What are the names of the faculty members in the Mechanical Engineering Department?",
			"Which professors are part of the Mechanical Engineering Department?",
			"Give me details about the faculty in the Mechanical Engineering Department.",
			"I'm interested in the faculty of the Mechanical Engineering Department. Can you help?",
			"Could you list the faculty members in the Mechanical Engineering Department?",
			"Who are the instructors teaching in the Mechanical Engineering Department?",
			"I need information about the Mechanical Engineering Department faculty members.",
			"What are the names of the professors in the Mechanical Engineering Department?",
			"Can you tell me about the Mechanical Engineering Department faculty?",
			"Provide details about the faculty members in the Mechanical Engineering Department."
		],
		"responses": [[
		{
			"Name": "MR. ALVIN U. GAZO",
			"Designation": "Instructor I",
			"Email": "alvin_gazo@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. ANTIRO M. CA-AY",
			"Designation": "Assistant Professor I",
			"Email": "antiromo_caay@tup.edu.ph"
		},
		{
			"Name": "DR. BENEDICTO N. FORTALEZA",
			"Designation": "Professor II",
			"Email": "benedicto_fortaleza@tup.edu.ph"
		},
		{
			"Name": "MR. DONNIE BON L. BEROG",
			"Designation": "Instructor I",
			"Email": "donniebon_berog@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. EDWIN G. MACALINTAL",
			"Designation": "Assistant Professor I",
			"Email": "edwin_macalintal@tup.edu.ph"
		},
		{
			"Name": "MR. JAY MARK P. DELOS REYES",
			"Designation": "Instructor I",
			"Email": "jaymark_delosreyes@tup.edu.ph"
		},
		{
			"Name": "MR. JOHN DENNICE V. GANOTISI",
			"Designation": "Instructor I",
			"Email": "johndennice_ganotisi@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. JORGE B. YASAY",
			"Designation": "Associate Professor II",
			"Email": "jorge_yasay@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. MANUEL L. EUROPEO",
			"Designation": "Assistant Professor III",
			"Email": "manuel_europeo@tup.edu.ph"
		},
		{
			"Name": "MR. PAWELL JESTER T. DE VILLA",
			"Designation": "Instructor I",
			"Email": "pawelljester_devilla@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. ROMULO VICENTE D. BASAEN",
			"Designation": "Associate Professor I",
			"Email": "romulovicente_basaen@tup.edu.ph"
		},
		{
			"Name": "DR. RONALDO A. JUANATAS",
			"Designation": "Professor VI",
			"Email": "ronaldo_juanatas@tup.edu.ph"
		},
		{
			"Name": "MR. ROSS PATRICK Y. OCAMPO",
			"Designation": "Instructor I",
			"Email": "rosspatrick_ocampo@tup.edu.ph"
		},
		{
			"Name": "MS. SANDRA A. HOLLMAN",
			"Designation": "Instructor I",
			"Email": "sandra_hollman@tup.edu.ph"
		},
		{
			"Name": "MR. VINCENT RAUL C. ESPERANZA",
			"Designation": "Instructor I",
			"Email": "vincentraul_esperanza@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. VIRGILIO S. DELA CRUZ",
			"Designation": "Assistant Professor I",
			"Email": "virgilio_delacruz@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "cla_department_entrepreneur",
		"patterns": [
		"Who are the faculty members in the Entrepreneurship Department?",
		"Can you provide information about the Entrepreneurship Department faculty?",
		"I want to know about the faculty members in the Entrepreneurship Department.",
		"Who teaches in the Entrepreneurship Department?",
		"Tell me about the instructors in the Entrepreneurship Department.",
		"What are the names of the faculty members in the Entrepreneurship Department?",
		"Which professors are part of the Entrepreneurship Department?",
		"Give me details about the faculty in the Entrepreneurship Department.",
		"I'm interested in the faculty of the Entrepreneurship Department. Can you help?",
		"Could you list the faculty members in the Entrepreneurship Department?",
		"Who are the instructors teaching in the Entrepreneurship Department?",
		"I need information about the Entrepreneurship Department faculty members.",
		"What are the names of the professors in the Entrepreneurship Department?",
		"Can you tell me about the Entrepreneurship Department faculty?",
		"Provide details about the faculty members in the Entrepreneurship Department."
		],
		"responses": [[
		{
			"Name": "ASST. PROF. AIRESE A. PEROCHE",
			"Designation": "Assistant Professor I",
			"Email": "airese_peroche@tup.edu.ph"
		},
		{
			"Name": "MS. DAISY DIAN M. DEQUINA",
			"Designation": "Instructor I",
			"Email": "daisydian_dequina@tup.edu.ph"
		},
		{
			"Name": "MR. EDWARD Y. MANANSALA",
			"Designation": "Instructor II",
			"Email": "edward_manansala@tup.edu.ph"
		},
		{
			"Name": "MS. EMERALD JEAN D. VILLALOBOS",
			"Designation": "Instructor I",
			"Email": "emeraldjean_villalobos@tup.edu.ph"
		},
		{
			"Name": "MS. GENESIS S. AUSTRIA",
			"Designation": "Instructor I",
			"Email": "genesis_austria@tup.edu.ph"
		},
		{
			"Name": "MS. GRACE R. ABILAY",
			"Designation": "Instructor I",
			"Email": "grace_abilay@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. JEFFREN R. DIOQUINO",
			"Designation": "Associate Professor II",
			"Email": "jeffren_dioquino@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. JUVY V. DELMONTE",
			"Designation": "Assistant Professor II",
			"Email": "juvy_delmonte@tup.edu.ph"
		},
		{
			"Name": "DR. MICHAEL BHOBET B. BALUYOT",
			"Designation": "Instructor I",
			"Email": "michael_baluyot@tup.edu.ph"
		},
		{
			"Name": "MR. ROLANDO S. MANGADA",
			"Designation": "Instructor I",
			"Email": "rolando_mangada@tup.edu.ph"
		},
		{
			"Name": "MR. VICTOR JAMES C. ESCOLANO",
			"Designation": "Instructor I",
			"Email": "victorjames_escolano@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "cla_department_languages",
		"patterns": [
		"Who are the faculty members in the Languages Department?",
		"Can you provide information about the Languages Department faculty?",
		"I want to know about the faculty members in the Languages Department.",
		"Who teaches in the Languages Department?",
		"Tell me about the instructors in the Languages Department.",
		"What are the names of the faculty members in the Languages Department?",
		"Which professors are part of the Languages Department?",
		"Give me details about the faculty in the Languages Department.",
		"I'm interested in the faculty of the Languages Department. Can you help?",
		"Could you list the faculty members in the Languages Department?",
		"Who are the instructors teaching in the Languages Department?",
		"I need information about the Languages Department faculty members.",
		"What are the names of the professors in the Languages Department?",
		"Can you tell me about the Languages Department faculty?",
		"Provide details about the faculty members in the Languages Department."
		],
		"responses": [[
		{
			"Name": "ASST. PROF. ALFREDO D. TRINIDAD",
			"Designation": "Assistant Professor IV",
			"Email": "alfredo_trinidad@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. ANGELICA B. HARRIS",
			"Designation": "Associate Professor II",
			"Email": "angelica_harris@tup.edu.ph"
		},
		{
			"Name": "MR. CYNIC J. TENEDERO",
			"Designation": "Instructor I",
			"Email": "cynic_tenedero@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. GINA B. ARAOJO",
			"Designation": "Associate Professor II",
			"Email": "gina_araojo@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. GISELDA A. BONSOL",
			"Designation": "Assistant Professor I",
			"Email": "giselda_bonsol@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. MARGARET S. AQUINO",
			"Designation": "Associate Professor V",
			"Email": "margaret_aquino@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. MARIE JO TESS S. RAGOS",
			"Designation": "Assistant Professor I",
			"Email": "mariejotess_ragos@tup.edu.ph"
		},
		{
			"Name": "MS. MARY ANN A. MISA",
			"Designation": "Instructor I",
			"Email": "maryann_misa@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. MILLER C. DURON",
			"Designation": "Assistant Professor I",
			"Email": "miller_duron@tup.edu.ph"
		},
		{
			"Name": "MS. VANESSA D. CENIZAL",
			"Designation": "Instructor I",
			"Email": "vanessa_cenizal@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "cla_department_physicaleducation",
		"patterns": [
		"Who are the faculty members in the Physical Education Department?",
		"Can you provide information about the Physical Education Department faculty?",
		"I want to know about the faculty members in the Physical Education Department.",
		"Who teaches in the Physical Education Department?",
		"Tell me about the instructors in the Physical Education Department.",
		"What are the names of the faculty members in the Physical Education Department?",
		"Which professors are part of the Physical Education Department?",
		"Give me details about the faculty in the Physical Education Department.",
		"I'm interested in the faculty of the Physical Education Department. Can you help?",
		"Could you list the faculty members in the Physical Education Department?",
		"Who are the instructors teaching in the Physical Education Department?",
		"I need information about the Physical Education Department faculty members.",
		"What are the names of the professors in the Physical Education Department?",
		"Can you tell me about the Physical Education Department faculty?",
		"Provide details about the faculty members in the Physical Education Department."
		],
		"responses": [[
		{
			"Name": "ASST. PROF. ALLAN D. SORIA",
			"Designation": "Assistant Professor IV",
			"Email": "allan_soria@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. ARMANDO M. SANTIAGO",
			"Designation": "Assistant Professor III",
			"Email": "armando_santiago@tup.edu.ph"
		},
		{
			"Name": "MR. ARTEMIO JR. T. REYES",
			"Designation": "Instructor I",
			"Email": "artemiojr_reyes@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. BEVERLY C. YABUT",
			"Designation": "Assistant Professor I",
			"Email": "beverly_yabut@tup.edu.ph"
		},
		{
			"Name": "MS. DANICA G. BETOY",
			"Designation": "Instructor I",
			"Email": "danica_betoy@tup.edu.ph"
		},
		{
			"Name": "MR. JOEL H. ALCANTARA",
			"Designation": "Instructor III",
			"Email": "joel_alcantara@tup.edu.ph"
		},
		{
			"Name": "MR. JOSHUA A. TULIAO",
			"Designation": "Instructor I",
			"Email": "joshua_tuliao@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "cla_department_socialscience",
		"patterns": [
		"Who are the faculty members in the Social Science Department?",
		"Can you provide information about the faculty of the Social Science Department?",
		"I want to know about the faculty members in the Social Science Department.",
		"Who teaches in the Social Science Department?",
		"Tell me about the instructors in the Social Science Department.",
		"What are the names of the faculty members in the Social Science Department?",
		"Which professors are part of the Social Science Department?",
		"Give me details about the faculty in the Social Science Department.",
		"I'm interested in the faculty of the Social Science Department. Can you help?",
		"Could you list the faculty members in the Social Science Department?",
		"Who are the instructors teaching in the Social Science Department?",
		"I need information about the Social Science Department faculty members.",
		"What are the names of the professors in the Social Science Department?",
		"Can you tell me about the Social Science Department faculty?",
		"Provide details about the faculty members in the Social Science Department."
		],
		"responses": [[
		{
			"Name": "ASSOC. PROF. ANALIZA S. VALENZUELA",
			"Designation": "Associate Professor I",
			"Email": "analiza_valenzuela@tup.edu.ph"
		},
		{
			"Name": "DR. EDUARDO L. DOYAOEN",
			"Designation": "Professor III",
			"Email": "eduardo_doyaoen@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. EMELINDA Q. AGBUYA",
			"Designation": "Associate Professor I",
			"Email": "emelinda_agbuya@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. ENRICO S. LUCENA",
			"Designation": "Assistant Professor III",
			"Email": "enrico_lucena@tup.edu.ph"
		},
		{
			"Name": "MR. GENEMOORE B. VALDEZ",
			"Designation": "Instructor III",
			"Email": "genemoore_valdez@tup.edu.ph"
		},
		{
			"Name": "MR. JAIME JR. E. MOZO",
			"Designation": "Instructor I",
			"Email": "jaimejr_mozo@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. JANICE MARIE J. LAGRIMAS",
			"Designation": "Assistant Professor II",
			"Email": "janicemarie_lagrimas@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. JERSON A. MONSAD",
			"Designation": "Assistant Professor IV",
			"Email": "jerson_monsad@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. JOCELYN A. DIANO",
			"Designation": "Assistant Professor I",
			"Email": "jocelyn_diano@tup.edu.ph"
		},
		{
			"Name": "MS. JONA IRIS M. TRAMBULO",
			"Designation": "Instructor I",
			"Email": "jonairis_trambulo@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. JOSEFINA D. VILLALOBOS",
			"Designation": "Assistant Professor I",
			"Email": "josefina_villalobos@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. JULIUS C. DE LOS TRINOS",
			"Designation": "Assistant Professor III",
			"Email": "julius_delostrinos@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. LEILA R. DEUNA",
			"Designation": "Assistant Professor II",
			"Email": "leila_deuna@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. MA. DIVINA E. ELVAMBUENA",
			"Designation": "Associate Professor II",
			"Email": "madivina_elvambuena@tup.edu.ph"
		},
		{
			"Name": "MS. MA. KRISTINA R. SOLANO",
			"Designation": "Instructor I",
			"Email": "makristina_solano@tup.edu.ph"
		},
		{
			"Name": "MS. MYLENE T. SANGINES",
			"Designation": "Instructor II",
			"Email": "mylene_sangines@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. NOEMIE DC. BUNYE",
			"Designation": "Assistant Professor I",
			"Email": "noemie_bunye@tup.edu.ph"
		},
		{
			"Name": "MR. PAUL MARK C. ANDRES",
			"Designation": "Instructor I",
			"Email": "paulmark_andres@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. PAULO MANUEL L. MACAPAGAL",
			"Designation": "Assistant Professor I",
			"Email": "paulomanuel_macapagal@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. RHODORA DC. ENRIQUEZ",
			"Designation": "Assistant Professor II",
			"Email": "rhodora_enriquez@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. RITA G. AGUDON",
			"Designation": "Assistant Professor II",
			"Email": "rita_agudon@tup.edu.ph"
		},
		{
			"Name": "MR. ROLITO E. BACALSO",
			"Designation": "Instructor I",
			"Email": "rolito_bacalso@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. ROSELIE F. GALIGA",
			"Designation": "Associate Professor V",
			"Email": "roselie_galiga@tup.edu.ph"
		},
		{
			"Name": "DR. ROSEMARIE THERESA M. CRUZ",
			"Designation": "Professor II",
			"Email": "rosemarie_cruz@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "cit_department_basicindustrialtech",
		"patterns": [
		"Who are the faculty members in the Basic Industrial Technology Department?",
		"Can you provide information about the faculty of the Basic Industrial Technology Department?",
		"I want to know about the faculty members in the Basic Industrial Technology Department.",
		"Who teaches in the Basic Industrial Technology Department?",
		"Tell me about the instructors in the Basic Industrial Technology Department.",
		"What are the names of the faculty members in the Basic Industrial Technology Department?",
		"Which professors are part of the Basic Industrial Technology Department?",
		"Give me details about the faculty in the Basic Industrial Technology Department.",
		"I'm interested in the faculty of the Basic Industrial Technology Department. Can you help?",
		"Could you list the faculty members in the Basic Industrial Technology Department?",
		"Who are the instructors teaching in the Basic Industrial Technology Department?",
		"I need information about the Basic Industrial Technology Department faculty members.",
		"What are the names of the professors in the Basic Industrial Technology Department?",
		"Can you tell me about the Basic Industrial Technology Department faculty?",
		"Provide details about the faculty members in the Basic Industrial Technology Department."
		],
		"responses": [[
		{
			"Name": "ASSOC. PROF. ADRIAN U. BRAA",
			"Designation": "Associate Professor IV",
			"Email": "adrian_brana@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. ALEJANDRO C. OCAMPO",
			"Designation": "Assistant Professor I",
			"Email": "alejandro_ocampo@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. ANDREW JOHN J. MABAQUIAO",
			"Designation": "Associate Professor II",
			"Email": "andrewjohn_mabaquiao@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. JOSE JR. C. DELOS SANTOS",
			"Designation": "Associate Professor III",
			"Email": "josejr_delossantos@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. ROSSINNI P. UNABIA",
			"Designation": "Assistant Professor III",
			"Email": "rossinni_unabia@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "cit_department_civilengtech",
		"patterns": [
		"Who are the faculty members in the Civil Engineering Technology Department?",
		"Can you provide information about the faculty of the Civil Engineering Technology Department?",
		"I want to know about the faculty members in the Civil Engineering Technology Department.",
		"Who teaches in the Civil Engineering Technology Department?",
		"Tell me about the instructors in the Civil Engineering Technology Department.",
		"What are the names of the faculty members in the Civil Engineering Technology Department?",
		"Which professors are part of the Civil Engineering Technology Department?",
		"Give me details about the faculty in the Civil Engineering Technology Department.",
		"I'm interested in the faculty of the Civil Engineering Technology Department. Can you help?",
		"Could you list the faculty members in the Civil Engineering Technology Department?",
		"Who are the instructors teaching in the Civil Engineering Technology Department?",
		"I need information about the Civil Engineering Technology Department faculty members.",
		"What are the names of the professors in the Civil Engineering Technology Department?",
		"Can you tell me about the Civil Engineering Technology Department faculty?",
		"Provide details about the faculty members in the Civil Engineering Technology Department."
		],
		"responses": [[
		{
			"Name": "ASST. PROF. ARIEL A. DELA CRUZ",
			"Designation": "Assistant Professor IV",
			"Email": "ariel_delacruz@tup.edu.ph"
		},
		{
			"Name": "MR. ARIEL B. MORALES",
			"Designation": "Instructor I",
			"Email": "ariel_morales@tup.edu.ph"
		},
		{
			"Name": "MS. CHARLENE F. RICOPUERTO",
			"Designation": "Instructor I",
			"Email": "charlene_ricopuerto@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. EDMUNDO JR. E. NICOLAS",
			"Designation": "Associate Professor I",
			"Email": "edmundonjr_nicolas@tup.edu.ph"
		},
		{
			"Name": "MS. JANILYN D. SIY",
			"Designation": "Instructor I",
			"Email": "janilyn_siy@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. PROSPERO C. CABORNAY",
			"Designation": "Assistant Professor I",
			"Email": "prospero_cabornay@tup.edu.ph"
		},
		{
			"Name": "MR. RIGIE S. NUJALDA",
			"Designation": "Instructor I",
			"Email": "rigie_nujalda@tup.edu.ph"
		},
		{
			"Name": "MR. ROMEO A. DAVID",
			"Designation": "Instructor II",
			"Email": "romeo_david@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. SAMUEL M. PACBA",
			"Designation": "Assistant Professor III",
			"Email": "samuel_pacba@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "cit_department_electricalengtech",
		"patterns": [
		"Who are the faculty members in the Electrical Engineering Technology Department?",
		"Can you provide information about the faculty of the Electrical Engineering Technology Department?",
		"I want to know about the faculty members in the Electrical Engineering Technology Department.",
		"Who teaches in the Electrical Engineering Technology Department?",
		"Tell me about the instructors in the Electrical Engineering Technology Department.",
		"What are the names of the faculty members in the Electrical Engineering Technology Department?",
		"Which professors are part of the Electrical Engineering Technology Department?",
		"Give me details about the faculty in the Electrical Engineering Technology Department.",
		"I'm interested in the faculty of the Electrical Engineering Technology Department. Can you help?",
		"Could you list the faculty members in the Electrical Engineering Technology Department?",
		"Who are the instructors teaching in the Electrical Engineering Technology Department?",
		"I need information about the Electrical Engineering Technology Department faculty members.",
		"What are the names of the professors in the Electrical Engineering Technology Department?",
		"Can you tell me about the Electrical Engineering Technology Department faculty?",
		"Provide details about the faculty members in the Electrical Engineering Technology Department."
		],
		"responses": [[
		{
			"Name": "MR. CARLO JAY G. DELIZO",
			"Designation": "Instructor I",
			"Email": "carlojay_delizo@tup.edu.ph"
		},
		{
			"Name": "MR. CARLOS ANGELITO D. MORALES",
			"Designation": "Instructor II",
			"Email": "carlosangelito_morales@tup.edu.ph"
		},
		{
			"Name": "MS. CHRISTIAN LAWRENCE. HOFILEA",
			"Designation": "Instructor I",
			"Email": "christianlawrence_hofilea@tup.edu.ph"
		},
		{
			"Name": "DR. CONNIE C. AUNARIO",
			"Designation": "Associate Professor V",
			"Email": "connie_aunario@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. GHAZALI ILLUMINADA R. SISON",
			"Designation": "Associate Professor V",
			"Email": "ghazaliilluminada_sison@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. HERONAFINE C. DE GUZMAN",
			"Designation": "Associate Professor IV",
			"Email": "heronafine_deguzman@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. JENNIFER D. ANDADOR",
			"Designation": "Associate Professor II",
			"Email": "jennifer_andador@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. JULIUS G. GARCIA",
			"Designation": "Associate Professor III",
			"Email": "julius_garcia@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. MARIEZOL V. BALLESTEROS",
			"Designation": "Associate Professor II",
			"Email": "mariezol_ballesteros@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. ROLANDO R. MARTIN",
			"Designation": "Associate Professor I",
			"Email": "rolando_martin@tup.edu.ph"
		},
		{
			"Name": "MR. ROMMEL F. AUNARIO",
			"Designation": "Instructor I",
			"Email": "rommelf_aunario@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. RONNIE B. DE GUZMAN",
			"Designation": "Associate Professor I",
			"Email": "ronnie_deguzman@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. SHERLIE D. BUNAG",
			"Designation": "Assistant Professor II",
			"Email": "sherlie_bunag@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. TERESITA C. NORA",
			"Designation": "Associate Professor IV",
			"Email": "teresita_nora@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. VENERANDO A. SISON",
			"Designation": "Associate Professor V",
			"Email": "venerando_sison@tup.edu.ph"
		},
		{
			"Name": "MR. WEELLRR D. MARTIN",
			"Designation": "Instructor I",
			"Email": "weellrr_martin@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "cit_department_electronicsengtech",
		"patterns": [
		"Who are the faculty members in the Electronics Engineering Technology Department?",
		"Can you provide information about the faculty of the Electronics Engineering Technology Department?",
		"I want to know about the faculty members in the Electronics Engineering Technology Department.",
		"Who teaches in the Electronics Engineering Technology Department?",
		"Tell me about the instructors in the Electronics Engineering Technology Department.",
		"What are the names of the faculty members in the Electronics Engineering Technology Department?",
		"Which professors are part of the Electronics Engineering Technology Department?",
		"Give me details about the faculty in the Electronics Engineering Technology Department.",
		"I'm interested in the faculty of the Electronics Engineering Technology Department. Can you help?",
		"Could you list the faculty members in the Electronics Engineering Technology Department?",
		"Who are the instructors teaching in the Electronics Engineering Technology Department?",
		"I need information about the Electronics Engineering Technology Department faculty members.",
		"What are the names of the professors in the Electronics Engineering Technology Department?",
		"Can you tell me about the Electronics Engineering Technology Department faculty?",
		"Provide details about the faculty members in the Electronics Engineering Technology Department."
		],
		"responses": [[
		{
			"Name": "ASST. PROF. AIMEE G. ACOBA",
			"Designation": "Assistant Professor I",
			"Email": "aimee_acoba@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. ALESSANDRO T. PETRACHE",
			"Designation": "Assistant Professor III",
			"Email": "alessandro_petrache@tup.edu.ph"
		},
		{
			"Name": "MR. ALLIE B. VILLANUEVA",
			"Designation": "Instructor II",
			"Email": "allie_villanueva@tup.edu.ph"
		},
		{
			"Name": "MR. DENNIS J. TABUCOL",
			"Designation": "Instructor I",
			"Email": "dennis_tabucol@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. ELVIN T. BALAIS",
			"Designation": "Assistant Professor II",
			"Email": "elvin_balais@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. FERNANDO O. DE LARA",
			"Designation": "Assistant Professor I",
			"Email": "fernando_delara@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. GEMMA D. BELGA",
			"Designation": "Associate Professor V",
			"Email": "gemma_belga@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. GENEROSA G. TONGOL",
			"Designation": "Associate Professor V",
			"Email": "generosa_tongol@tup.edu.ph"
		},
		{
			"Name": "MS. HILDA V. ROBINO",
			"Designation": "Instructor I",
			"Email": "hilda_robino@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. JONEL R. MACALISANG",
			"Designation": "Assistant Professor I",
			"Email": "jonel_macalisang@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. JUANITO F. MANALANG",
			"Designation": "Associate Professor I",
			"Email": "juanito_manalang@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. KAREN K. FORONDA",
			"Designation": "Associate Professor I",
			"Email": "karen_foronda@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. LOUIE V. SORIANO",
			"Designation": "Associate Professor III",
			"Email": "louie_soriano@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. MA. IAN P. DE LOS TRINOS",
			"Designation": "Associate Professor V",
			"Email": "maian_delostrinos@tup.edu.ph"
		},
		{
			"Name": "MR. MARC ARDIE V. ARDIENTE",
			"Designation": "Instructor I",
			"Email": "marcardie_ardiente@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. MARIBELLE R. JUALAYBA",
			"Designation": "Associate Professor II",
			"Email": "maribelle_jualayba@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. MARY JANE A. CONCEPCION",
			"Designation": "Assistant Professor IV",
			"Email": "maryjane_concepcion@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. MICHAEL L. NARISMA",
			"Designation": "Assistant Professor IV",
			"Email": "michael_narisma@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. MICHAEL T. SAMONTE",
			"Designation": "Assistant Professor II",
			"Email": "michael_samonte@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. MINABELLE D. VILLAFUERTE",
			"Designation": "Associate Professor IV",
			"Email": "minabelle_villafuerte@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. NOEL B. DE ASIS",
			"Designation": "Associate Professor V",
			"Email": "noel_deasis@tup.edu.ph"
		},
		{
			"Name": "DR. RALPH SHERWIN A. CORPUZ",
			"Designation": "Professor III",
			"Email": "ralphsherwin_corpuz@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. ROMAN III C. FELIX",
			"Designation": "Associate Professor II",
			"Email": "roman_felix@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. RONA RIZA C. GONZALES",
			"Designation": "Assistant Professor III",
			"Email": "ronariza_gonzales@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. RONALD L. QUITAIN",
			"Designation": "Assistant Professor IV",
			"Email": "ronald_quitain@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. TRISTAN R. MOPAS",
			"Designation": "Assistant Professor IV",
			"Email": "tristan_mopas@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. VICENTE E. ESTEMBER",
			"Designation": "Assistant Professor III",
			"Email": "vicente_estember@tup.edu.ph"
		},
		{
			"Name": "MR. WENDY A. ANAS",
			"Designation": "Instructor I",
			"Email": "wendy_anas@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "cit_department_foodtech",
		"patterns": [
		"Who are the faculty members in the Food and Apparel Technology Department?",
		"Can you provide information about the faculty of the Food and Apparel Technology Department?",
		"I want to know about the faculty members in the Food and Apparel Technology Department.",
		"Who teaches in the Food and Apparel Technology Department?",
		"Tell me about the instructors in the Food and Apparel Technology Department.",
		"What are the names of the faculty members in the Food and Apparel Technology Department?",
		"Which professors are part of the Food and Apparel Technology Department?",
		"Give me details about the faculty in the Food and Apparel Technology Department.",
		"I'm interested in the faculty of the Food and Apparel Technology Department. Can you help?",
		"Could you list the faculty members in the Food and Apparel Technology Department?",
		"Who are the instructors teaching in the Food and Apparel Technology Department?",
		"I need information about the Food and Apparel Technology Department faculty members.",
		"What are the names of the professors in the Food and Apparel Technology Department?",
		"Can you tell me about the Food and Apparel Technology Department faculty?",
		"Provide details about the faculty members in the Food and Apparel Technology Department."
		],
		"responses": [[
		{
			"Name": "ASSOC. PROF. ANNALYN N. GEBE",
			"Designation": "Associate Professor II",
			"Email": "annalyn_gebe@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. BERNADETH B. GILBOR",
			"Designation": "Associate Professor I",
			"Email": "bernadeth_gilbor@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. JENINA D. MANABAT",
			"Designation": "Assistant Professor III",
			"Email": "jenina_manabat@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. JENNIFER P. SONEJA",
			"Designation": "Associate Professor II",
			"Email": "jennifer_soneja@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. JESS P. ADAYA",
			"Designation": "Assistant Professor II",
			"Email": "jess_adaya@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. JHOMALYN A. MARTELINO",
			"Designation": "Associate Professor I",
			"Email": "jhomalyn_martelino@tup.edu.ph"
		},
		{
			"Name": "MR. JONATHAN C. DOMINGO",
			"Designation": "Instructor I",
			"Email": "jonathan_domingo@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. JOVEBLESS D. DAVE",
			"Designation": "Associate Professor I",
			"Email": "jovebless_dave@tup.edu.ph"
		},
		{
			"Name": "MS. MA. DINA D. JIMENEZ",
			"Designation": "Instructor I",
			"Email": "madina_jimenez@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. MARIE VIRNA I. VILLANUEVA",
			"Designation": "Associate Professor I",
			"Email": "marievirna_villanueva@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. MERRYL J. FLORANO",
			"Designation": "Assistant Professor III",
			"Email": "merryl_florano@tup.edu.ph"
		},
		{
			"Name": "MS. NIELIZA T. BERISO",
			"Designation": "Instructor I",
			"Email": "nieliza_beriso@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. ROSE DE BETH A. DE GUZMAN",
			"Designation": "Associate Professor I",
			"Email": "rosedebeth_deguzman@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. VERONICA M. DELA ROSA",
			"Designation": "Assistant Professor III",
			"Email": "veronica_delarosa@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "cit_department_graphicsandprinttech",
		"patterns": [
		"Who are the faculty members in the Graphic Arts and Printing Technology Department?",
		"Can you provide information about the faculty in the Graphic Arts and Printing Technology Department?",
		"I want to know about the faculty members in the Graphic Arts and Printing Technology Department.",
		"Who teaches in the Graphic Arts and Printing Technology Department?",
		"Tell me about the instructors in the Graphic Arts and Printing Technology Department.",
		"What are the names of the faculty members in the Graphic Arts and Printing Technology Department?",
		"Which professors are part of the Graphic Arts and Printing Technology Department?",
		"Give me details about the faculty in the Graphic Arts and Printing Technology Department.",
		"I'm interested in the faculty of the Graphic Arts and Printing Technology Department. Can you help?",
		"Could you list the faculty members in the Graphic Arts and Printing Technology Department?",
		"Who are the instructors teaching in the Graphic Arts and Printing Technology Department?",
		"I need information about the Graphic Arts and Printing Technology Department faculty members.",
		"What are the names of the professors in the Graphic Arts and Printing Technology Department?",
		"Can you tell me about the Graphic Arts and Printing Technology Department faculty?",
		"Provide details about the faculty members in the Graphic Arts and Printing Technology Department."
		],
		"responses": [[
		{
			"Name": "ASSOC. PROF. ALEXANDER M. MARFIL",
			"Designation": "Associate Professor I",
			"Email": "alexander_marfil@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. LOTIS P. BUCO",
			"Designation": "Assistant Professor II",
			"Email": "lotis_buco@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. MARCO G. DEVANADERA",
			"Designation": "Associate Professor III",
			"Email": "marco_devanadera@tup.edu.ph"
		},
		{
			"Name": "MR. MARK ANTHONY L. DECANO",
			"Designation": "Instructor I",
			"Email": "markanthony_decano@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. NOEL D. BULAWAN",
			"Designation": "Associate Professor V",
			"Email": "noel_bulawan@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. RELINDA C. VIENS",
			"Designation": "Assistant Professor III",
			"Email": "relinda_viens@tup.edu.ph"
		}
		]]
	},

	{
		"tag": "cit_department_mechengtech",
		"patterns": [
		"Who are the faculty members in the Mechanical Engineering Technology Department?",
		"Can you provide information about the faculty in the Mechanical Engineering Technology Department?",
		"I want to know about the faculty members in the Mechanical Engineering Technology Department.",
		"Who teaches in the Mechanical Engineering Technology Department?",
		"Tell me about the instructors in the Mechanical Engineering Technology Department.",
		"What are the names of the faculty members in the Mechanical Engineering Technology Department?",
		"Which professors are part of the Mechanical Engineering Technology Department?",
		"Give me details about the faculty in the Mechanical Engineering Technology Department.",
		"I'm interested in the faculty of the Mechanical Engineering Technology Department. Can you help?",
		"Could you list the faculty members in the Mechanical Engineering Technology Department?",
		"Who are the instructors teaching in the Mechanical Engineering Technology Department?",
		"I need information about the Mechanical Engineering Technology Department faculty members.",
		"What are the names of the professors in the Mechanical Engineering Technology Department?",
		"Can you tell me about the Mechanical Engineering Technology Department faculty?",
		"Provide details about the faculty members in the Mechanical Engineering Technology Department."
		],
		"responses": [[
		{
			"Name": "MS. DAVID C. REYES",
			"Designation": "Instructor I",
			"Email": "david_reyes@tup.edu.ph"
		},
		{
			"Name": "MR. DHENIL T. MANGUBAT",
			"Designation": "Instructor I",
			"Email": "dhenil_mangubat@tup.edu.ph"
		},
		{
			"Name": "MR. EARL JOSHUA C. ARAEZ",
			"Designation": "Instructor I",
			"Email": "earljoshua_aranez@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. ELPIDIO S. VIRREY",
			"Designation": "Associate Professor V",
			"Email": "elpidio_virrey@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. JERRY G. LIGAYA",
			"Designation": "Associate Professor II",
			"Email": "jerry_ligaya@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. JOHNNY B. MATERUM",
			"Designation": "Associate Professor V",
			"Email": "johnny_materum@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. JOSEPHINE N. ALDEN",
			"Designation": "Assistant Professor I",
			"Email": "josephine_alden@tup.edu.ph"
		},
		{
			"Name": "MR. LEO R. PRIVADO",
			"Designation": "Instructor I",
			"Email": "leo_privado@tup.edu.ph"
		},
		{
			"Name": "ASST. PROF. MARCELINO JR. C. COTELO",
			"Designation": "Assistant Professor I",
			"Email": "marcelino_cotelo@tup.edu.ph"
		},
		{
			"Name": "DR. MAY ANN R. CODERA",
			"Designation": "Associate Professor V",
			"Email": "mayann_codera@tup.edu.ph"
		},
		{
			"Name": "MR. REYNALDO JR. S. LADINES",
			"Designation": "Instructor III",
			"Email": "reynaldo_ladines@tup.edu.ph"
		},
		{
			"Name": "ASSOC. PROF. RUEL B. AGGABAO",
			"Designation": "Associate Professor V",
			"Email": "ruel_aggabao@tup.edu.ph"
		}
		]]
	},
	{
		"tag": "cit_department_powerplanttech",
		"patterns": [
            "Who are the faculty members in the Power Plant Engineering Technology Department?",
            "Can you provide information about the faculty in the Power Plant Engineering Technology Department?",
            "I want to know about the faculty members in the Power Plant Engineering Technology Department.",
            "Who teaches in the Power Plant Engineering Technology Department?",
            "Tell me about the instructors in the Power Plant Engineering Technology Department.",
            "What are the names of the faculty members in the Power Plant Engineering Technology Department?",
            "Which professors are part of the Power Plant Engineering Technology Department?",
            "Give me details about the faculty in the Power Plant Engineering Technology Department.",
            "I'm interested in the faculty of the Power Plant Engineering Technology Department. Can you help?",
            "Could you list the faculty members in the Power Plant Engineering Technology Department?",
            "Who are the instructors teaching in the Power Plant Engineering Technology Department?",
            "I need information about the Power Plant Engineering Technology Department faculty members.",
            "What are the names of the professors in the Power Plant Engineering Technology Department?",
            "Can you tell me about the Power Plant Engineering Technology Department faculty?",
            "Provide details about the faculty members in the Power Plant Engineering Technology Department."
		],
		"responses": [[
			{
			"Name": "ASSOC. PROF. BILOMAR N. FLORESCA",
			"Designation": "Associate Professor V",
			"Email": "bilomar_floresca@tup.edu.ph"
			},
			{
			"Name": "MR. CHURCHIL B. MALASIG",
			"Designation": "Instructor I",
			"Email": "churchil_malasig@tup.edu.ph"
			},
			{
			"Name": "MR. JOSHUA G. JUMALON",
			"Designation": "Instructor I",
			"Email": "joshua_jumalon@tup.edu.ph"
			},
			{
			"Name": "MS. MARY JANE T. CALAHI",
			"Designation": "Instructor I",
			"Email": "maryjane_calahi@tup.edu.ph"
			},
			{
			"Name": "MR. RICKILINO L. AREGLADO",
			"Designation": "Instructor I",
			"Email": "rickilino_areglado@tup.edu.ph"
			}
		]]
	},
	{
		"tag": "redirection_manilacampuslink",
		"patterns": [
		"Can you provide information about TUP Manila?",
		"What can you tell me about TUP Manila?",
		"I want to know more about TUP Manila.",
		"Tell me about the Manila campus of TUP.",
		"What are the facilities available at TUP Manila?",
		"Give me details about TUP Manila.",
		"I need information on TUP Manila.",
		"Could you redirect me to TUP Manila's website?",
		"Can you give me the link to TUP Manila's website?",
		"I'm interested in TUP Manila. Where can I find more?",
		"Where can I learn about TUP Manila?",
		"I want to visit TUP Manila's website. How do I get there?",
		"Provide me with the link to TUP Manila's website.",
		"How can I access TUP Manila's online resources?",
		"Redirect me to TUP Manila's official website."
		],
		"responses": [
		"Sure! Here is the link to TUP Manila's website: https://www.tup.edu.ph/"
		]
	},
	{
		"tag": "redirection_taguigcampuslink",
		"patterns": [
		"Can you provide information about TUP Taguig?",
		"What can you tell me about TUP Taguig?",
		"I want to know more about TUP Taguig.",
		"Tell me about the Taguig campus of TUP.",
		"What are the facilities available at TUP Taguig?",
		"Give me details about TUP Taguig.",
		"I need information on TUP Taguig.",
		"Could you redirect me to TUP Taguig's website?",
		"Can you give me the link to TUP Taguig's website?",
		"I'm interested in TUP Taguig. Where can I find more?",
		"Where can I learn about TUP Taguig?",
		"I want to visit TUP Taguig's website. How do I get there?",
		"Provide me with the link to TUP Taguig's website.",
		"How can I access TUP Taguig's online resources?",
		"Redirect me to TUP Taguig's official website."
		],
		"responses": [
		"Sure! Here is the link to TUP Taguig's website: https://www.tupcavite.edu.ph/"
		]
	},
	{
		"tag": "redirection_cavitecampuslink",
		"patterns": [
		"Can you provide information about TUP Cavite?",
		"What can you tell me about TUP Cavite?",
		"I want to know more about TUP Cavite.",
		"Tell me about the Cavite campus of TUP.",
		"What are the facilities available at TUP Cavite?",
		"Give me details about TUP Cavite.",
		"I need information on TUP Cavite.",
		"Could you redirect me to TUP Cavite's website?",
		"Can you give me the link to TUP Cavite's website?",
		"I'm interested in TUP Cavite. Where can I find more?",
		"Where can I learn about TUP Cavite?",
		"I want to visit TUP Cavite's website. How do I get there?",
		"Provide me with the link to TUP Cavite's website.",
		"How can I access TUP Cavite's online resources?",
		"Redirect me to TUP Cavite's official website."
		],
		"responses": [
		"Sure! Here is the link to TUP Cavite's website: https://tupt.edu.ph/"
		]
	},
	{
		"tag": "redirection_visayascampuslink",
		"patterns": [
		"Can you provide information about TUP Visayas?",
		"What can you tell me about TUP Visayas?",
		"I want to know more about TUP Visayas.",
		"Tell me about the Visayas campus of TUP.",
		"What are the facilities available at TUP Visayas?",
		"Give me details about TUP Visayas.",
		"I need information on TUP Visayas.",
		"Could you redirect me to TUP Visayas' website?",
		"Can you give me the link to TUP Visayas' website?",
		"I'm interested in TUP Visayas. Where can I find more?",
		"Where can I learn about TUP Visayas?",
		"I want to visit TUP Visayas' website. How do I get there?",
		"Provide me with the link to TUP Visayas' website.",
		"How can I access TUP Visayas' online resources?",
		"Redirect me to TUP Visayas' official website."
		],
		"responses": [
		"Sure! Here is the link to TUP Visayas' website: https://tupvisayas.edu.ph/"
		]
	},
	{
	"tag": "redirection_serviceslinks",
	"patterns": [
		"How can I access the Student Applicant ERS?",
		"I want to apply as a student. Where can I find the application portal?",
		"What is the link for Student ERS?",
		"Where can I check my student records?",
		"How do I access the Faculty ERS?",
		"Is there an online portal for faculty members?",
		"Where can I find bidding opportunities?",
		"How can I access the procurement section?",
		"What courses does TUP Manila offer?",
		"Can you provide the list of undergraduate programs?",
		"Where can I find information about the courses offered?",
		"What is the Transparency Seal link?",
		"Where can I find TUP Manila's transparency initiatives?",
		"What initiatives are included in the Transparency Seal?",
		"Is there a link to TUP Manila's Transparency Seal?"
	],
	"responses": [
		"Sure! Here are the links to TUP Manila's online services: \n\nStudent Applicant ERS: [Student Applicant ERS](https://ers.tup.edu.ph/aims/applicants/) \nStudent ERS: [Student ERS](https://ers.tup.edu.ph/aims/students/) \nFaculty ERS: [Faculty ERS](https://ers.tup.edu.ph/aims/faculty/) \nBids Opportunity: [Bids Opportunity](https://tup.edu.ph/procurement) \nCourses Offered: [Courses Offered](https://tup.edu.ph/undergraduate/admission/undergraduate-programs) \nTransparency Seal: [Transparency Seal](https://tup.edu.ph/transparency-seal)"
	]
	},
	{
	"tag": "redirection_presidentupdates",
	"patterns": [
		"Where can I find the latest updates from TUP Manila's President?",
		"Is there any news about TUP Manila's President?",
		"What's the latest story from TUP Manila's President?",
		"I want to read the latest article from TUP Manila's President.",
		"Do you have any information about TUP Manila's President?",
		"Can you share any updates from TUP Manila's President?",
		"Where can I find the 'And kwento ni Prez' section?",
		"How do I access the stories from TUP Manila's President?",
		"I'm interested in the President's stories. Where should I look?",
		"Is there a section dedicated to TUP Manila's President's stories?",
		"What's happening with TUP Manila's President lately?",
		"I heard there's an interesting story about TUP Manila's President. Where can I find it?",
		"Can you provide the link to President Ramos with US Ambassador MaryKay L. Carlson's dinner story?",
		"Where can I find the story about President Ramos and US Ambassador MaryKay L. Carlson?",
		"I want to read about the dinner with US Ambassador MaryKay L. Carlson. Where should I go?",
		"What's the link to the article about President Ramos with US Ambassador MaryKay L. Carlson?"
	],
	"responses": [
		"Sure! Here's the link to 'And kwento ni Prez: President Ramos with US Ambassador MaryKay L. Carlson at a dinner in U.S. Ambassadors Residence': [President Ramos with US Ambassador MaryKay L. Carlson at a dinner in U.S. Ambassadors Residence](https://tup.edu.ph/president/corner/2023/08/president-ramos-with-us-ambassador-marykay-l-carlson-at-a-dinner-in-us-ambassadors-residence)"
	]
},
{
	"tag": "studenthandbook",
	"patterns": [
		"Can you provide me with the TUP student handbook link?",
		"How do I apply for a university ID?",
		"What should I do if I lose my student ID?",
		"How are student ID cards validated?",
		"What are the rules regarding school uniforms?",
		"How can I claim insurance benefits?",
		"How can I apply for the Student Assistanceship Program?",
		"How can students address their mails to TUP?",
		"What are the rules on student conduct and discipline?",
		"What is the Student Privilege Fee?",
		"What are the accreditation requirements for student clubs?",
		"What does the Student Life Development unit undertake?",
		"What are the effects of pending disciplinary cases?",
		"What rights do students have in disciplinary cases?",
		"How are disciplinary cases handled?"
	],
	"responses": [
		"Sure! Here is the link for the TUP Student Handbook for additional information: [TUP Student Handbook](https://tup.edu.ph/pages/students/tup-student-handbook)"
	]
	},
	{
	"tag": "school_news",
	"patterns": [
		"Can you give me the latest school news?",
		"What's happening in the school recently?",
		"I want to know about the recent news from the school.",
		"Tell me about any updates or news from the school.",
		"Give me information about the latest events in the school.",
		"Is there any important news from the school?",
		"I'm interested in reading the school news.",
		"Where can I find the latest news from the school?",
		"What's new at the school?",
		"I want to stay updated with the school's news. How can I do that?",
		"Could you provide me with the recent school news?",
		"Tell me about any announcements or news from the school.",
		"What's the buzz around the school lately?",
		"Give me updates on the school's activities and events.",
		"Where can I read about the school's recent developments?"
	],
	"responses": [
		"Sure! You can access the school news through this link [School News](https://tup.edu.ph/news)"
	]
	},
	{
	"tag": "assessmentoffees_link",
	"patterns": [
		"Where can I find information about the assessment of fees?",
		"How do I check the assessment of fees?",
		"I need to know about the fees assessment process.",
		"Where is the link to assess my fees?",
		"Can you provide me with the assessment of fees link?",
		"Is there a document outlining the assessment of fees?",
		"How can I get details about my fees assessment?",
		"Do you have information about fee assessment?",
		"Where should I go to view the assessment of fees?",
		"What's the link to the assessment of fees?",
		"I'm looking for information about my fees. Can you help?",
		"Where can I find details about TUP's fees?",
		"How can I access the breakdown of my fees?",
		"Is there a document explaining TUP's fees assessment?",
		"I want to review the assessment of fees for this semester."
	],
	"responses": [
		"Sure! Here's the link to the assessment of fees: [Assessment of Fees](https://tup.edu.ph/pages/students/assessment-of-fees)"
	]
	},
	{
	"tag": "studentprivileges_link",
	"patterns": [
		"Where can I find information about student privileges?",
		"What are the privileges available to TUP students?",
		"I want to know about the privileges for TUP students.",
		"Where is the link to view student privileges?",
		"Can you provide me with the student privileges link?",
		"Is there a document outlining student privileges?",
		"How can I learn about student privileges at TUP?",
		"Do you have information about privileges for students?",
		"Where should I go to check student privileges?",
		"What's the link to the page about student privileges?",
		"I'm interested in student privileges. Can you help?",
		"Where can I find details about privileges for TUP students?",
		"How can I access the list of student privileges?",
		"Is there a document explaining TUP's student privileges?",
		"I want to know more about the privileges I have as a TUP student."
	],
	"responses": [
		"Sure! Here's the link to the Student Privileges page: [Student Privileges](https://tup.edu.ph/pages/students/student-privileges)"
	]
	},
	{
	"tag": "studentscholarship_link",
	"patterns": [
		"Can you provide information about student scholarships at TUP Manila?",
		"What kind of scholarships does TUP Manila offer to students?",
		"I want to know more about scholarships available at TUP Manila.",
		"Where can I find details about student scholarships at TUP Manila?",
		"Can you tell me about the scholarship opportunities for TUP Manila students?",
		"How do students qualify for scholarships at TUP Manila?",
		"What scholarships are available for students with exemplary academic achievements at TUP Manila?",
		"Do you have information on athletic scholarships at TUP Manila?",
		"Where can I learn about scholarships awarded by communities, companies, and NGOs at TUP Manila?",
		"What was the scholarship distribution among TUP campuses in 2006?",
		"Can you tell me about the competitive and non-competitive scholarships offered at TUP Manila?",
		"How many students received scholarship grants in 2006 at TUP Manila?",
		"What percentage of scholarship recipients passed the examinations for competitive scholarships in 2006 at TUP Manila?",
		"What percentage of scholarship recipients received financial support for non-competitive scholarships in 2006 at TUP Manila?",
		"Is there a breakdown of scholarship recipients by campus at TUP Manila?"
	],
	"responses": [
		"Sure! Here's the link to information about student scholarships at TUP Manila: [Student Scholarships](https://tup.edu.ph/pages/students/student-scholarship)"
	]
	},
	{
	"tag": "applicationscholarship_link",
	"patterns": [
		"How do I apply for a scholarship at TUP Manila?",
		"Where can I find information about applying for scholarships at TUP Manila?",
		"I want to apply for a scholarship. What should I do?",
		"Can you guide me through the process of applying for scholarships at TUP Manila?",
		"What are the steps to apply for a scholarship at TUP Manila?",
		"Is there a link to apply for scholarships at TUP Manila?",
		"How can I access the scholarship application form for TUP Manila?",
		"Where should I go to submit my scholarship application at TUP Manila?",
		"Do you have information about scholarship privileges upon enrollment at TUP Manila?",
		"What documents do I need to submit for scholarship notation at TUP Manila?",
		"Can you provide details about scholarship requirements for new students at TUP Manila?",
		"What are the requirements for higher year students to apply for scholarships at TUP Manila?",
		"I need information about applying for scholarships at TUP Manila for new students.",
		"Where can I find the checklist of requirements for scholarship application at TUP Manila?",
		"Is there a specific process for applying for scholarships at TUP Manila?"
	],
	"responses": [
		"Sure! Here's the link to apply for a scholarship at TUP Manila: [Apply for Scholarship](https://tup.edu.ph/pages/students/apply-for-scholarship)\n\n**SCHOLARSHIP PRIVILEGES UPON ENROLLMENT**\nFor students availing the following scholarships, the following documents must first be submitted to the Office of Student Affairs (OSA) for scholarship notation before assessment of fees.\n1. Entering Honor Student (Valedictorian/Salutatorian)\n Certification\n Graduation Program\n2. Barangay Grant or dependent of Barangay Officials\n Certification of Oath of Office (DILG & Mayor)\n Affidavit of Support\n Income Tax Return of Barangay Official\n Birth Certificate\n3. Sangguniang Kabataan (within the NCR only)\n Certification of Oath of Office (DILG & Mayor)\n\n**SCHOLARSHIP REQUIREMENTS**\n1. For new students\n Photocopy of High School Card\n Certification of Good Moral Character\n Photocopy of Income Tax Return of Parents/Guardian/Affiadavit/Certificate of Non-filing\n Birth Certificate\n 1 1/2\" x 1 1/2\" Picture\n\n2. For higher year\n Original/photocopy of checklist/class cards\n Photocopy of Income Tax Return of Parents/Guardian/Affidavit/Certicate of Non-filing\n 1 1/2\" x 1 1/2\" Picture"
	]
	},
	{
	"tag": "osa_link",
	"patterns": [
		"Where can I find information about The Office of Student Affairs at TUP Manila?",
		"What does The Office of Student Affairs (OSA) at TUP Manila do?",
		"Can you provide details about The Office of Student Affairs (OSA) at TUP Manila?",
		"I want to know more about The Office of Student Affairs at TUP Manila.",
		"What services does The Office of Student Affairs (OSA) offer to students at TUP Manila?",
		"How can The Office of Student Affairs (OSA) help me as a student at TUP Manila?",
		"Where can I find programs offered by The Office of Student Affairs at TUP Manila?",
		"What are the responsibilities of The Office of Student Affairs (OSA) at TUP Manila?",
		"Is there a link to The Office of Student Affairs (OSA) webpage for TUP Manila?",
		"I need information about The Office of Student Affairs (OSA) services at TUP Manila.",
		"Can you tell me about the functions of The Office of Student Affairs (OSA) at TUP Manila?",
		"What programs are available for student development at TUP Manila?",
		"How can I contact The Office of Student Affairs (OSA) at TUP Manila?",
		"Is there a list of services provided by The Office of Student Affairs (OSA) at TUP Manila?",
		"Where can I find The Office of Student Affairs (OSA) at TUP Manila on campus?"
	],
	"responses": [
		"Sure! Here's the link to The Office of Student Affairs (OSA) at TUP Manila: [The Office of Student Affairs](https://tup.edu.ph/pages/students/office-of-student-affairs)\n\n**THE OFFICE OF STUDENT AFFAIRS**\nThe Office of Student Affairs (OSA) is the primary frontline office of the University with the students. The OSA oversees the implementation of policies that support the academic pursuits and total development of students. Likewise, it takes care of the different aspects of a healthy and productive student life outside of the home of every student. Student development as process education is bounded through \"out-of-class\" activities. These activities are specifically designed for the holistic development of the students; fostering optimal growth; accommodating individual differences and responding to the psycho-social needs of students. Social learning experiences are carried through carefully selected curricular and extra- curricular activities. Driven likewise by the desire to promote the well being students, the office fosters a nurturing environment where values and character formation is the core concern.\n\n**PROGRAMS FOR DEVELOPMENT**\nFour (4) Key Areas of Concern:\n1. Welfare Functions\n Counseling\n Health Services\n Programs of Financials Aid\n Testing\n2. Control Function\n Maintenance of Records\n Discipline Functions\n3. Co-Curricular and Extra Curricular\n4. Teaching Functions\n Orientation Programs (Local and Foreign Students)\n Special Offerings of Remedial Services\n\nIn order to fulfill the various functions, the office/unit has the several units of different but interrelated functions:\n\nI. THE CAREER GUIDANCE & TESTING CENTER\nThe Career Guidance and Counseling Center offers various avenues for the holistic development of an individual. With its thrusts along the mission-vision of the university, activities are designed to assist students in attaining maximum personal adjustment and developing a sense of service contributory to the growth and development of technological advancement. PROGRAMS, SERVICES, AND INTERVENTIONS 1. Individual Inventory - involves the continuous and cooperative process of accumulating, recording, utilizing information on each individual for guidance and counseling purposes. All records are dealt with utmost confidentiality. 2. Information (educational, vocational, personal-social) - making available all the necessary materials relevant to student's life, career preparation, personality development and general information. This also includes conducted orientations on various guidance programs and services and providing of informational materials necessary for students' sound personal, social and educational adjustment. 3. Counseling (individual and group) are held to facilitate self-understanding that is contributory to the attainment of sound life adjustment. This service covers the personal- social, academic and vocational aspects. 4. Consultation - Counselors cater and consider the whole TUP academic community, as such counselors make themselves available for consultation with teachers and parents as well on matters related to students' optimum development. The consultancy service likewise extends to the adult community composed of faculty members, administrators and service personnel. 5. Psychological Assessment - Personality, interest, aptitude and other psychological tests are made available for greater assessment and understanding of the student's needs and concerns. This aims to assist students in having a realistic appraisal of oneself. Test records are filed in each students' cumulative folder should the student wish to come for test interpreatation with the help of the respective college counselor. 6. Testing - Provides testing services for admission of the following: 1. ETEAAP candidates 2. GRADUATE Program applicants 3. College Transferees 4. Employment 5. Licensing and certification exams 6. National/International exams 7. Placement and other academic purposes. 7. Follow-up - It is the responsibility of the counselor to follow up on students' cases, especially those referred to the center for counseling. This entails a series of interviews and possible consultations with concerned teachers, administrators and parents. Referral services to other institutions offering specialized services are also given attention and assistance when necessary. 8. Research and Evaluation - Relevant researches in the field of guidance and counseling are conducted by the counselors for the improvement and relevance of services. 9. Crisis Intervention - assistance to students in critical situations as victims of abuses, violence, sexual assault, sudden illness, grief and loss, and other factors causing distress, and bereavement. II. THE STUDENT DEVELOPMENT SERVICES UNIT (SDSU)\nThe Student Development Services Unit (SDSU) aims to provide total care for the students by nurturing the physical, emotional, mental, social, and spiritual aspects of their lives through various programs and services. It envisions developing students who are holistically formed, technologically skilled, morally upright, globally competitive, and emotionally mature, thereby contributing to the sustainable development of the community. It is composed of the Guidance Services Unit, Student Welfare and Scholarship Services Unit, and Health Services Unit. III. THE STUDENT AFFAIRS (STAFF) SERVICES UNIT\nThe Student Affairs Services Unit is committed to providing efficient and effective services in student admission, registration, records maintenance, and student-related transactions. It envisions to be the model unit in providing quality student services, adhering to the standards of professionalism, integrity, and excellence. It is composed of the Admissions Unit, Registration Unit, and Records and Credentials Unit."
	]
	},
	{
		"tag": "class_starts",
		"patterns": [
			"What time do classes usually begin at TUP-Manila?",
			"When are the typical start times for classes at TUP-Manila?",
			"Could you tell me the usual class start hours at TUP-Manila?",
			"At what time do students typically have their first class at TUP-Manila?",
			"How early do students need to be at TUP-Manila for their classes to start?",
			"Can you provide information on the schedule for class starts at TUP-Manila?",
			"What are the common starting times for classes at TUP-Manila?",
			"Is there a specific time when classes usually start at TUP-Manila?",
			"What is the standard start time for morning classes at TUP-Manila?",
			"Could you please inform me about the general timing of class starts at TUP-Manila?"
		],
		"responses": ["The class hours at TUP-Manila vary depending on the class schedule for each course. Typically, classes start at different times throughout the day to accommodate the various programs and courses offered. Therefore, the specific start time of classes may differ based on the student's enrolled subjects."],
		"context_set": ""
	},
	{
		"tag": "class_outlook_for_graduate",
		"patterns": [
			"What is the job outlook for graduates of this program?",
			"What career opportunities are available for graduates?",
			"How are graduates of this program typically employed?",
			"What are the employment prospects for graduates of this program?",
			"What paths do graduates of this program usually take in their careers?",
			"What kinds of jobs do graduates from this program commonly pursue?",
			"What industries are interested in hiring graduates of this program?",
			"What can graduates expect in terms of job opportunities after completing this program?",
			"What roles are graduates of this program qualified for?"
		],
		"responses": ["Graduates of this program typically have diverse career opportunities available to them. They can explore roles in various industries related on their course, or pursue further education and professional development. The skills acquired during the program prepare them for a wide range of career paths, offering flexibility and potential for growth."],
		"context_set": ""
	},
	{
		"tag": "passing_rate",
		"patterns": [
			"What is the passing rate for the board exam for this program?",
			"How well do students from this program perform on the board exam?",
			"What percentage of students pass the board exam for this program?",
			"What is the success rate of graduates on the board exam?",
			"Can you provide information about the passing rate for the board exam in this program?"
			],
		"responses": [
			"The passing rate for the board exam in this program varies from year to year. Our graduates consistently demonstrate competency and readiness to excel in their fields post-graduation. The program's curriculum is designed to equip students with the necessary knowledge and skills for success in their careers."
			],
		"context_set": ""
	},
	{
		"tag": "transferees_or_late_enrollees",
		"patterns": [
			"What is the process for transferring to this program?",
			"Can I still enroll if I missed the initial enrollment period?",
			"How can I apply as a transferee?",
			"I missed the enrollment deadline, what should I do?",
			"Are late enrollees accepted in this program?",
			"Is there a procedure for transferring into this program?",
			"Can I transfer from another institution to this program?",
			"What are the requirements for late enrollment?",
			"Is it possible to enroll after the deadline?"
		],
		"responses": [
			"For this program, we do not accept transferees.",
			"For late enrollment inquiries, please contact our admissions office. They will provide guidance on the procedures and requirements for late enrollees."
			],
		"context_set": ""
	},
	{
		"tag": "mode_of_classes",
		"patterns": [
			"What is the mode of classes for this semester?",
			"Are classes being conducted online or in-person?",
			"How are classes being delivered this semester?",
			"Is the mode of instruction for this semester affected by the weather?",
			"Is there any change in the mode of classes?",
			"What is the current mode of instruction for classes?",
			"Are classes being held in-person, online, or in a hybrid format?",
			"How are lectures being conducted this semester?",
			"Has there been any change in the mode of classes recently?",
			"Are there any adjustments to the class format due to the weather?",
			"Can you provide information on how classes are being delivered this term?",
			"What is the instructional approach for this semester?",
			"What are the arrangements for classes considering the current weather conditions?"
		],
		"responses": [
			"The mode of classes may vary based on weather conditions and other factors. For the most accurate and up-to-date information about the mode of classes, please visit our official Facebook page at <a href='https://www.facebook.com/TUPManilaUSG'>TUP Manila USG Facebook Page</a>."
		],
		"context_set": ""
	},
	{
		"tag": "happiness",
		"patterns": ["Are you happy here?", "Do you enjoy being at this college?"],
		"responses": ["As an AI, I don't have emotions, but I'm here to assist and provide information about the college."],
		"context_set": ""
	},
	{
		"tag": "strengths",
		"patterns": ["What are your school's strengths?", "What makes your college stand out?"],
		"responses": ["Our college excels in providing quality education, fostering a supportive learning environment, and offering a wide range of extracurricular activities."],
		"context_set": ""
	}
]
}